[
  {
    "id": 1,
    "title": "Why Electric Vehicles Need Four Times More Copper",
    "content": "When you think about electric vehicles, you probably think about batteries and charging stations. But there's another critical component that often gets overlooked: copper.\n\nAn electric vehicle uses approximately 80 to 90 kilograms of copper. To put that in perspective, that's four times more copper than a conventional gasoline-powered car. This massive difference isn't just a fun fact, it's creating serious challenges for the global supply chain.\n\nWhy do EVs need so much copper? The answer lies in how electricity works. Copper is the second-best conductor of electricity after silver, but it's far more affordable. EVs need copper for their electric motors, batteries, inverters, wiring, and charging systems. All that electrical infrastructure adds up quickly.\n\nThe problem is that there's no cost-effective substitute for copper in high-performance electrical systems. As countries around the world push for more electric vehicles and renewable energy infrastructure, demand for copper continues to surge. Mining companies are struggling to keep up, and new copper mines take years to develop.\n\nThis is why the world is frantically hunting for new copper sources. The transition to clean energy isn't just about solar panels and wind turbines. It's also about securing enough copper to make all these technologies work effectively.",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-world-hunts-for-copper",
    "articleTitle": "The world hunts for copper",
    "date": "2026-01-27"
  },
  {
    "id": 2,
    "title": "How India Electrified 57 Tunnels Without Road Access",
    "content": "By late 2025, India achieved something remarkable: approximately 99% of its railway network became electrified. While that statistic is impressive, the real story lies in how they did it, especially in some of the most challenging terrain imaginable.\n\nConsider the Sakleshpur-Subrahmanya section in Karnataka. This stretch required electrifying 57 tunnels and 226 bridges across landslide-prone mountainous terrain. The biggest challenge? There was no road access to most of these locations.\n\nSo how did workers install thousands of kilometers of electrical wiring in places you can't reach by truck? They used trains. All the equipment, materials, and supplies had to arrive by rail, the very system they were trying to upgrade. Imagine trying to fix your car while driving it, but make it a thousand times more complex.\n\nThis section alone took two years to complete. Workers had to carefully coordinate with existing train schedules, work in narrow tunnels with limited space, and deal with the constant threat of landslides in the region.\n\nThe Indian Railways' electrification project shows that infrastructure transformation isn't just about having the technology or funding. It's about solving logistical puzzles that most people never think about. Sometimes the journey to modernization is just as impressive as the destination.",
    "articleUrl": "https://thedailybrief.zerodha.com/p/how-the-indian-railways-became-electrified",
    "articleTitle": "How the Indian Railways became electrified",
    "date": "2026-01-27"
  },
  {
    "id": 3,
    "title": "Why Europe Sees India as the Alternative to China",
    "content": "The European Union just signed a major free trade agreement with India, and the reasons behind it reveal a lot about how global trade is changing.\n\nFor years, China has been the world's manufacturing hub. But recent geopolitical tensions, supply chain disruptions during the pandemic, and concerns about overreliance on a single country have made many nations nervous. Europe is actively looking for alternatives.\n\nAccording to European officials, India is \"perhaps the only significantly-sized alternative to China\" for trade. This isn't just about finding another cheap manufacturing destination. India has a massive market of over a billion people, a growing middle class, and increasingly sophisticated manufacturing capabilities.\n\nBoth India and the European Union are facing similar pressures. The United States is pushing for friendshoring, wanting allies to trade more with each other. Meanwhile, China's dominance in global supply chains makes many countries uncomfortable about their economic security.\n\nThis trade deal represents a strategic pivot. It's not purely about economics anymore. Countries are now making trade decisions based on geopolitical considerations, trying to build resilient supply chains that don't depend too heavily on any single nation. India stands to benefit significantly from this shift as companies look to diversify their manufacturing beyond China.",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-europe-and-the-art-of-the-deal",
    "articleTitle": "India, Europe, and the art of the deal",
    "date": "2026-01-27"
  },
  {
    "id": 4,
    "title": "Indian IT Companies May Repeat Their Cloud Computing Success",
    "content": "Indian IT companies are facing massive uncertainty as artificial intelligence transforms the technology landscape. But there's a historical parallel that suggests they might be perfectly positioned to benefit.\n\nRemember when cloud computing first emerged? Companies spent billions building cloud infrastructure, massive data centers filled with servers and networking equipment. But building infrastructure was just the first phase. The real value came later, during deployment, when companies needed help actually implementing and using these cloud systems.\n\nThe same pattern might be unfolding with AI. Right now, massive investments are going into AI data centers and infrastructure. But analysts note that once these infrastructure investments plateau, deployment will become the priority, unlocking new revenue streams.\n\nThis is where Indian IT firms have a significant advantage. They've spent decades understanding their clients' technology stacks. They know the intricate details of how companies' systems work. This deep knowledge positions them perfectly to help businesses implement AI practically across their operations.\n\nIt's the difference between selling someone a hammer and helping them build a house. Infrastructure companies are selling the hammers. Indian IT firms are the ones who know how to build houses. As AI moves from the infrastructure phase to the implementation phase, companies that understand both the technology and the business problems will be invaluable.",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indian-it-tries-to-fight-the-rising",
    "articleTitle": "Indian IT tries to fight the rising tide of uncertainty",
    "date": "2026-01-27"
  },
  {
    "id": 5,
    "title": "India's Infrastructure Spending Tripled Since 2019",
    "content": "Something significant is happening in India's capital goods sector, and the numbers are staggering. Government capital expenditure reached 11.2 lakh crore rupees in the fiscal year 2025-26. That represents a three-fold increase compared to 2019-20.\n\nCapital goods are the machines that make other things. Think of factory equipment, construction machinery, power generation equipment, and infrastructure components. When government spending on capital goods surges, it signals a fundamental shift in economic priorities.\n\nThis level of infrastructure investment hasn't been seen since the boom years of the 2000s. The government is essentially betting big on building manufacturing capacity and infrastructure. It's not just about roads and railways anymore. It's about creating the industrial backbone that can support long-term economic growth.\n\nWhy does this matter? Capital expenditure creates a multiplier effect. When the government builds a new factory, it needs machines. Those machines need to be manufactured, transported, and maintained. Workers need to be hired. Supporting industries emerge. One rupee of capital expenditure can generate multiple rupees of economic activity.\n\nThis shift represents a move away from consumption-driven growth toward investment-driven growth. It's a long-term strategy that might take years to show full results, but it signals that India is serious about becoming a major manufacturing hub.",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-cycle-of-capital-goods-twists",
    "articleTitle": "The cycle of capital goods twists and turns",
    "date": "2026-01-27"
  },
  {
    "id": 6,
    "title": "Virtual Power Agreements Could Transform Renewable Energy",
    "content": "India's new electricity policy introduces something called Virtual Power Purchase Agreements, and they could fundamentally change how renewable energy works in the country.\n\nTraditionally, power contracts work like this: a company signs a long-term agreement with a power producer to buy electricity at a fixed price for maybe 10 or 20 years. This provides certainty but creates inflexibility. If your needs change or better options emerge, you're stuck.\n\nVirtual Power Purchase Agreements, or VPPAs, work differently. Instead of physically delivering power, they settle price differences monthly through power exchanges. Here's how it works: you agree on a strike price with a renewable energy generator. Each month, if the market price is lower than your strike price, you pay the difference. If it's higher, the generator pays you.\n\nThis might sound complicated, but it solves a major problem. Companies can support renewable energy without being locked into rigid long-term contracts. Renewable energy generators get revenue certainty while maintaining flexibility to sell power wherever it's needed most.\n\nFor India, this is particularly important. The country has relied heavily on coal because it provides predictable, controllable power. But coal is inflexible and polluting. VPPAs could help India transition to a renewable-heavy grid while managing the variability of solar and wind power. It represents a shift from the coal-centric approach to a more flexible, renewable-friendly electricity system.",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indias-new-electricity-policy-tries",
    "articleTitle": "India's new electricity policy tries to switch lanes",
    "date": "2026-01-27"
  },
  {
    "id": 7,
    "title": "Why Mining Companies Gamble Hundreds of Crores Blindly",
    "content": "Imagine being asked to bid hundreds of crores of rupees on something without knowing exactly what you're buying. That's essentially how mining works, and it explains why the industry is so risky.\n\nWhen mining companies bid on mineral reserves, they don't actually know how much mineral is there or what quality it is. They're making educated guesses based on limited information. The uncertainty is so extreme that less than one in every thousand sites makes the entire journey from initial reconnaissance to actual mining operations.\n\nThe exploration process moves through four classification stages, labeled G4 through G1. G4 is basically \"we think there might be something here.\" G1 is \"we've drilled extensively and have high confidence about what's underground.\" Moving from G4 to G1 requires years of drilling campaigns that cost enormous amounts of money.\n\nEach drilling operation provides more data points, gradually reducing uncertainty. But there's no guarantee. You might spend crores drilling holes and discover the mineral deposit is smaller than expected, lower quality, or too difficult to extract profitably.\n\nThis fundamental uncertainty explains why mining is so boom-and-bust. When commodity prices are high, companies take big risks exploring new sites. When prices fall, exploration dries up. It's a constant cycle driven by the uncomfortable reality that mining companies must place massive bets on incomplete information.",
    "articleUrl": "https://thedailybrief.zerodha.com/p/in-mining-uncertainty-rules-over",
    "articleTitle": "In mining, uncertainty rules over all else",
    "date": "2026-01-27"
  },
  {
    "id": 8,
    "title": "The Contradiction in America's Energy Independence Strategy",
    "content": "At the recent Davos summit, a fascinating contradiction emerged about how countries think about energy and trade.\n\nUS Commerce Secretary Howard Lutnick criticized Europe for pursuing net-zero emissions by 2030 without having domestic battery manufacturing capabilities. His argument was that this approach would create dependency on China, which dominates battery production. Fair point.\n\nBut here's the contradiction: the United States itself is pushing energy independence through fossil fuels that it produces abundantly, rather than embracing renewable energy. The logic seems to be that energy security means producing what you can control, regardless of whether it's clean or sustainable.\n\nThis reveals a deeper tension in how countries approach energy policy. Renewable energy like solar and wind could actually reduce any nation's reliance on imported commodities or volatile global energy markets. After all, sunlight and wind are locally available everywhere. You don't need to import them or worry about supply chains.\n\nYet countries are prioritizing supply chain autonomy over both economic efficiency and climate goals. It's a geopolitical rupture where strategic considerations trump everything else. Each nation is trying to control its own energy destiny, even when that means making economically questionable or environmentally harmful choices.\n\nThe irony is that the technology that could provide true energy independence, renewable energy, is being subordinated to nationalist industrial policy about who manufactures what components.",
    "articleUrl": "https://thedailybrief.zerodha.com/p/some-interesting-things-were-said",
    "articleTitle": "Some interesting things were said at Davos",
    "date": "2026-01-27"
  },
  {
    "id": 9,
    "title": "How Nike Lost 60% of Its Value by Ditching Retailers",
    "content": "Nike made a strategic bet that nearly destroyed the company. They decided to go all-in on direct-to-consumer sales, cutting out traditional retail partners. It backfired spectacularly.\n\nDuring the pandemic, online shopping surged. Nike looked at this trend and made what seemed like a logical decision: consumers would shop exclusively online from now on, so why share profits with retail stores? They began abandoning decades-old partnerships with retailers.\n\nBut then something unexpected happened. When physical stores reopened, customers wanted to try shoes in person again. There's something about footwear that makes people want to feel it, walk around in it, and see how it looks before buying.\n\nNike's former retail partners weren't waiting around. Those empty shelf spaces that once held Nikes were quickly filled with competitors like On and Hoka. These brands happily embraced the traditional retail model that Nike was abandoning.\n\nThe result? Nike's stock collapsed nearly 60% from its 2021 peak. The company had given away its retail distribution network based on a pandemic-era trend that didn't last. Getting back into stores after burning those bridges proved much harder than leaving them.\n\nIt's a cautionary tale about strategic overcorrection. Nike saw a trend during an unusual period and assumed it was permanent, making irreversible decisions that cost them dearly when consumer behavior returned closer to normal.",
    "articleUrl": "https://thedailybrief.zerodha.com/p/just-cant-do-it",
    "articleTitle": "Just (can't) do it?",
    "date": "2026-01-27"
  },
  {
    "id": 10,
    "title": "Shadowfax Earns Just 15 Paise Per Delivery",
    "content": "Shadowfax, one of India's major logistics companies, finally achieved profitability. But when you look at the numbers, you realize just how razor-thin the margins are in the delivery business.\n\nThe company earns approximately 15 paise profit per delivery. That's less than a fifth of a rupee. To put it in perspective, that's the kind of margin where a single mistake can wipe out the profit from multiple successful deliveries.\n\nCompare this to Blue Dart, a more established logistics player, which operates with roughly 15% EBITDA margins. The difference comes down to business models. Shadowfax uses an asset-light approach, relying on gig workers and outsourced infrastructure rather than owning trucks and warehouses.\n\nThe asset-light model lets companies scale quickly without massive capital investments. But it comes with vulnerabilities. Lost or damaged shipments are a major problem. In fiscal year 2025, Shadowfax spent 141 crore rupees compensating for lost shipments. That's 6% of their entire revenue.\n\nThis explains why logistics companies are obsessed with volume. When you make 15 paise per delivery, you need millions of deliveries to build a substantial business. Every lost package hurts significantly. It's a business where operational excellence isn't optional, it's the only path to survival. One percentage point improvement in delivery success rates can mean the difference between profit and loss.",
    "articleUrl": "https://thedailybrief.zerodha.com/p/can-shadowfax-deliver",
    "articleTitle": "Can Shadowfax deliver?",
    "date": "2026-01-27"
  }
]