[
  {
    "learning": "The other is the record dividends from this year. The RBI, in particular, paid the government an all-time high ₹2.7 lakh crore last year. Collectively, dividends gave the government an additional ₹50,000 crore over what it anticipated. What the government spends A lot of the tax the central government earns rightfully belongs to the states.\n\nAccounting for that, the central government’s “revenue receipts” for this year were roughly ₹37.8 lakh crore. In the coming year, it hopes to increase those to ₹39.5 lakh crore. This is, rightfully, the central government’s spending arsenal. For anything above this, it will have to borrow money. What, in comparison, does it spend on?\n\nInterestingly, there are large parts of the government’s spending where it has no room for discretion. For instance, the government has taken substantial loans over the years, for which it has to pay interest. This interest itself is a massive sum — to the tune of ₹14 lakh crore. That is roughly one-third of the government’s recurring expenses.\n\nThere are many other such heads. The day-to-day running of our military, itself, will cost ₹3,7 lakh crore over the next year — even before we think of modernising our equipment. Government pensions will cost ₹3 lakh crore. Running our food subsidy programs will cost ₹2.3 lakh crore. Central police forces add another ₹1.5 lakh crore to the government’s bills.\n\nEffectively, in running the government, only counting business-as-usual costs, the government already spends roughly ₹1 lakh crore more than it earns — what it calls its “ effective revenue deficit ”. In other words, to make ends meet, the government spends ~0.3% of our GDP more than it has. Changing this is possible , but it is usually controversial.",
    "title": "Everything you need to know about the budget",
    "articleUrl": "https://thedailybrief.zerodha.com/p/everything-you-need-to-know-about-b93",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "me importance today as it did in the past. He breaks down what a budget really is at its core—how the government plans its spending, where the money comes from, and how gaps are financed. He also shares why headlines and budget speeches can be misleading and why the real insights lie deeper in the budget documents.\n\nThe discussion goes into what actually matters for investors and citizens alike. Deepak talks about how to spot meaningful policy changes, understand long-term spending direction, and separate symbolic announcements from decisions that can truly impact the economy over time. He also touches on areas where India needs stronger policy thinking, such as infrastructure, logistics, agriculture, and capital markets.\n\nA large part of the conversation focuses on common mistakes people make on budget day. Deepak explains why reacting to market moves during the budget can be risky, especially when liquidity is low and price signals are unreliable. He shares practical advice on staying calm, avoiding knee-jerk trades, and thinking beyond a single day or headline.",
    "title": "Deepak Shenoy on how to think about the budget",
    "articleUrl": "https://thedailybrief.zerodha.com/p/deepak-shenoy-on-how-to-think-about",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "And what JSW Steel described in their latest results was similar. When asked which sectors would lead this growth, management’s response echoed UltraTech’s thesis: “We are seeing growth across sectors in the India story. This includes construction, infrastructure, and commercial real estate. We are seeing strong growth in industrial sectors and, post-GST, in consumption sectors like automotive and appliances.\n\nAnother major area is renewable energy.” Source JSW Steel also provided a useful piece of context that explains why October and November were weak for both cement and steel: “Central government capex was low in October and November but is up 28% from April to November due to a strong H1 performance. The annual capex target appears to be on track.” Source Government spending was front-loaded in the first half of the fiscal year, then slowed in October-November. When government projects paused, contractors stopped ordering materials, demand softened, and prices fell.\n\nBut with the full-year capex target still on track, both companies expect a strong Q4 as spending catches up. So far, this is a straightforward story. India’s two largest building materials companies are seeing strong demand, driven by government infrastructure spending. Both are confident about the future.\n\nBoth are investing heavily to capture it. However, when it comes to private capex, the confidence isn’t as strong as for infrastructure or real estate. Now, JSW Steel seems to indicate otherwise when they said: “Conditions for private capex are increasingly conducive, supported by healthy balance sheets, the RBI’s recent rate cuts, and lower inflation.” Source Now, conditions may be conducive.\n\nBut is private capex actually picking up? Before I answer that, let me explain why private capex matters a lot. See, there’s a meaningful difference between an economy powered by government spending and one powered by private investment. When the government builds a highway, it creates demand for cement and steel and labor.",
    "title": "Why private capex in India is still not picking up? | Who said what? S2E28",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-private-capex-in-india-is-still",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "lly explosive to give foreigners high-paying jobs — especially if there was high unemployment. Pharma is yet another example. Europe is a drug innovator, holding many patents on new medicines. India, meanwhile, is the pharmacy of the world , exporting cheap generics made from expired patents — including to Europe, our second-largest export market.\n\nThere is certainly a win-win here. Source: ICRA Yet, Europe has been pushing for a “ data exclusivity ” clause for its drugs. Under this clause, for a period, India could not rely on the originator’s clinical data to make their generics. This was a huge no-no for India, which saw this as a strengthening of monopoly power beyond the patent.\n\nNeither here, nor there Beyond this framework, there are also goods where, even when a clear win-win existed, trade barriers still existed. See, for a long time, India was part of the special European list called the Generalized Scheme of Preferences (GSP). The GSP assured lower tariffs for imports from developing countries like ours.\n\nIn particular, our textiles industry benefited heavily from this special status. Source But, as India grew and its exports became more globally competitive, Europe didn’t see it fit anymore to include them in the GSP. So, our products were gradually phased out because we didn’t seem to need it anymore.\n\nYet, some of our peers that were phased out of the GSP, like Vietnam, had signed a trade deal with Europe. This led to lower European tariffs on Vietnamese products, effectively undercutting Indian goods. The best way out of this was to sign our own deal with Europe. A necessary compromise What accelerated the death of this stalemate seems to be geopolitics.",
    "title": "India, Europe, and the art of the deal",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-europe-and-the-art-of-the-deal",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "uming industrial activities in the world. The whole process from discovering a deposit to producing the first tonne of copper can take up to 20 years. Besides enormous amounts of capital, it also involves geological surveys, environmental approvals, land acquisition, drilling, and so on. A miner might spend billions of dollars for years — even decades — before earning a single rupee.\n\nPerhaps it’s because of these huge risks that most companies only get interested in mining when copper prices are high. By that point, the economics look attractive on paper. But mining projects take many years to build. By the time new supply finally comes online, copper prices often have cooled, leaving companies with large investments that arrive too late in the cycle.\n\nThe economics of copper smelting, on the other hand, don’t benefit as much from high copper prices. Their margins depend on something called treatment charges and refining charges, known collectively as TC/RC. When a miner produces copper concentrate, it sells that concentrate to a smelter. The smelter charges the miner a fee for processing the concentrate into refined copper.\n\nWhen there are many mines and limited smelting capacity, smelters have bargaining power and can charge higher TC/RC. But with many smelters chasing limited concentrate, miners gain the upper hand, suppressing TC/RC. In today’s world, smelting capacity has expanded faster than mining capacity. China, India, and parts of Southeast Asia have built large smelters, but new mines have lagged.\n\nAs a result, smelters are competing aggressively for concentrate. This has pushed TC/RC to bedrock-low levels, squeezing smelter margins even with high copper prices. In the last 10 years, TC/RC rates have fallen from ~$100 to ~$20. Source This dynamic explains why mining companies often benefit more directly from rising copper prices than smelters do.",
    "title": "The world hunts for copper",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-world-hunts-for-copper",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "rica — which has oil and natural gas — try to convert entirely to electricity? China does not have oil and natural gas. Electricity and electric cars make perfect sense for them. That is practical and logical. The point I want to make — and I want people to think about this — is that America First means the job of the government is to take care of its workers, to make sure their lives are better for it.\n\nThat doesn’t mean America alone — but it does mean America first. That is a lot to take in — even for Lutnick’s fellow panelists, who were clearly in shock with what he said. In essence, Lutnick is making a statement about what US foreign policy is today. For them, any dependence on China is not desirable, even if it could improve our chances in the battle against climate change.\n\nBut besides China, there are other details worth dissecting in his quote. For one, while reliance on China might not be nice to have, does that make an overreliance on the US for oil & gas inherently better? In 2024, oil production in the US reached an all-time high. Last year, the US swung into becoming a leader in natural gas production.\n\nThe US basically controls the global markets for these commodities. Source Countries that depend on procuring their oil needs from global markets know how volatile prices are and how that hurts their trade balances. So, they are trying to diversify away from that issue by scaling up renewables. With solar panels, the thinking goes, all the power is generated in-house, even if you import the panels from elsewhere.\n\nThat inherently reduces the price volatility of renewables. And the world is answering accordingly, just as solar prices keep dropping. India has jumped to becoming one of the biggest solar players in the world. In the 12 months since August 2024, the entire African continent imported 60% more solar panels than the preceding year.",
    "title": "Some interesting things were said at Davos | Who said what? S2E27",
    "articleUrl": "https://thedailybrief.zerodha.com/p/some-interesting-things-were-said",
    "date": ""
  },
  {
    "learning": "business is designed elsewhere. All the most important decisions — what to serve, how to go about it, how to brand yourself, and so on — belong to Yum! This is why the merger is unusual. These two businesses were designed to fit into each other like lego blocks. If anything, this merger is about removing an artificial split between two operators following the same playbook — turning them into a single, larger execution engine.\n\nThe slowdown, and the merger So why merge now? Well, as we told you at the start, for the past few years, the QSR sector in India has been under pressure. It had a good run after the pandemic, but that momentum has faded. It’s not that people have stopped eating fast food altogether. Dominos, for example, is still doing well.\n\nSource KFC and Pizza Hut, however, seem to be losing out — for reasons we aren’t entirely certain about. For both Devyani and Sapphire, same-store sales growth — which measures how much revenue existing stores are generating compared to last year — has been flat or negative for several quarters. This is especially painful for franchisees, because a large chunk of their costs stay fixed, even if fewer people are walking in.\n\nStore rent, salaries, technology fees — all these payments have to go out on time, no matter how much business they do. Equally, their payments to Yum!, as franchisees, are calculated on gross sales , not profits. Even if they’re struggling to make money, the payments don’t cease. And so, as demand shrinks, they can suddenly slip into losses.\n\nUnite and rule The hope, with this merger, is that scale can bail them out. Most importantly, they could cut down the “brand-level” costs they must pay to Yum! Individually, neither Devyani nor Sapphire has much bargaining power to change this equation. If anything, they balance each other out — if one pushes too hard, Yum can always point to the other.",
    "title": "Can two struggling businesses make a strong one together?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/can-two-struggling-businesses-make",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "behaves once competition really kicks in. It might sound a little like how it is here in India. Meituan is best understood not just as a food delivery app, but like a super app that houses everything that has to do with local consumption, whether it’s groceries,meds, hotel booking, rides, and whatnot.\n\nSource At its core, Meituan connects nearby demand with nearby supply and moves things across short distances very efficiently. Food delivery mattered because people order food frequently, and that frequency helped Meituan build dense rider networks and daily habits. Once that infrastructure existed, adding other categories became much easier.\n\nFor several years, Meituan dominated this space with relatively limited competition. That changed when Alibaba and JD.com decided they could no longer stay on the sidelines. Over the past year, both companies have poured billions of dollars into launching and expanding instant delivery services of their own, using aggressive discounts, heavy marketing, and large incentives for couriers.\n\nThis is what triggered the current price war and what pushed Meituan back into losses. Source What’s important to understand is that this was not driven by a sudden belief that food delivery had become a great standalone business. On a pure unit economics basis, it is not. Meituan’s Local Commerce CEO, in an interview with LatePost , said this.\n\nBy the way, this is translated using GPT, so there might be some discrepancy: Food delivery is a delicate and low-profit business model. If you deviate even slightly in every step, you will end up losing money.Our OPM (Operating Profit Margin) is only around 3%, Average order values are low, delivery costs are high, and margins are thin even in good times. Once heavy discounts are layered on top, the economics quickly turn negative.",
    "title": "Lessons from China’s delivery war | Who said What? S2E24",
    "articleUrl": "https://thedailybrief.zerodha.com/p/lessons-from-chinas-delivery-war",
    "date": ""
  },
  {
    "learning": "Check out more of Kashish’s writings here: Why Pakistan’s Solar Revolution Backfired Zerodha · July 8, 2025 Read full story A new bill could sink India’s drones from the sky Zerodha · November 21, 2025 Read full story India’s push to get the aam aadmi to fly Zerodha · October 31, 2025 Read full story Is there a private capex crisis in India? Zerodha · October 14, 2025 Read full story The puzzle of why rural India is consuming more Zerodha · September 19, 2025 Read full story",
    "title": "Meet The Writers ft. Kashish Kapoor",
    "articleUrl": "https://thedailybrief.zerodha.com/p/meet-the-writers-ft-kashish-kapoor",
    "date": ""
  },
  {
    "learning": "e still have jobs is that he wakes up at 6 AM every day. Check out more of Krishna’s writings here: Will UPI Stay Free Forever? Zerodha · March 27, 2025 Read full story All you need to know about ports Zerodha · June 19, 2025 Read full story Nothing is forever: The De Beers story Zerodha · August 5, 2025 Read full story How much are Indians buying: A story told through con-calls Zerodha · August 14, 2025 Read full story Inside India’s Grocery Wars and Why Gold’s Rising | Who said What?S2E17 Zerodha · October 25, 2025 Read full story",
    "title": "Meet The Writers ft. Krishna Lohia",
    "articleUrl": "https://thedailybrief.zerodha.com/p/meet-the-writers-ft-krishna-lohia",
    "date": ""
  },
  {
    "learning": "Source And that’s where this story begins for our Japanese mega-banks, who were now flush with cash. From Hoarding to Spending First, firms began giving money back to their shareholders. A few years ago, the idea of conservative Japanese firms aggressively returning cash would’ve raised eyebrows, but not anymore.\n\nWith these reforms, corporate Japan has gone from hoarding cash to showering it on investors. The most immediate evidence is a record-breaking, even accelerating surge in share buybacks — when a company purchases its own stock from the market. In November 2024 alone, buyback announcements exceeded ¥2 trillion , a monthly record.\n\nBuybacks are a savvy move if you believe your stock is undervalued (which, as we noted, many Japanese stocks were). For companies trading below book value, buybacks are mathematically one of the most efficient ways to improve ROE and boost the share price. Dividends are following a similar skyward trajectory.\n\nTotal dividend payouts by Japanese firms hit roughly ¥18 trillion , another record high, last financial year — reflecting a much more shareholder-friendly stance than in the past. This revolution signals that Japanese management teams are finally accepting the cost of equity as a real constraint. They’re realising that they can’t just sit on money — shareholders expect a return, and if they can’t get good returns on their cash, they ought to give it back.\n\nNo one is feeling this transformation more acutely than Japan’s megabanks — MUFG, SMFG, and Mizuho. These banking giants are sitting on mountains of cash . They’ve enjoyed record earnings recently, thanks to a resilient business at home and years of conservative management. On top of that, as we discussed, they’ve been selling off their cross-shareholdings, which is bringing in even more money.",
    "title": "Indian banks court some suitors from Japan",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indian-banks-court-some-suitors-from",
    "date": ""
  },
  {
    "learning": "ar winners from this rewiring. At the same time, many Asian manufacturers face tougher competition as Chinese goods are redirected into their markets. And despite all the talk of decoupling, a clean break remains unlikely. The US still depends on allies for minerals and processing, while China’s grip on rare earths keeps both sides tied together.\n\nSource Big government and the fiscal overhang On fiscal policy, the reports are surprisingly aligned. Governments are bigger, deficits are wider, and this isn’t something that’s going to reverse anytime soon. Source Government finances are already stretched in most big economies, and many are likely to get worse in 2026.\n\nAs per Morningstar , budget deficits across the G7, China, India, and Brazil are staying firmly in the red through 2025 and 2026. The reasons are well known, but they’re all hitting at the same time: slower long-term growth, aging populations that push up pension and healthcare costs, higher welfare spending, bigger defense budgets, and rising interest bills as old debt is refinanced at higher rates. Source Weak public finances are becoming one of the biggest risks to sovereign credit ratings, not just in rich countries but also in large emerging markets like China, India, and Brazil.\n\nWhat makes this period different is that these deficits aren’t being driven by a crisis. Many governments are running large, persistent budget gaps even though unemployment is low and growth is reasonably stable. That leaves much less room to respond when the next slowdown eventually comes. It also means bond markets start worrying about fiscal risks much earlier than they used to.\n\nFranklin Templeton describes this shift as the start of an “era of big government,” as we touched on in part 1. The old belief in small government, tight budgets, and strict discipline has been fading ever since the global financial crisis. Today, governments are playing a much bigger role in trade policy, industrial strategy, defense, the energy transition, and social support.",
    "title": "Outlook 2026 - Part 2: Trade, government, and growth",
    "articleUrl": "https://thedailybrief.zerodha.com/p/outlook-2026-part-2-trade-government",
    "date": "October 26, 2025"
  },
  {
    "learning": "and checks “ Is everything okay with this request? ” If it’s safe, Cloudflare serves the content cached in that server itself. If the request looks suspicious, Cloudflare stops it right there. All of this is invisible to you, but it makes the connection both faster and more secure. Protecting IPs Traditionally, any website’s IP was exposed to the world — attackers included.\n\nA malicious actor would know exactly where to look for vulnerabilities. Cloudflare, however, masks one’s original IP address from the world, acting as a “ Reverse Proxy ”. If you use their service, whenever someone looks up your website, your domain doesn’t point to your actual server, but that of Cloudflare.\n\nCloudflare then connects to your server at the back-end. Your server is invisible to the public internet; it exists only for Cloudflare. Source The firewall Once Cloudflare takes requests on its own servers, it can do many things to protect your website. For one, it just absorbs many more requests than any single server can.\n\nThis makes sure your servers don’t drown in traffic — whether from attackers or otherwise. If it needs to fetch anything from your original server, it can control how much traffic gets there, rate-limiting it when necessary. It can also run all sorts of checks on any incoming request. If it thinks something harmful is coming in — like a bot, or traffic from a malicious source — it can throw up challenges to verify that it’s legitimate.\n\nIf you’ve ever seen something like this, for instance, you’ve seen Cloudflare in action. Source Efficiency Cloudflare uses something called “ anycast routing ”. Its grid of servers store cached copies of a website’s content at different locations in the world. Those servers all have the same IP address.",
    "title": "When Cloudflare sneezes, the internet catches a cold",
    "articleUrl": "https://thedailybrief.zerodha.com/p/when-cloudflare-sneezes-the-internet",
    "date": ""
  },
  {
    "learning": "The new test cycle is closer to how people actually drive, which usually makes the numbers look worse on paper. And third – this is the tricky bit – the government is changing how it hands out bonus points. Right now, certain technologies like CNG or mild hybrids get extra credit in the formula. That helps bring a company’s average down, even if the cars aren’t that much cleaner.\n\nThe new rules could shrink those bonuses. That’s where Maruti’s worry comes from. Rahul Bharti’s first complaint is about how little help small cars are getting. In the September 2025 draft, the government offered a small relief for petrol cars that are light (under 909 kg), have small engines (below 1,200 cc), and are small in size (under four metres).\n\nIf a car ticks all those boxes, it gets 3 grams per kilometre knocked off its CO₂ number in the CAFE calculation. His point is that this is nothing. Three grams is a rounding error. He says in Europe, small cars get an 18 gram relaxation which is six times more. So if the overall CAFE-3 target is set really tight, that tiny 3-gram bonus won’t be anywhere near enough to keep small cars alive in the math.\n\nWhy does this land so hard for Maruti in particular? Because nobody in India sells more sub-909-kilo cars than they do. For decades Maruti has made its money selling exactly these light, fairly simple petrol hatchbacks. It has some hybrids now and will have more EVs in future, but it does not yet have the kind of EV volume that can drag its fleet average down the way Tata’s or, eventually, Mahindra’s can.\n\nIn that context, when Bharti talks about “unscientific and unjust” targets and the risk of discontinuing a small car that already “produces a very low absolute carbon dioxide”, what he is really saying is: if you set the average too low and you don’t give small cars much recognition, the maths will eventually make these cars impossible to keep in the portfolio without paying big fines. And here’s where it gets interesting, because the rest of the industry doesn’t agree with Maruti at all. Tata Motors and Mahindra & Mahindra are against this idea of giving extra relief to very small petrol cars.",
    "title": "Why CAFE-3 has carmakers worried... and Why AI can’t replace humans yet | Who...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-cafe-3-has-carmakers-worried",
    "date": "October 26, 2025"
  },
  {
    "learning": "ports has risen dramatically over the last two years — from the low-20s, they now make up over 38% of its total raw material costs. Logistics The next sphere where Wakefit pushes middlemen out is logistics . It runs a tight network — with a central “mother warehouse”, that sends goods out to a series of nodes across India.\n\nThe company’s own fleets take care of most deliveries, with third parties only coming in when a package needs to reach a remote area. Mastering this is easier said than done. This is an industry where you’re almost exclusively dealing with bulky items like furniture and mattresses, which can be awkward to move.\n\nThe success of such a business can hinge on its ability to move them at a reasonable price. The company has mastered the art of compressing its products in a way that permits easy shipping. Indeed, many of them are built for easy transportation. For instance, it “roll-packs” its mattresses — compressing them into tight “spherocubes”, allowing them to ship large mattresses in a box that a single person could carry.\n\nSource Similarly, it ships most of its furniture in “flat-packs” — as a compact arrangement of components that are assembled in a customer’s house. Arrangements like this allow the company to fit more units in a truck or warehouse, and ensure limited damage during transit. Distribution As a customer, the most visible part of Wakefit’s D2C model is probably distribution .\n\nWhile the company lists its products on e-commerce and quick commerce websites, a majority of its sales happen through its own channels. This is another trade-off: while selling through third parties can bring you visibility , by outsourcing distribution, you might surrender 20-25% of your margins to intermediaries. But curiously, the company’s own channels are going through a major shift.",
    "title": "The Wakefit IPO: new dog, old tricks?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-wakefit-ipo-new-dog-old-tricks",
    "date": ""
  },
  {
    "learning": "It had everything: a full-scale theme park, a separate water park, a snow park, a five-star hotel, and elaborate theming. It spent heavily on imported rides and international designers. It aimed for destination tourism. But three things went wrong: First, the pricing pushed it straight into the “mini vacation” category instead of a casual weekend plan.\n\nLogically, why would you spend ₹40,000 on a single day at a park, when you could just vacation at a nearby beach at similar prices? Second, its location on the Mumbai–Pune Expressway was far enough from both cities to discourage repeat visits. Third, it was built on a mountain of debt. When footfalls didn’t rise fast enough, the business stumbled.\n\nOver time, the project ran into financial trouble, went through debt restructuring, and eventually shifted to a new owner , the Malpani Group. Imagicaa still exists today, but more as part of a cluster of regional parks than as the iconic fantasy destination it once hoped to be. Both companies, in their own ways, explain why Indian parks look the way they do.\n\nIf you dream too big to build your own Disneyland, you will likely drown under debt and demand mismatch. Dream too little, and you don’t grow. The ones that survive learn to play the middle. As boring as it sounds, this is also the answer to the question we started this piece with: Why don’t we have a Disneyland?\n\nHere’s how Wonderla’s chairman — Arun Chittilappilly — explained it in a Fortune India interview : “There’s this fantasy that Disneyland or Universal Studios can work in India, but the reality is different. Their scale requires 300 to 400 acres, massive investments of ₹5,000–10,000 crore, and ticket prices upwards of ₹10,000. That just doesn’t fly in India.” Indian consumers are price-sensitive, but without high ticket prices, world-building becomes impossible.",
    "title": "The economics of amusement",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-economics-of-amusement",
    "date": ""
  },
  {
    "learning": "ices to shore up earnings, in diagnostics, the opposite is happening. This is clear from CareEdge’s data ; in the five years between FY 2021 and FY 2025, revenue per patient fell — from ₹786 to ₹759. Revenue per test fell even more drastically in the same period; from ₹233 to ₹187. Instead, these companies are growing by carrying out an increasing number of tests on more and more patients.\n\nEven as prices fell between FY 2021 and FY 2025, the industry saw 12% CAGR in patient volumes and a 17% CAGR in the number of tests. Source This dynamic makes a lot of sense — because the marginal cost of new tests keeps falling as volumes go up. Once you’ve set up a lab, the machines sit there. Your technicians are already staffed; your backend is already running.\n\nIt costs almost nothing to run one extra test. Any additional revenue flows straight to your bottomline. The more samples you funnel into a setup, the more profitable the business becomes. That’s why these companies try to acquire as many customers as possible. They do that in two ways: B2C vs B2B. B2C — where customers walk in, or book a home collection through an app — is the high-margin, low-volume side of the business.\n\nThis is the sweet spot; customers pay retail rates, bringing better realizations. Moreover, if a person directly opts for a test from a brand, that makes them more likely to remember the brand, which means they might come again for their next test. Lal, for instance, gets ~74% of revenue from B2C — which is perhaps what makes them the largest and most profitable chain in India.\n\nThe alternative is B2B, where diagnostics companies act as suppliers to hospitals or large clinics, which send them bulk samples at a discounted rate. The volumes can be huge with such a business, but margins are much thinner than B2C. At its core, diagnostics is a cost game The tests a diagnostics lab carries out, in some sense, are commodities .",
    "title": "Diagnosing the Diagnostic Business",
    "articleUrl": "https://thedailybrief.zerodha.com/p/diagnosing-the-diagnostic-business",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "e opposite story playing out globally. This was a messy quarter for Tata Motors, not necessarily because India is slowing, but because Jaguar Land Rover (JLR) — the part of the business that usually carries the group — ran into almost every possible headwind at once. This is also the first quarter after the commercial-vehicles business de-merged from the passenger-vehicle (PV) side, so the way the numbers show up on paper is slightly different.\n\nBut that’s a sideshow to what’s happening with JLR. On the consolidated PV + JLR side, revenue is actually down about 13–14% year-on-year. The CFO says openly that the weakness at JLR was “only partially offset by 15% top line growth in the India business and the translation benefit in GBP–INR.” In other words, India is fine, but JLR was a massive drag.\n\nSource The JLR story this quarter is one of operational disruption colliding with a weaker global luxury market. In September, JLR experienced a massive cyberattack which forced systems offline and brought almost all of its production to a halt . Volumes of key models like the Range Rover, Defender, and Discovery were 20–25% lower quarter-on-quarter.\n\nAt the same time, the luxury markets in China and Europe softened. To keep cars moving, JLR had to raise discounts, which jumped from 4.1% to 6.9%. Half of that hit wasn’t even from cars sold — it was from cars sitting in dealer inventory, because accounting rules force you to recognise the discount up front.\n\nThis is why the numbers look the way they do. The PV + JLR side ended the quarter with a PBT loss of around ₹5,500 crore, plus about ₹2,600 crore of exceptional costs linked to the cyber incident and voluntary separation programmes at JLR. Net auto debt also moved up to around ₹20,000 crore, largely because JLR had to absorb this shock.",
    "title": "India’s biggest carmakers switch gears — both up and down",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indias-biggest-carmakers-switch-gears",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "Nothing about this resembles a flat industry. And the divergence doesn’t stop at pure EVs. TVS said domestic ICE two-wheeler sales grew 21% for them, against industry growth of 8%. Source Scooters are growing faster than the broader market. Bajaj said October was an all-time high for its Pulsar portfolio, and that exports have reached a new peak after months of volatility.\n\nBoth companies are pointing to momentum — steady, broad-based, and visible across segments. If Ola is describing the market as flat, it is the only one seeing it that way. Part of the answer sits in the details Ola didn’t emphasise. Back in July, the company publicly guided for 3.25–3.75 lakh vehicles in FY26, anchored on the festive season and the rollout of its Gen 3 platform.\n\nSource But in the latest call, that guidance quietly fell away. Instead, the company said it expects to deliver just 1,00,000 units in the second half. Even if you add the first half, the full-year number comes in far below the earlier target. A reset of that scale doesn’t appear out of nowhere. Source And there’s a missing piece here that the company didn’t highlight directly, but you can see when you compare it with competitor commentary.\n\nIf Ather is growing 40–60% in multiple markets, and TVS and Bajaj are seeing multi-year highs across premium and scooter categories, then someone’s share is shifting. The simplest reading is also the most likely one: Ola didn’t just see a flat market. It saw its own share being chipped away by competitors who are growing into the space it once dominated.\n\nThe “industry flatness” line hides that possibility, but doesn’t remove it. Meanwhile, something else happened around the same time: Bhavish Aggarwal pledged an additional portion of his Ola Electric shares, raising the pledged stake from 8.09% in June to 10.11% in September. If you put all four calls side by side, the contrast is sharp.",
    "title": "Ola says the market is flat, Tata Steel says it’s going green | Who said What...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/ola-says-the-market-is-flat-tata",
    "date": ""
  },
  {
    "learning": "nts to get the most out of its existing facilities before rushing to open more. Right now, only ~25% of Instamart stores are CM-positive, meaning they make money after direct costs. The rest, though, still have some road left before they turn CM-positive. Swiggy is being cautious with how it expands, hoping to reach breakeven without stretching the network too quickly.\n\nSource Blinkit, in contrast, aggressively expanded their network. It added 270+ stores this quarter, pushing its total close to 1,800. And it still wants to reach 3,000 stores by March 2027. But the real insight isn’t the number of stores — it’s where they’re being added. Eternal said that 70–75% of new stores are coming in the top 10 cities.\n\nThey’re not really expanding across India , but instead saturating the biggest, richest, most frequently ordering cities — because that’s where the economics of quick commerce work best. A store in South Delhi or Mumbai, for example, can do multiple times the order volume of a store in a small city. Blinkit wants to flood the strongest markets before worrying about which stores to shut down.\n\nBut the more interesting part of Blinkit’s strategy is the shift to the 1P inventory model that we mentioned earlier. This is a huge operational change, and they said they’re 80% through the transition. Source Owning inventory gives Blinkit more control over what’s available, and the ability to negotiate directly with brands — which can potentially translate to better margins.\n\nBut it also brings new costs — like the first-mile cost, which they now have to pay because sellers aren’t delivering goods to stores anymore. Blinkit said the full margin benefit of this shift will take 4–6 quarters to show up. Zepto is also trying to move toward an inventory-led model, but there’s a structural roadblock.",
    "title": "Quick commerce feels the need for speed",
    "articleUrl": "https://thedailybrief.zerodha.com/p/quick-commerce-feels-the-need-for",
    "date": ""
  },
  {
    "learning": "That spread is how the platform earns. If you put in ₹10,000, ₹300 is gone in tax, and another ₹200–₹300 goes to the platform. You’re instantly looking at a ₹500–₹600 loss, as soon as you invest. In other words, your ₹10,000 “investment” only buys you ₹9,400–₹9,500 of gold. Conclusion SEBI’s note is a reminder that while digital gold might sound sleek and modern, underneath, it’s an unregulated product.\n\nYou might choose to trust it anyway , but at the very least, you should understand the risk you’re taking on. If something were to happen to the platform selling that goal, there’s no safety net. There’s no SEBI or stock exchange to bail you out. Your only real recourse is to go through the normal court system, seeking the very same assets that all of the company’s creditors will be after.\n\nIf you’re looking for an exposure to gold, a ready alternative might be a Gold ETF. Just like digital gold, they give you a claim on a certain amount’s worth of gold. Unlike digital gold, however, they’re regulated, transparent, and liquid. You can buy them through any broker at a public price, and your holdings sit safely with the depository — far from the control of the broker that you bought them from.\n\nFrom stone to gas: India’s coal gasification gambit Throughout October, we had seen a series of headlines that, at first glance, barely made sense to us. The government was making a strong push for the “ gasification of coal ”. To this end, it recently opened auctions for sites where this could happen underground.\n\nCoal was, as far as we knew, clearly solid. Those questions launched us into a deep and fascinating rabbit hole. Some of this, we realised, was intuitive. If you’ve ever tried to light a bonfire or start a barbecue, you’ve probably realised how unpredictable and messy burning something solid can be. Gases, in comparison, are relatively simple.",
    "title": "SEBI isn't a big fan of digital gold",
    "articleUrl": "https://thedailybrief.zerodha.com/p/sebi-isnt-a-big-fan-of-digital-gold",
    "date": ""
  },
  {
    "learning": "cally, insure itself in case this AI infrastructure boom goes wrong. And, the best one out of this week was when Sam Altman went on a podcast with Brad Gerstner, who’s an investor in OpenAI and Satya Nadella. Brad asked him the blunt question that everyone has been talking about for the longest time: “How can OpenAI, with around $13 billion in revenue, commit to $1.4 trillion in spending?” And, the reply was just bold.\n\nHe said, first of all, that the $13 billion figure is wrong — “we’re doing well more revenue than that. ” Then he said, “If you want to sell your shares, I’ll find you a buyer.” Source That’s WILD . But here’s where things took another turn. Because right after all this noise, Sam Altman put out a long clarification post .\n\nHe said: OpenAI does not have or want government guarantees for its data centers. We believe governments shouldn’t pick winners or losers, and taxpayers shouldn’t bail out companies that make bad decisions, But what came right after matters more. He said there’s a version of government involvement that does make sense - not backing private companies, but governments building their own AI infrastructure.\n\nA strategic national reserve of computing power, like an energy reserve but for compute. The government builds it, the government decides how to use it. The only place OpenAI has even discussed loan guarantees was for semiconductor fabs - helping secure domestic chip supply. That’s not about bailouts, that’s industrial policy.\n\nSo he wasn’t just walking back the CFO’s comments. He was reframing the whole conversation - away from “OpenAI needs government help” toward “the government should think about compute like it thinks about oil or energy.” See, the reason all this is such a big deal is that these are not small numbers. A trillion dollars of spending is closer to the scale of national infrastructure.",
    "title": "AI’s wild spending spree, Maruti’s unexpected turnaround | Who said What?S2E19",
    "articleUrl": "https://thedailybrief.zerodha.com/p/ais-wild-spending-spree-marutis-unexpected",
    "date": ""
  },
  {
    "learning": "usually signed is fixed-price — meaning it can’t change over its entire duration. After that, it begins making the parts in the factory. Usually, any construction company (even a PEB one) has to pay for costs first — like raw material, fabrication, and transporting PEB parts from factory to site. However, a PEB also has high fixed costs — you need lots of machines like cranes and beam lines to run a PEB factory.\n\nThe revenue always comes much after paying all these costs. A construction firm gets paid in stages — a bit upfront, more when the structure is delivered, and the last bit when the client approves the final product. Unlike a regular construction contract which is multi-year, a PEB project finishes within 6-10 months.\n\nThis makes three things very important for the margins of a PEB company, which make it different from regular construction. First, the cost of raw material. PEB projects have to deal with the economic cycles of steel, which are going to be different from that of concrete used in regular construction. That changes the cost profile of the business significantly.\n\nThose high fixed costs require a steady flow of projects — and therefore high operating leverage. With enough orders, each extra ton of steel adds more profit without adding much cost, leading to economies of scale . A company running at 60% utilisation has a very different margin profile from one running at 85%, even if their tonnage is similar.\n\nThat’s why people tracking this space keep a close watch on installed capacity and dispatch volumes. The third factor is working capital. How fast a company turns each order into cash matters just as much as how many projects it has logged on its order book. PEBs inherently make working capital cycles shorter than regular construction projects.",
    "title": "The literal building blocks of the future are here",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-literal-building-blocks-of-the",
    "date": ""
  },
  {
    "learning": "ng: I want better, because now I can. You can see this pattern everywhere. A decade ago, hatchbacks made up half of India’s car market and SUVs barely a tenth. The middle class wants larger cars, sleeker dashboards, ambient lighting, features that once lived in luxury catalogues. In liquor, the same thing: regular whisky grows 2–3% a year, but Indian single malts and craft spirits are compounding 15–30%.\n\nAs Siddhant said, “It’s driven by aspiration, but also by confidence. Indians now want to consume their own premium products, not just import them.” The pattern extends beyond autos and alcohol, into real estate, food, and travel. It’s not just rising salaries; it’s the wealth effect. When asset prices rise (stocks, gold, property), people feel richer.\n\nThat feeling shows up in what they buy: better homes, better holidays, better brands. This isn’t unprecedented either. When China’s per capita income crossed roughly $2,300, e-commerce spending exploded 30x in eight years, and China became a third of global luxury demand. India is following a similar arc, just at its own rhythm.\n\nYou can already see it in the cities. Families that once saved every rupee now spend on experiences, convenience, and time. The playbook’s familiar, but the expression is very Indian. Technology, of course, accelerates all of this. Progress works like this: what starts as luxury quickly becomes baseline.\n\nFlying was once aspirational; now, it’s a low-cost routine. Smartphones that once cost a month’s salary are utilities. Every time access expands, a new layer of “premium” appears above it. Data became cheap thanks to Jio; now people pay extra for fibre speed and seamless connectivity. Each solved problem creates the next upgrade.",
    "title": "The rise of premiumisation ft. SOIC",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-rise-of-premiumisation-ft-soic",
    "date": ""
  },
  {
    "learning": "prices, with the average bill value up 52 % year-on-year. The jump wasn’t from people buying heavier jewelry — it was mostly the price of gold itself. With prices up sharply, the average bill got bigger even though volumes fell, and many customers simply exchanged old gold instead of buying new. That surge came from customers trading up to heavier, higher-value pieces even as overall volumes softened.\n\nThe company said its old-gold exchange share rose to 32.5 % from 21.9 % a year ago — meaning more shoppers are swapping older jewellery for new designs. Source Jio Platforms Now, let’s look at the telecom side. Jio Platforms’ operating revenue for this quarter came in at ₹36,332 crore, up 14.6% year on year, while net profit stood at ₹7,375 crore, up 12.8%.\n\nSource This surge in revenue comes from two factors. But secondly, each customer is also paying more, as Reliance increased its average revenue per user (ARPU) to ₹211.4, from ₹195.1 last year. Source In return, people are using Jio’s network more than ever. Data traffic jumped nearly 30% year-on-year.\n\nPer-capita data consumption hit 38.7 GB per month — the highest in India’s telecom market. And this is hardly limited to just urban areas; rural data traffic has also grown 2.2× year-on-year. But the company is adding a new feather to its cap, with a new AI division called Reliance Intelligence. It will cater to all things AI and the data infrastructure behind it.\n\nReliance is already building huge data centers in Jamnagar powered entirely by its own green energy . It also aims to develop its own AI products and tools while partnering with OpenAI, Google, and Microsoft. Source As Reliance Intelligence focuses on creating AI infrastructure, Jio shall act as the face of the business, delivering those AI tools to customers through its huge network.",
    "title": "Reliance takes big swings this quarter",
    "articleUrl": "https://thedailybrief.zerodha.com/p/reliance-takes-big-swings-this-quarter",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "nversion rates and ticket sizes tend to be lower than in search-based shopping. Many people may window-shop without buying, or stick to very cheap purchases, but that doesn’t bother Meesho, but plays into its strengths. How Meesho Makes Money Since Meesho doesn’t charge sellers a commission, how does it earn revenue?\n\nShort answer: by operating like a logistics and advertising company sitting atop an e-commerce platform. Logistics: Every order on Meesho runs through its system which assigns deliveries to partner couriers. Sellers pay a shipping fee to Meesho, which is a major income source. In FY25, its in house logistics arm – Valmo – handled 62% of Meesho’s orders, lowering costs by roughly 12% compared to traditional couriers.\n\nThat efficiency lets Meesho keep the cost of delivery low while still earning a margin on delivery fee it charges its sellers. Advertising: Meesho also runs an ads platform where sellers pay to promote listings in search results or feeds. With millions of sellers, visibility is scarce, so ad spending is rising steadily alongside the seller base.\n\nNew bets: The company’s DRHP outlines early experiments: a financial services platform (credit for sellers and buyers through partners) and expanding Valmo’s logistics services to non-Meesho merchants. These are small today but point to future revenue streams. Despite having no commission income, Meesho’s monetization scale is striking.\n\nIn FY25, it generated ₹9,390 crore in operating revenue on ₹30,000 crore of Net Merchandise Value (NMV) — an effective “take” of about 31% , mostly shipping-related. (For context, rivals typically earn 10–15% commissions plus shipping fees.) Crucially, that 31% includes logistics costs — the pure marketplace commission remains zero. Yet Meesho’s model has become increasingly efficient: its contribution margin rose to 4.95% of NMV in FY25, up from 2.94% in FY23.",
    "title": "Inside Meesho’s IPO",
    "articleUrl": "https://thedailybrief.zerodha.com/p/inside-meeshos-ipo",
    "date": ""
  },
  {
    "learning": "to random research papers, government reports, and brokerage notes. We even look at journals and academic papers, the kind of stuff nobody really touches in India. This has been ingrained into all of us because of our Guru: Bhuvan. Now, the goal isn’t to read everything . After doing this for a while, we have developed a kind of instinct for what might turn into a story.\n\nLike, if the markets fall and someone says a thousand crores “vanished,” that’s not a story. But if a company’s putting up a ₹5000 crore plant, let’s say, a semiconductor plant, now that’s interesting. You can dig into what chips are, how they work, where India stands in the global chain, and so on. So through the morning, we keep sharing interesting stuff we find in our internal chat group, links, reports, screenshots, random PDFs, whatever catches our eye.\n\nThis goes on till around 11 a.m., when we all hop on a call. That’s when everyone pitches what they’ve found. Each of us has our own area we’ve sort of gravitated towards over time. For example, I usually end up reading more on quick commerce, hospitals, and consumer stuff. So when we’re discussing stories, we lean on each other’s areas of strength.\n\nThen we pick what to actually pursue. The main question is: does it matter to a lot of people? Is it something that’s both impactful and interesting? And honestly, we’re a little selfish here; if it’s something we genuinely want to understand, we go for it. Now, this process has evolved over time but the core idea of learning is there since day 1.\n\nOnce a story’s locked in, the deep-dive starts. That can mean anything: reading Bloomberg pieces, going through research reports, watching management interviews, listening to earnings calls, checking investor presentations, or just doing an old-school Google search. Every story demands its own route. Sometimes you’ll find a detailed government report; sometimes you’re just piecing things together from five different opinion columns.",
    "title": "How we research at The Daily Brief",
    "articleUrl": "https://thedailybrief.zerodha.com/p/how-we-research-at-the-daily-brief",
    "date": "2026-01-27T01:34:07.874Z"
  },
  {
    "learning": "rce By now, the group knew the timing. Between July 21 and 22, the trades began. How the trades were placed To buy the IEX put options, this group used different trading accounts spread across family members to spread out their exposure. Bhoovan had access to some of these accounts; in one case, Sanjeev placed trades using his wife Bindu Sharma’s account.\n\nThese weren’t small-time retail bets, either; they were huge positions worth crores. Bhoovan Singh was not at all a regular trader. SEBI examined his phone to find search histories that showed he had been looking up tutorials on how put options work, along with searches on how the CERC order could affect IEX’s stock.\n\nClearly, the leader of this wolfpack didn’t know much about how the market worked, and had probably never placed a put option before in his life. But, he learned just in time to place the perfect bet. When CERC’s market-coupling order went public on July 23 after market hours, the IEX stock plunged 29.6% the next day.\n\nThe put options that cost just a few rupees suddenly exploded in value. By July 28, the traders had squared off, booking their profits. What SEBI found during the searches Once SEBI’s surveillance team spotted the pattern, it didn’t take long to move in. Between September 18-20, it conducted search and seizure operations at the homes and offices of the suspects.\n\nOfficers recovered laptops, phones, and confidential CERC documents that told the rest of the story. Besides this, in Bhoovan Singh’s phone, SEBI’s forensic team also found traces of deleted WhatsApp and Signal chats with O1. After the trades, on July 31, the NSE sent queries to some of these traders asking for explanations about their sudden activity in IEX options.",
    "title": "SEBI unearths a ₹173 crore insider trading scam",
    "articleUrl": "https://thedailybrief.zerodha.com/p/sebi-unearths-a-173-crore-insider",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "India has a new plan for hydropower Why our steel still runs on foreign coal India has a new plan for hydropower This week, India’s Central Electricity Authority (CEA) quietly unveiled a monster ₹6.4 lakh crore master plan spread over the next 2 decades, primarily for the Brahmaputra basin. A massive announcement by any means. But here’s the twist — the plan doesn’t approve a single new dam.\n\nInstead, the entire amount is earmarked for transmission infrastructure: power lines, substations, and high-voltage direct current (HVDC) corridors to evacuate tons of potential hydropower from India’s Northeast by 2047. This is India flipping the script on how it builds energy infrastructure. For a long time, it focused on power generation rather than power transmission.\n\nNow that’s changing, and the starting point of this strategy is the Brahmaputra basin. This raised plenty of questions amongst us about India’s strategy for hydropower. So, we decided to take a look at where hydropower sits in India’s energy mix, and our plans for it. The first question in our minds was: why is hydropower getting so much focus?\n\nFor one, dams take a really long time to build and require lots of capital. And in the age of solar panels becoming far cheaper than ever, wind turbines becoming more viable, and nuclear energy getting a revival, that doesn’t seem very appealing. That’s because hydropower does something other renewables can’t: it’s flexible , acting as a huge balancer in India’s power grid.\n\nThink of India’s grid as a massive balancing act. During sunny afternoons, electricity generated through solar reaches a peak. Wind kicks in when the breeze picks up. But what happens on cloudy monsoon days when solar drops 60%? Or calm evenings when wind generation flatlines? You need something that can ramp up fast, on demand.",
    "title": "India has a new plan for hydropower",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-has-a-new-plan-for-hydropower",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "We’ve not actually been a significant cloud provider player.” But what part of it is AI-driven, versus what part of it is meant for their core business, is really up for debate. It doesn’t necessarily have to be an innovative move — having their own data center will help reduce data costs that client projects, or even the company’s own internal operations, will incur. They don’t have an AI product of their own yet that requires a data center.\n\nSource On the other hand, as we’ve covered before , data centers themselves are proving to be a huge business opportunity in India. What’s more, this opportunity is, at least for now, not primarily being driven by AI needs. TCS, right now, stands somewhere in that opportunity — build a data center to optimize non-AI needs, while also being in a position to lend its data center to other companies that need it.\n\nHow should we think about India’s economy? As an investor, at the moment, there are probably many macro questions running through your mind. How should you think about India’s economy, with all the trade headwinds it faces? Can we still grow at the same pace as before? What can the streamlining of GST laws really do?\n\nWith all this negativity, are there reforms that India should look to pursue? Well, in a recent interview to CNBC-TV18 , India’s Chief Economic Advisor, V. Anantha Nageswaran, answered some of those questions. In this assessment, India’s GDP growth will not just stick to the band that they had forecasted — 6.3-6.8% — but will probably land in the higher end of that band.\n\nI’m more comfortable, now, in saying that we will be tending towards the upper end of this range rather than the lower end of this range… ” What makes him so confident? Well, he thinks the recent GST reforms are going to be hugely beneficial to our economy, and combined with the rationalisation of income taxes earlier this year, could create a lot of new economic activity across the country. That’s partly a simple outcome of the fact that, by paying less tax, people will have a lot more money left in their hands, which they will spend in the economy.",
    "title": "From TCS to Reliance: Major shifts shaping India’s Economy | Who said What? S...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/from-tcs-to-reliance-major-shifts",
    "date": ""
  },
  {
    "learning": "ibly benefit India’s disaster financing in several ways. First, faster relief delivery Unlike standard insurance, parametric triggers make it possible to have near-immediate disbursement of funds after an event. In India, this could mean resources reach disaster zones faster, without waiting for lengthy damage assessments or government approvals.\n\nQuick payouts can kick-start relief and recovery, reducing human suffering and secondary economic losses. For instance, if a cyclone parametric policy were in place for coastal districts, money for relief camps, repairs, and livelihoods could be available within days of the cyclone’s landfall, as soon as the wind speed threshold is verified, rather than weeks under the current system. Second, reducing fiscal burden Parametric insurance would shift a portion of disaster costs from the government’s budget to insurers and reinsurers.\n\nWith an insurance program, the state or central government would pay an annual premium, and in return, the insurer covers extreme event payouts. While there is a cost to premiums, over the long run this approach can make public expenditure smooth and predictable, limiting surprise outlays. These premium costs are much easier to budget than the huge surprise relief packages.\n\nThird, higher insurance penetration Parametric schemes can be designed to cover segments that traditional insurance struggles with — such as remote villages, informal housing, or losses like interruption of local markets. For example, poor rural households rarely have property insurance, but a parametric flood insurance program (perhaps run by the state) could provide them payouts when floodwater levels in their area exceed a threshold. Or, it can also cover non-physical losses like a drop in crop yield or business income using an index as a proxy.\n\nFourth, objective and transparent trigger mechanism Under the current system, sometimes, how much support an affected area gets is based on how politicized the issue becomes, making the process very subjective and arbitrary. But having clear parametric triggers (e.g. “payout X if rainfall > 300 mm in 24 hours at village Y”) introduces transparency and predictability.",
    "title": "India wants to insure against climate change",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-wants-to-insure-against-climate",
    "date": ""
  },
  {
    "learning": "sold that story through advertising. Today, lab-grown diamonds are chemically, visually, and structurally identical to natural ones. The only difference is origin — and price. A lab-grown stone costs a fraction, which means millions more people can afford this once-exclusive commodity. Source To those consumers, the emotional symbolism of a diamond doesn’t vanish just because it came out of a lab.\n\nAnd that’s what makes the president’s next prediction striking. When asked if he believed prices would recover, he said: “Absolutely. It is anticipated that there will be an upswing indeed, over the next 2 to 3 years. But obviously, it will also be a function of proper marketing and differentiation in the market and traceability.” That last word — traceability — is worth pausing on.\n\nIn practice, nobody can really tell the difference between a lab-grown and a natural diamond. Both pass through the same polishing centers, often handled by the same workers, and insiders admit that mixing is common. I was watching a documentary called Nothing Is Forever , and a diamond expert said outright: both types are processed side by side, and once they’re in circulation, nobody really knows what’s real and what’s fake.\n\nIn that context, “traceability” is not just a technical fix. It’s the industry’s last hope of persuading buyers that they can trust what’s on offer — and by extension, that it’s worth paying more for something called “natural.” Whether that works is another story. Marketing built the modern diamond industry.\n\nBut it looks like marketing may not be enough to save it. EA Sports…no longer in the game The gaming industry has just been rocked by an unexpected, geopolitically-charged, and truly blockbuster deal with plenty of behind-the-scenes action. Remember EA (Electronic Arts )? The creator of the legendary FIFA games, the beloved Cricket 07 , NFS Most Wanted, and this unforgettable tagline?",
    "title": "Saudi Buys EA, Botswana Eyes De Beers & Jamie Dimon Warns… | Who said What?S2E14",
    "articleUrl": "https://thedailybrief.zerodha.com/p/saudi-buys-ea-botswana-eyes-de-beers",
    "date": ""
  },
  {
    "learning": "s an expensive, technically challenging step. Setting up a minimum viable 5 GWh cell production facility requires approximately ₹1,000 crore in capital expenditure. More critically, however, it demands expertise, which India sorely lacks. To make a cell, you need to master a variety of hard processes: from preparing electrodes, to coating them with the right chemicals, to putting it all together, to activating the cell, and more.\n\nWe’ve talked about some of this before. Every step requires specialized equipment, process control, and technical knowledge — which Chinese companies have refined over decades. Now, India does have some emerging capabilities. Epsilon Advanced Materials has started manufacturing graphite precursor material for anodes.\n\nTDSG — a Toshiba-Denso-Suzuki joint venture — began commercial cell production in December 2020. The Indian government also has a PLI scheme, aimed at bridging the remaining gaps. Ten companies submitted bids for approximately 130 GWh capacity, including Reliance, Ola Electric, Lucas-TVS, Mahindra, Amara Raja, and Exide.\n\nTo qualify, they’re required to set up 5 GWh battery facilities, where they’ll eventually add 60% of the value. That said, we have a very long way to go. Currently, India imports virtually all lithium-ion cells — with 60-65% of battery pack components coming from China. We had just 6.7 GWh of commissioned lithium-ion cell production capacity as of 2023, compared to China’s several thousand GWh.\n\nEven with Chinese partnerships and government support, most experts believe India will take at least 5-7 years to achieve meaningful scale in cell manufacturing. Our dependency for raw materials will persist for even longer. While we might have some domestic lithium reserves — with recently discovered sites potentially yielding an estimated 5.9 million tonnes — we’re years away from actually making use of it.",
    "title": "India plugs into China’s batteries",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-plugs-into-chinas-batteries",
    "date": ""
  },
  {
    "learning": ", under administrative allocation, satellite operators could get away with far lower costs, making it an uneven playing field. For Jio, that’s unacceptable, especially if it means loss of margins. In our Starlink story , we covered how Jio’s average revenue per user (ARPU — at ₹200+) is far lower than Starlink’s (₹7000+).\n\nBut, Jio makes margins through its richer customers and institutional clients (like businesses, airports, and so on), who increase its ARPU. With lower costs, Starlink might be able to take away some of those customers. Jio's next two counters are purely technical . For one, they say that congestion exists even in satellite internet.\n\nSatellites involve something called gateway stations which act like highways, beaming internet signals to Indian soil. While satellite operators can reuse frequencies, they can't reuse those gateway stations. When too many users in an area try to access satellite internet, gateways can clog. Source Here’s another way to understand it: highways can be congested.\n\nHence, it might make sense to implement some sort of congestion pricing to reduce the problem. In fact, that’s exactly what New York City did very recently. Jio’s third argument is this: satellite internet requires millions of user terminals—dishes that consumers install on their rooftops. Without proper coordination, though, these terminals could interfere with each other and with land spectrum towers .\n\nAll of this is made worse by the fact that two particular frequency bands — called the ku (10-15 GHz) & ka (17-31 GHz) bands — are required strongly both by satellites and 5G towers on land. Land operators worry that their new investments in 5G may be spoiled because of this clash. Two questions Well, with these arguments, we had two questions in mind.",
    "title": "India's deadlock on pricing internet from satellites",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indias-deadlock-on-pricing-internet",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "Awareness about protein deficiency has slowly started to become mainstream. FMCG brands talk about it in ads, social media feeds are full of them, and the younger generation like me are beginning to look at protein not just as a supplement but as part of everyday food. That rising awareness may be what’s driving the surge in demand for protein.\n\nWhich is why Amul doubling capacity every other month isn’t just expansion. It’s the clearest signal that protein has started slowly entering the Indian grocery basket. Bessent makes his case against the Fed One of the biggest questions in global finance, today, is around whether the Trump government shall try and undermine the independence of the United States Federal Reserve.\n\nA few months ago, this may have seemed like a matter of idle speculation. But it’s becoming an active concern. Trump officials’ criticism of the central bank is reaching a fever pitch. There are regular demands from the administration for rate cuts, often accompanying demands for the resignation of various officials.\n\nThe ugliest of these has been around attempts to oust Lisa Cook, who was sworn in to the Federal Reserve’s Board of Governors, but has been hounded by administration officials ever since. But the US executive can’t simply interfere with the functioning of the US Fed by creating a public spectacle — or it’ll be soundly thrashed by the markets. It needs more groundwork than that.\n\nIt has to offer a theory to justify intervention; a case that the markets would be governed better if the US government had more control over the Fed. Recently, Treasury Secretary Scott Bessent wrote an article — cheekily titled “ The Fed’s New “Gain-of-Function” Monetary Policy ” — which lays the foundation for more government intervention. The title is an attack in itself; it likens the Fed’s policy choices over the last two decades to labs in China that allegedly caused the COVID-19 virus to leak out into the open, creating the world-wide pandemic.",
    "title": "Amul’s Protein Push, Fed vs Trump & Nestle in Crisis | Who said What? S2E12",
    "articleUrl": "https://thedailybrief.zerodha.com/p/amuls-protein-push-fed-vs-trump-and",
    "date": "October 26, 2025"
  },
  {
    "learning": "Jindal Steel wants to buy one of the largest European steel businesses China: between competition and self-destruction? Jindal Steel wants to buy one of the largest European steel businesses Jindal Steel just made a non-binding offer to buy the steel business of Germany-based Thyssenkrupp. Source Right now, this is just an expression of interest without a formal price tag, not a signed deal.\n\nBut Jindal is ready to splash billions of euros on buying one of the oldest names in European steel, which also operates the largest steel plant in Europe in its headquarters — Duisburg. Source But, the plant is also one of the dirtiest by emissions, still running on old coal-fired blast furnaces. To keep selling steel in Europe, where strict climate rules are being rolled out, Duisburg has to be rebuilt.\n\nThat is going to cost a fortune, and Thyssenkrupp has been struggling to find someone willing to foot the bill, until now. Let’s unpack this potential deal. Why is Thyssenkrupp trying to sell? Thyssenkrupp used to be a sprawling German industrial giant whose history spans all the way back to the 1800s.\n\nIt made steel, car and ship parts, and its elevators and escalators were known worldwide. If you’ve ever taken a lift (or escalator) in a metro station, airport, or even society building in India, you probably noticed their logo. But in 2020, the group sold its entire elevators business for €17 billion (~₹ 1.5 lakh crore ).\n\nIt was drowning in debt and needed a reset. That sale gave it cash but also signaled a shift in strategy . Thyssenkrupp no longer wanted to be a jack of all trades. It wanted to slim down and master just its core businesses. Source But Europe’s new climate rules threw a wrench into those plans. Duisburg’s green rebuild will take billions — its old furnaces have to be torn down and replaced with those running on cleaner sources like hydrogen.",
    "title": "Another Indian steelmaker wants a big piece of Europe",
    "articleUrl": "https://thedailybrief.zerodha.com/p/another-indian-steelmaker-wants-a",
    "date": ""
  },
  {
    "learning": "TeamLease keeps pointing out that India has more than 65,000 regulations, so many filings, and so many with criminal penalties. All of those need to be brought down. Because when you’ve created this environment with low corporate tax rates and cheaper capital, the larger firms still don’t take risks — history shows incumbents generally try to protect their turf.\n\nThe challengers will come from the small and midcaps, and they will only be able to grow if this regulatory burden is eased. Deregulation has to be among the most important priorities.” In his telling, India has already fixed a lot of the big macro pieces: lower corporate taxes, cheaper capital, stable inflation. But all that can only take you so far if the regulatory cholesterol keeps clogging the arteries.\n\nSimplifying compliance, cutting needless filings, and easing the way for small and mid-sized firms to take risks is what will turn this cycle into something more durable. Mishra sees the slowdown as a policy-made accident, not a structural fault. The revival will be driven by investment, not consumption.\n\nWhen it comes to the AI race, the only thing anyone can say for sure is that the winners of this race are hardly decided. Wang Jian is the founder of the AI and Cloud unit of Chinese internet giant Alibaba. Recently, he gave Bloomberg his two cents on how the race is being run, especially in Silicon Valley: “ The only thing you need to do is to get the right person.\n\nNot really the expensive person because if it's a new business, if it's true innovation, that basically means talent and nobody cares about them. What happened in Silicon Valley is not the winning formula. ” If you’ve been seeing the news, US tech companies have been paying through their noses for AI talent.",
    "title": "India’s Credit Crunch, The AI Talent War & China’s Engineering State | Who sa...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indias-credit-crunch-the-ai-talent",
    "date": "October 26, 2025"
  },
  {
    "learning": "hether that means smaller kitchens delivering to their homes or quick stops while they’re on the move. Tata Power wants to capture the rooftop solar explosion Another thing we came across through The Chatter was a comment from Dr. Praveer Sinha, the CEO of Tata Power. Here’s what he said: Source Now if a CEO says this, it’s worth asking: how does he plan to do this?\n\nAnd what’s behind these numbers? On the concall, he explained that Tata Power has been streamlining its supply chain. The rooftop business, he said, is now almost entirely built on their own manufactured cells and modules, which helps with margins and reliability. Source They’ve expanded channel partners, targeted new customer segments, and are leaning on the government’s Domestic Content Requirement (DCR), which makes it mandatory for rooftop projects to use India-made modules.\n\nHe even noted that from June 2026 onwards, DCR will apply to all projects, not just rooftops. The scheme driving it all But the comment also points to something bigger: the PM Surya Ghar: Muft Bijli Yojana . This is the government’s flagship rooftop solar program, launched at the end of February 2024.\n\nThe pitch is simple: if you put solar panels on your roof, you can generate roughly 300 units of power a month — and that’s about what an average middle-class household consumes. In other words, the government is promising you can wipe out most of your electricity bill. Now, to make this work, they’ve set aside a massive budget of about ₹75,000 crore and structured the scheme so households get a direct subsidy.\n\nSource Up to ₹78,000 is credited into your account once your system is installed and approved. Source On top of that, you can take small, collateral-free loans at around 7% interest from public sector banks. And this scheme is only for residential rooftops. That’s important because this was always the missing piece in India’s solar journey.",
    "title": "Less Dining Out, More Solar Power, and the AI Job Puzzle | Who said What? S2E10",
    "articleUrl": "https://thedailybrief.zerodha.com/p/less-dining-out-more-solar-power",
    "date": ""
  },
  {
    "learning": "labs should ideally mean fewer disputes — and hopefully faster refunds. It is also worth noting that with a consumption slowdown, businesses may likely pass on the benefits of lower taxes to consumers — right on time for the festive season — gain market share in their product lines. This is the first-order bet: that households will spend more and small businesses may breathe easier.\n\nBut it’s the second-order effects that will be far more complicated to anticipate and understand. The fiscal damage The big question when it comes to second-order effects is: can the government afford it? The government's tax cuts will reduce its income by ₹ 48,000 crore. However, some economists believe the actual loss could be much higher - around ₹1 lakh crore.\n\nBut how much of this deficit really matters? In past episodes, this dynamic actually translated into additional revenues of nearly ₹1 lakh crore over time. The argument is that rationalization should be seen less as a short-lived stimulus and more as a structural measure that simplifies the tax system and reduces compliance burdens.\n\nHow the tax will affect different states is also uncertain. In our primer, we covered how under GST 1.0, states faced a revenue shortfall because their ability to impose their own taxes was taken away. Under GST 2.0, richer, urban states — where consumption baskets lean heavily on 18% and 28% goods like vehicles, cement, durables — may lose more, while poorer states may lose less.\n\nThe difficulty is that no one knows the exact state-wise breakdown. A paper by NIPFP says that the current GST filing system doesn’t track collections by rate in any usable way, which makes calculating the tax collected under each rate extremely difficult. Source However, as per SBI ’s projections, states may actually end up as net gainers even after these rate cuts because of the unique revenue-sharing architecture.",
    "title": "And here comes GST 2.0",
    "articleUrl": "https://thedailybrief.zerodha.com/p/and-here-comes-gst-20",
    "date": ""
  },
  {
    "learning": "— the size of a medium-sized town — at special rates. Foxconn hasn’t taken the deal yet, but this goes to show what Andhra’s willing to offer. Alongside, the state has also significantly reduced the red tape companies need to go through. All approvals are granted in a streamlined fashion within 21 days.\n\nThey consistently rank at the top of India’s Ease of Doing Business rankings. The industries in focus In the aggregate, all of this has translated into a rush of investments from firms. So far, this year, AP has recorded the highest increase in capital expenditure (69%) among all states. And many companies have been vocal about how business-friendly AP is.\n\nSource Source This has already given Andhra a stronghold in some sectors. The state is home, for instance, to multiple clusters of pharmaceutical companies — both Indian and global. It’s building out its competence in a network of other high tech industries. The state has received huge investments from lead carmakers.\n\nKorean automaker Kia — which owns 6% of India’s passenger vehicles market — has its only Indian factory , worth $2 billion, in Andhra. Japan’s Isuzu Motors, similarly, has a massive plant in Sri City. Domestic players like Hero MotoCorp and Ashok Leyland, too, have a big presence in AP. These companies have drawn a string of car part suppliers with them, creating a virtuous growth cycle.\n\nIt’s also attempting a shift to EVs, and is in talks with Mahindra for a new EV production plant. The Kia factory in Anantpur, AP. Source With that base, it’s also making its way into allied industries. For instance, the auto industry and electronics firms often co-exist, since both often use the same components.",
    "title": "From coastlines to assembly lines: The Andhra experiment",
    "articleUrl": "https://thedailybrief.zerodha.com/p/from-coastlines-to-assembly-lines",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "The greatest corporate failure in history CDMOs: The next IT sector? The greatest corporate failure in history In its heyday, Evergrande was a titan of the business world. It used to be the world’s most valuable real estate developer; and the engine behind China’s incredible urbanisation push. Its founder, Hui Ka Yan, came up from nothing to become the richest man in China.\n\nIts name adorned thousands of glittering skyscrapers across hundreds of China’s fast-modernising cities. Four million workers relied on the company for their livelihood; two lakh of which were directly employed by the company. Source On Monday, that same company was kicked out of the Hong Kong Stock Exchange without much fanfare.\n\nThis marks the last chapter in what was — depending on which metric you choose — perhaps the world’s greatest corporate fall from grace. It triggered a much larger property crisis that tore through China, and forced the country to change its economic blueprint. The perpetual motion engine Evergrande began its life in Guangzhou in 1996, around when China first liberalised its housing market.\n\nAfter four decades of near-total state control, in the 1990s, China let private players enter its urban property market. This unleashed a nation-wide construction boom, and companies like Evergrande were set up to service that wave. The company really found its feet after the Global Financial Crisis, however.\n\nThe crisis was a make-or-break moment for China. The Western markets that had powered the first two decades of its rise had abruptly fizzled out. China needed a new way of fuelling its economy. It turned to real estate and infrastructure. The country’s financial system began pouring money to fund a once-in-a-lifetime rush of construction, and the sector came to make over a quarter of its economy.",
    "title": "The death of Evergrande",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-death-of-evergrande",
    "date": ""
  },
  {
    "learning": "their highest level in nearly a year in June . But in July , imports declined again, showing just how quickly market dynamics can shift in this sector. What adds to this volatility is that palm oil and soybean oil are substitute goods — they can be used in place of each other. This creates wild swings (like a see-saw ) in the global trade of edible oil.\n\nMoreover, when one of those oils is in excess supply, and the other in shortage, the trade cycle turns into chaos. Late last year, for example, South American countries were offering soybean oil at big discounts due to surplus supplies, while on the other hand, Malaysian palm oil prices were rising due to tighter exports. This made palm oil prices far more expensive in comparison to soybean oil.\n\nAs a result, Indian importers did what made the most financial sense — they imported soybean oil, mostly from Argentina and Brazil. Source In December 2024, India’s soybean oil imports surged nearly threefold to 420,000 tonnes , capturing 58% of the edible oil market. At the same time, palm oil imports were crashing.\n\nBut when palm oil became relatively cheaper, ta-da , the pendulum swung back in favor of palm oil imports. Secondly, India is very vulnerable to decisions taken by producing countries. In April 2022 , Indonesia suddenly banned palm oil exports to prioritize domestic cooking oil supplies. Global palm oil prices spiked and Indian consumers felt the pinch immediately, even though this ban only lasted a couple of weeks.\n\nIndonesia’s grip on palm oil exports exists even today. But that’s a policy decision — what about actual war? When Russia invaded Ukraine, sunflower oil prices in India went from around ₹98 to as much as ₹250 per litre. Indian companies had to scramble to find alternative suppliers or be stuck paying premium prices.",
    "title": "The trade chaos behind your cooking oil",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-trade-chaos-behind-your-cooking",
    "date": ""
  },
  {
    "learning": "it became clear that underneath all the flashy advertising, they hadn’t really created much value. Many of those companies died a quick, painful death. But it’s important to take the right lessons away from this. Back then, many people took the dramatic crash as proof that the internet has no use, or that e-commerce was a dumb idea.\n\nA company like Amazon, for instance, fell from a share price of over $4.75 to $0.30. That is, in less than two years, it had lost ~93% of its value. It would only gain that value back years later, after the Global Financial Crisis had come and gone. With the benefit of hindsight, though, we know how dumb those takes were.\n\nOver the long term, it became clear that both the internet and e-commerce made for some of the best business propositions in the world. The fundamental bet that so many people had taken on the internet as a technology was sound. And that terrible crash in Amazon’s value barely registers now: The smarter lesson from that bubble was much more boring: it’s that you need to spend money wisely, and create businesses around solving actual problems that people have.\n\nA lot of the capital investments that seemed like “wasteful expenditure”, back then, were actually genuinely helpful. For instance, telecom companies spent hundreds of billions of dollars — often fuelled by debt — in laying out the infrastructure for the internet: things like cables, switches and the like. Many of those companies went bankrupt when the bubble burst.\n\nBut the infrastructure they created stayed on, and arguably went a long way in making the internet affordable for regular people. That’s the kind of spending Altman is also interested in. “ You should expect OpenAI to spend trillions of dollars on data center construction in the not very distant future ,” he said.",
    "title": "Is AI the New Dot-Com?, Smarter growth in Indian Hospitals | Who said What? S2E8",
    "articleUrl": "https://thedailybrief.zerodha.com/p/is-ai-the-new-dot-com-smarter-growth",
    "date": ""
  },
  {
    "learning": "Exploring the starting line for the GLP-1 race Is Indian industry hidden behind a statistical quirk? Exploring the starting line for the GLP-1 race Over the past few months, Indian pharma companies have been unusually chatty in their earnings calls about their GLP-1 plans. They're all lining up to have a crack at one of the biggest market opportunities in pharmaceutical history.\n\nWe've been tracking GLP-1 for a while now: it is, quite clearly, a remarkable invention. For quick context, GLP-1 drugs like semaglutide promise something that might have seemed too good to be true just five years ago: they help you shed weight . They re-wire your brain's relationship with food, reducing the unhealthy cravings you feel.\n\nThey help you fight temptation — perhaps the biggest barrier in anyone’s weight loss journey. That’s a miracle; and thus, multi-billion market. But as we covered previously , in a cruel twist of fate, Novo Nordisk realised the miraculous potential of what it had created far too late. It had a ~20 year patent over the drug; and for most of that time, it thought it was selling really good diabetes medicine.\n\nIt was only in 2021, five years before its patent ended in much of the world, that it realised what a goldmine it was sitting on. That clock has nearly run out, now. Its semaglutide patent expires in early 2026. And it’s clear that anyone that can make a knock-off will do so. Take the United States: under US law, “compounding pharmacies” can make copycat versions of a patented drug, as long as they don’t mass produce it.\n\nAnd recently, Novo Nordisk lost an estimated 1 million patients to these compounding pharmacies. Source This unexpected competition has forced Novo Nordisk to cut its 2025 revenue forecasts. Source Individual pharmacies, though, are hardly the biggest concern. With the patent cliff just months away, bigger players are eyeing the market.",
    "title": "Sizing up the GLP race",
    "articleUrl": "https://thedailybrief.zerodha.com/p/sizing-up-the-glp-race",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "But these costs remain fixed — they cannot be reduced by producing less. So if sales fall, these costs will translate into big losses that can’t be offset elsewhere. Their misery doesn’t end here, though. With higher capacity comes higher inventory. Due to falling sales, manufacturers were left with an excess of ACs that they could not offload anywhere else.\n\nThis increased their inventory costs significantly. Recovery from this looks difficult as most companies are lowering their projections for the year. They may expect some relief in sales due to the festive season, but the peak season for buying ACs only comes once a year. And this year, that peak never arrived.\n\nWhat we can learn from this is that climate change is affecting the Indian economy in truly unexpected ways. It isn’t just resulting in hotter days, but also more unpredictability in the weather. This throws a wrench into the plans of even AC companies, that practically rely on hotter days for their sales.\n\nWhy is India's EV revolution stuck in a loop? So, Partho Banerjee, senior executive of Maruti Suzuki, India’s largest car maker, in an interview with ET said this: “It’s a chicken-and-egg situation. Till the time adequate public charging network is in place, customers are unlikely to use electric cars as a primary vehicle.” He highlights a very real problem.\n\nIn 2024, 7.66% of all vehicles sold in India were electric. That’s scooters, rickshaws, buses — everything. The passenger car slice is far smaller, around 2.5%. Source Banerjee says the problem is simple. Most people aren’t ready to make an EV their only car. They charge them at home, drive them for short errands, and keep a petrol or diesel car for anything longer.",
    "title": "AC sales crash, EV charging puzzle & Trump targets trade | Who said What? S2E7",
    "articleUrl": "https://thedailybrief.zerodha.com/p/ac-sales-crash-ev-charging-puzzle",
    "date": ""
  },
  {
    "learning": "” This wasn’t charity, of course. India is the world’s third-largest importer of oil. Even if we didn’t buy oil from Russia , we would buy oil. If not Russia, we would go to the same markets that Western powers would — the Middle East, the Americas, and so on. That would inevitably push prices higher in all those markets, making things harder for Western countries.\n\nIt doesn’t stop there, though. See, there’s a funny thing about international trade: if India buys Russian crude oil, refines it, and sells you diesel, that diesel isn’t considered “Russian”. It’s considered Indian diesel. It might have started in Russia, but going through Indian refineries magically changes it.\n\nOr that’s at least what many countries chose to think. Because the world’s G7 countries have been happy to buy Russian oil, once it has gone through Indian or Turkish refineries. According to analysis by CREA , between March 2024 and February 2025, G7 countries imported $9 billion worth of petroleum products from the two countries, which were refined from Russian crude oil.\n\n(Although the European Union is finally cracking down on some of this.) Did Indian purchases of oil indirectly fund the Russian military? But India’s contention is that we’re being turned into a scapegoat. The rest of the world — the West included — was willing to pay Russia for their own imports. As the MEA pointed out, last year, €67.5 billion of European money entered Russia too.\n\nAnd more was perhaps channeled into Russia via India. It hardly makes sense to point fingers at one country. Countries are allowed to change their mind and redraw their plans. Countries that are trying to stop endless wars often do . And India didn’t just buy oil out of necessity; it made windfall profits for a long time by refining Russian oil.",
    "title": "Oil, Diamonds & A $60B IPO – 3 Big Stories You Can’t Miss | Who said What?S2E6",
    "articleUrl": "https://thedailybrief.zerodha.com/p/oil-diamonds-and-a-60b-ipo-3-big",
    "date": ""
  },
  {
    "learning": "The fall of De Beers The many streams of gold demand The fall of De Beers We recently did a story on the fall of De Beers on our weekend show, Who Said What . But the format of that show didn’t really allow us to get into all the little nuances and context to that whole story. So, we thought, why not follow that up with a detailed Daily Brief story?\n\nClose your eyes, and think of the image that comes to your mind when you hear the word “ diamond ”. Chances are, in some way, De Beers put that image there. This association was painstakingly crafted over decades. And if it’s cracking now, that too is arguably De Beers’ own doing. Here’s the story of how a once all-powerful global monopoly might be falling apart.\n\nPart 1: The rise of De Beers Our story begins in the late 19th century. Until then, diamonds were incredibly rare — found mostly in small Indian riverbeds and the jungles of Brazil. Around 1870, however, everything changed, when massive diamond deposits were discovered near Kimberley in South Africa. Suddenly, diamonds were being mined by the ton.\n\nA washing plant at the De Beers mine in Kimberley, South Africa However, amidst this abundance, a group of British financiers, led by the controversial Cecil Rhodes, observed something crucial. Unlike, say, milk or toys that have value in their use , the value of diamonds depended on their scarcity . If diamonds could be mined by the tonne, paradoxically, all of them would lose value.\n\nCecil Rhodes So, in 1888, this group set up a new entity to artificially make them rare. And that’s how ‘De Beers Consolidated Mines’ was born. The key to creating scarcity, De Beers realised, was controlling every single stage of the diamond supply chain — from mines to the ring on a consumer’s finger.",
    "title": "Nothing is forever: The De Beers story",
    "articleUrl": "https://thedailybrief.zerodha.com/p/nothing-is-forever-the-de-beers-story",
    "date": ""
  },
  {
    "learning": "If Reliance is leaning on scale and cash, Blinkit is leaning into precision. They added 243 net new stores in the June quarter alone, taking their total to 1,544. They’re on track to hit 2,000 by the end of the year. Source Albinder Dhindsa, the CEO of Blinkit, said this in their recent shareholders’ letter: “The opportunity in front of us is massive, which means that the competition in this space is also very high… Under no circumstances will we let go of our market position here.” Source Blinkit’s confidence comes from its operating system.\n\nThis isn’t a company simply rolling out stores—it’s building a tightly integrated logistics, warehousing, inventory, and retail stack, all engineered for one thing: speed. At its core, this is the real contrast: Reliance has money, Blinkit has mastery. Reliance has more capital, more locations, and more corporate heft.\n\nBlinkit has faster iteration, better design, and a single obsession: get to your door in under 10 minutes. Reliance wants to take quick commerce to the masses. Blinkit is trying to perfect it for the top 50 million.Reliance is repurposing its stores to do more. Blinkit is building from scratch to do one thing well.\n\nWe’ll find this out soon enough :) Samir Arora says the IT sector is dead Earlier this week in an interview , Samir Arora, the fund manager of Helios Capital had some very, very harsh things to say about a sector which has been India’s shining light for a long time — IT. He has just one IT company in his portfolio. “What to say…IT sector itself is disrupted right now.\n\nPeople don’t want to believe it’s been disrupted black-and-white. You can see it in every result, every company.” It’s a bold statement — almost as if to say that IT companies are well into the process of being rendered obsolete, forever , unless they change themselves. It wasn’t that long ago when, in the pandemic, IT stocks made lots of people wealthier.",
    "title": "Reliance vs Blinkit heats up, IT’s future in danger?, Trump on NVIDIA | Who s...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/reliance-vs-blinkit-heats-up-its",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "One is in Perundurai (Tamil Nadu) that makes paneer and cheese. Another is in Bengaluru that makes ready-to-eat foods like parottas and chapatis. Each factory is designed to operate beyond its normal limits, maybe even using extra shifts. In 2025, their paneer-making machines — all of them in the huge Perundurai plant — ran at 110% capacity.\n\nWhile this might reduce costs in the short term, it's actually worrying. Machines running this hard break down more often, and the quality can suffer. If something breaks, there's no backup. Within products, the capacity varies, too. Yogurt and cheese production are at 70-90% capacity. The Bengaluru plant runs at 80-94% capacity.\n\nIce-cream, however, is far lower at 20%. But this low utilization isn’t necessarily bad for ice cream. You can't run ice cream machines full-speed all year because the demand depends on the season. They have room to grow when it’s summer or when they get more customers. Source What the IPO funds will be used for The money that Milky Mist raises (through a mix of fresh issue and offer-for-sale) will be used for four main things.\n\nFirst, they'll pay off a big chunk of their loans. Second, they'll expand their production lines (both old and new) and upgrade equipment with modern technology, which we’ll cover in more detail. Third, they'll buy thousands of branded glass-door fridges that you see in kirana stores with the company's logo.\n\nLastly, some money will be kept for day-to-day operational needs. Source Within their expansion plans, they have three ambitious projects. First, they’re expanding their whey protein and lactose lines. They have a really clever and scalable way of making whey. When you make paneer, you get solid chunks (the paneer) and leftover liquid (whey).",
    "title": "Milky Mist is going Public - Here’s what you should know",
    "articleUrl": "https://thedailybrief.zerodha.com/p/milky-mist-is-going-public-heres",
    "date": "October 26, 2025"
  },
  {
    "learning": "oo complicated and expensive to build houses in India. As per KPMG, for instance, more than 80% of all construction projects in India experience cost overruns, while nearly half are delayed. Low-cost housing projects simply don’t justify the risk. And so, private developers largely lean on premium properties instead.\n\nAt the root of these problems is how housing is regulated by the government, and how these regulations make financing unviable. The laws of housing A major hindrance in building worker housing in India comes from how the government categorises land. In India, land is often zoned for specific uses — like residential , commercial or industrial .\n\nThese differ in the areas, laws, standards and even rents. What does worker housing fall under? Well, that isn’t entirely clear. Different states have very different answers to that question. In Noida, it is forbidden to use an industrial plot for new worker housing. In Tamilnadu, hostels — often run by unorganized players — are considered “commercial”, except if they are hostels meant only for working women.\n\nIn Kolar in Karnataka, worker housing can be built anywhere. Source These have serious financial implications. For instance, if you’re building on residential land, you pay a fraction of the rent or utility charges people pay for commercial land. Add to this our building standards, which are routinely very restrictive.\n\nFor instance, many states restrict the Floor Area Ratio (FAR), which determines how tall a building can be. That means that you can’t build tall buildings which house a lot of workers; you must mandatorily buy more land for them. Similarly, such projects often come with mandatory parking requirements, even if they’re for low income workers.",
    "title": "To build factories, build homes",
    "articleUrl": "https://thedailybrief.zerodha.com/p/to-build-factories-build-homes",
    "date": ""
  },
  {
    "learning": "e pie: they made just ₹49 crore of total revenue in FY25. But if less than 60% of that is profit, what does the company spend on? A good chunk goes towards employee expenses. That’s intuitive: this is basically a business built around hiring extremely smart (and well-paid) money managers. They also spend a hefty amount on acquiring customers — especially for regular plans sold via banks and distributors.\n\nAs direct plans and online onboarding rise, they’re also having to put in more money into their technology. A heavily regulated industry There’s one major risk to such a business: this is an industry that lives and dies on SEBI’s word. Over the last 15 years or so, SEBI has reshaped the business. In 2009, it scrapped entry loads.\n\nAMCs could no longer charge investors an upfront fee, using it to pay off distributors. That was a 2.25% hidden charge — a huge chunk of the returns investors were seeking. When this was scrapped, AMCs had to pay distributors from their own P&L, reducing profitability. Then, in 2013, it mandated ‘Direct Plans’.\n\nThis was a separate class of mutual fund units that skipped commissions — giving investors a cheaper version of the same fund. This was great for informed investors, but squeezed margins further. In 2018-19, SEBI rationalised their expense ratios , adding caps based on scheme size. In 2023, it suggested a model where AMCs can charge higher fees only if they consistently beat their benchmarks.\n\nEach of these interventions has been good for mutual fund investors . But if you’re evaluating an AMC itself as an investment, this is a variable you have to account for. The rise of passive mutual funds Here’s another important variable: Over the last five years, passive investing has exploded in India.",
    "title": "ICICI Pru AMC's IPO: A window Into India’s MF boom",
    "articleUrl": "https://thedailybrief.zerodha.com/p/icici-pru-amcs-ipo-a-window-into",
    "date": ""
  },
  {
    "learning": "an push existing regions outside the optimal range, leading to reduced yields, poor bean quality, and eventually making areas unsuitable for cocoa cultivation entirely. And that is exactly what is happening. In Ivory Coast and Ghana, Climate Central reveals that there’s going to be 40 more days with temperatures hotter than 32°C every year .\n\nThis has severely impacted the quantity and quality of harvests. By 2050, climate change could reduce global cocoa yields by 20% . West Africa could potentially lose half of its cocoa-producing regions as it gets hotter. And climate change isn’t just making areas hotter. Rainfall has become more volatile, too.\n\nThe 2023-24 season was particularly devastating due to the El Niño weather phenomenon. West Africa has swung violently between periods of extreme rainfall and severe drought. In December 2023, total precipitation in West Africa was more than double the 30-year average, followed by a scarcity of rain in 2024.\n\nThis pattern of alternating excess and scarcity has made production of cocoa unstable. Climate change has also exacerbated the spread of devastating plant diseases that threaten cocoa plantations. For example, Black Pod Disease emerges due to the humidity created by too much rain followed by hotter conditions.\n\nIt can destroy up to 80% of farmers' crops. Cacao Swollen Shoot Virus Disease affects approximately 20% of Ivory Coast’s cocoa and accounts for 15-50% of harvest losses in Ghana. Ghana has launched the biggest viral eradication effort ever attempted to combat this. Beyond climate change, several other problems have made the cocoa crisis worse: Illegal gold mining, called \" galamsey \" in Ghana, has become a major threat.",
    "title": "Is this the End of Cheap Chocolate?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/is-this-the-end-of-cheap-chocolate",
    "date": ""
  },
  {
    "learning": "o-called “brand fees” to the parent company for using the \"Vedanta\" brand. But it asks: is this a genuine service that the parent company offers? Or is it just an arrangement to funnel money up the chain? To be fair, though, this isn’t exactly unique. Many other conglomerates have similar arrangements, where a parent company earns by leasing its brand to many revenue-creating group companies.\n\nViceroy says the interest expenses of Vedanata Resources don’t add up. See, when you look at the books, it seems like Vedanta Resources is effectively paying interest of 15.8%. But the bonds it has issues, and the term loans it discloses, have an interest rate of around 9–11%. Viceroy claims there’s some financial juggad behind the scenes.\n\nMaybe there’s hidden debt we don’t know about, or it’s using super short-term loans with sky-high interest — or maybe it’s just straight-up misreporting the numbers. Source Viceroy also makes serious allegations against almost all of Vedanta’s subsidiaries. From a gold refinery in Dubai accused of laundering, to mines that are shut but still shown as active, to inflated asset values and unpaid revenues being booked — Vedanta makes a string of allegations against a variety of Vedanta operations.\n\nThe only one it spares is BALCO — which it calls a “rare example of disciplined capital management”, and considers the exception that proves the rule. Finally, Viceroy claims that Vedanta Resources has been pulling in money from the entire group, and using it to quietly tighten their grip over their money-making Indian subsidiary. In some cases, in fact, they claim that that money comes from VEDL itself!\n\nAt one point, they claim, Vedanta Resources took a ₹7,900 crore loan from VEDL, in order to delist the company and take complete control of it. In essence, VEDL’s own money was being used to buy out its own shareholders. It claims that half of that loan is still unpaid. Viceroy claims this was part of a larger playbook: repeatedly borrowing from group companies, using that money to increase control, and then quietly writing off the loans.",
    "title": "Vedanta's ponzi allegation, China’s industrial obsession, GST still broken? |...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/vedantas-ponzi-allegation-chinas",
    "date": ""
  },
  {
    "learning": "yers have lost their relevance in parts of the market. The alpha might lie with those adapting to new demand patterns, not just riding old brand power. But if the CEOs are right, maybe it’s just a cyclical phase. In that case, patience — and possibly rural-focused plays — might pay off. What do you think is happening?\n\nSo, there has been a lot of chatter on JSW acquiring Akzo Nobel. In an interview with NDTV Profi , JSW Paints' Parth Jindal finally revealed what drove them to chase this deal: \"When Akonobel Global announced their strategic review last year, we felt this was too good an opportunity not to really go forward—not to really fight for. If we truly want to become a top-three player, this was the natural partner.\" In October 2024, AkzoNobel announced they were rethinking their whole business.\n\nSource They wanted to focus on industrial coatings i.e. the kind of stuff that goes on cars, planes, and ships which is their main money-maker globally. This was a pretty clear hint they might sell off their house paints business, since that's not really their core strength. While the JSW-AkzoNobel acquisition is indeed significant, there’s a broader pattern at play here.\n\nOver recent decades, many foreign paint giants—including Sherwin-Williams, Nippon Paint (which scaled back significantly), and now AkzoNobel—have reduced their presence or exited the Indian decorative paint market altogether. Clearly, something distinct is unfolding. India’s paint industry functions very differently from the global norm.\n\nDomestically, decorative paints—consumer-focused products for homes and commercial spaces—drive demand. Internationally, however, non-decorative, industrial, and specialized coatings dominate markets. Indian paint companies primarily build powerful consumer brands, relying on marketing and extensive distribution networks.",
    "title": "Business, Biotech & Brand Battles: A Story of Three Shifts | Who said What? S2E1",
    "articleUrl": "https://thedailybrief.zerodha.com/p/business-biotech-and-brand-battles",
    "date": "October 26, 2025"
  },
  {
    "learning": "Reliance’s gladiator push in India’s soft drinks’ market Carbon Pricing is going mainstream Reliance’s gladiator push in India’s soft drinks’ market Summers in India are hot in more than just one way. Every year, in April-June, various companies battle each other to put their soft drinks in your refrigerator. They prepare to mount aggressive marketing campaigns, ramp up their production capacity, and court retailers and kirana stores with incentives to stock their product.\n\nFrom Coke to Rooh-Afza to energy drinks, every summer, India sees an intense, heated battle of the beverages . Recently, however, a new heavyweight has emerged on this battlefield: Reliance . The Mukesh Ambani-led giant has announced its intention to invest upto ₹8,000 crores on expanding its beverages business.\n\nThis is their largest investment outlay in the FMCG sector to-date. Reliance has been making waves in soft drinks for the last couple of years. It famously mounted an audacious challenge to the duopoly of Coke and Pepsi, by reviving the Campa-Cola brand. That is the flagship of Reliance’s push. Much of its ₹8,000 crore investment will be devoted to Campa-Cola’s expansion.\n\nBut it is only the most notable of a series of drinks Reliance is bringing to the market. So why is Reliance investing in such a crowded industry? What are the tides that favor them in this battle? How are its competitors reacting to this offensive? These are the questions that are bubbling in our minds.\n\nFrom the past to the present India's story with soft drinks has been a rollercoaster ride. 1959: US President Eisenhower sips a Coke in New Delhi It began from 1956, when Coca-Cola entered India and made a major splash among relatively-richer Indians. But this was an older India, where business was seen with suspicion.",
    "title": "Reliance's soft drink shake-up",
    "articleUrl": "https://thedailybrief.zerodha.com/p/reliances-soft-drink-shake-up",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "e 3-nm, 2-nm and 1.6-nm chips in the world. Both of SMIC’s 5-nm and 7-nm are going to be 50% more expensive than TSMC’s offerings. SMIC’s 7-nm yield of around 40% also pales in comparison to TSMC’s 80% — that is, it is thrice as wasteful. This gap is particularly clear with AI chips. With Chinese AI chips, Huawei leads the pack with its Ascend 910B.\n\nThese trail NVIDIA’s H100 and B200 chips in inference performance considerably. The Ascend 910C, which combines two 910Bs, achieves only 60-70% of the H100’s inference performance. This is a structural barrier — Huawei builds its chips on SMIC’s relatively inefficient 7-nm node, while NVIDIA works with TSMC.\n\nCould Huawei possibly reach NVIDIA’s edge with its current capabilities? If nothing else, it can build up huge clusters of its chips, which collectively do more. For instance, its CloudMatrix CM384 cluster (which uses Ascend 910C) has higher memory bandwidth and compute in comparison to NVIDIA’s GB200 NVL72.\n\nBut, at the same time, it consumes more than 4 times the power used up by NVIDIA. Huawei is also on the backfoot with the software ecosystem surrounding the chips, called ‘CANN’. Developers have reported bugs with CANN that render the Ascend chips almost unusable. Its customers like Baidu and Tencent have complained of frequent crashes .\n\nOn the other hand, NVIDIA’s CUDA ecosystem is one of the company’s strongest moats . Unlike Huawei, it has a huge developer community — which keeps perfecting how it runs. This reinforces NVIDIA’s network effects as it onboards more and more developers. The truth is, no matter what the headlines say, the west currently is far ahead of China in the chip race.",
    "title": "Can China crack the chip game?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/can-china-crack-the-chip-game",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "There’s more we’re yet to explore. In a coming episode, for instance, we’ll dive deep into the newly emerging contract manufacturing space. But for now, let’s look at one of India’s biggest drug manufacturers: Sun Pharma. Sun Pharma If you ever walk into a pharmacy in India, there’s a decent chance the drug you’re holding came from Sun Pharma.\n\nThey're not just some pharma player — they’re the largest pharmaceutical company in India , and one of the top four generic drug makers in the world. But, right now, if anything, they’re actively trying to break out of that very category. Breaking out of generics Sun made its name by selling generics — copycat versions of branded drugs, once patents expire.\n\nGenerics companies prosper by making these old drugs for cheap, and then selling them at scale. But if you’re making a copycat product, there’s nothing setting you apart from others that are doing the same. And so, the generics industry is brutally competitive. Prices keep falling, and margins are thin.\n\nSource That’s why, over the past few years, Sun’s quietly been repositioning itself — away from generics, and towards something much more lucrative: specialty drugs . These are complex formulations — biologics, injectables, dermatology or cancer drugs — that treat chronic or severe illnesses. These are complicated to make, but if you can crack it, you often face less competition.\n\nRelative to other pharma products, specialty drugs behave like a premium industry: it’s harder to enter, costlier to scale, but more defensible and sticky once you’re in. How’s that strategy playing out? Well, that’s where these Q4 FY25 results get interesting. Sun Pharma clocked consolidated revenue of ₹12,816 crore for the quarter — a tame growth of 8.5% year-on-year.",
    "title": "Why Sun Pharma Is Betting on New Drugs",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-sun-pharma-is-betting-on-new",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "One of them is MMA — mono-methyl aniline. This product line is used in fuel applications, and they’ve been scaling this aggressively. Volumes are up nearly 40% year-on-year, and they’ve started supplying to newer geographies like the US and Europe. This business is still in the early stages, but it shows Aarti’s ability to absorb shocks, and expand into newer, high-potential categories.\n\nSource Behind the scenes, Aarti has also been cutting down its costs. They completed a bunch of fixed and variable cost savings projects in FY25 — like installing more efficient turbines for steam, switching to hybrid power sources, and improving yields in key value chains. Nothing flashy, but over time, they’ll help the company protect margins, even if prices stay weak.\n\nAarti has also been investing heavily in capacity. Their total capex in FY25 was over ₹1,370 crore. And it doesn’t end there; for FY26 they’ve guided another ₹1,000 crore. A large chunk of this is going into what they call “Zone-4” — a new facility with multipurpose plants that will allow them to manufacture more advanced, higher-margin chemicals, especially for pharma and agro sectors.\n\nThe bulk of the new unit’s impact will only show from FY27. Until then, Aarti will have to push as much volume as it can from existing assets. And they’re very focused on doing just that. For now, their capacity utilization, across major product categories, is still running below peak. For example, their ‘PDA’ chain — used in polymers — has just 33% utilization right now.\n\nEven MMA, despite the surge in demand, is at 62%. So there’s a lot of room to grow output without needing new capex. And that’s their aim, this year: driving higher capacity utilization and squeezing more profit out of existing assets. Fine Organics Fine Organics doesn’t make chemicals in bulk at all. It makes specialty additives — tiny, specialised inputs that go into products like food, plastics, cosmetics, coatings, and animal feed.",
    "title": "India’s Specialty Chemicals Industry Explained",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indias-specialty-chemicals-industry",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "purity battery chemicals (e.g., lithium carbonate, cobalt sulfate, nickel sulfate). This critical, energy-intensive step is dominated entirely by China, which controls roughly 80% of global lithium refining and similar shares for cobalt and nickel. Component Manufacturing (Cathodes, Anodes, etc.): These purified materials are then turned into battery components — including cathodes, anodes, electrolytes, and separators.\n\nOnce again, these are all largely produced by China — alongside a few other East Asian countries. Cell Manufacturing: At this point, all those components come together to make a battery cell. Cell production is highly sophisticated and capital-intensive, requiring gigafactories. China produces over three-quarters of all battery cells globally.\n\nThat’s a staggering share — dominated by companies like CATL and BYD (both Chinese), who themselves account for a large chunk of the world’s battery supply. Source The remaining big cell producers are primarily South Korea (LG Energy Solution, Samsung) and Japan (Panasonic). Battery Pack Assembly: Finally, many different cells are packaged together into battery packs.\n\nIn an electric car, for example, hundreds or thousands of cells are combined into modules and packs — which are then installed in the vehicle. Pack assembly is often done close to where the final product is put together, to reduce shipping of heavy batteries and to tailor the pack to the specific product. You’ve probably seen China’s name all over this list.\n\nThat, to us, can be a problem. Let’s talk specifically about India in this context — both, because that’s the country we care the most about, and because it illustrates the challenges of trying to secure one’s place in the battery race. India’s Battery Story India’s battery industry traditionally made lead-acid batteries.",
    "title": "Batteries are the New Oil?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/batteries-are-the-new-oil",
    "date": ""
  },
  {
    "learning": "Gupta, didn’t sugarcoat the impact. “Even after the price increase of INR 50 per cylinder in the month of April, we are still losing on LPG. We are incurring under-recoveries to the extent of INR 650 crores to INR 700 crores per month.” He added: “Now the under recovery has come down... every month, we are expecting around INR 650 crores to INR 700 crores for BPCL.\n\nAnd we are hopeful some mechanism will be put in place so that maybe on a quarterly basis, we can get the reimbursement.” This cost of about ₹700 crore per month rounds off to over ₹8,000 crore annually for just one company. Add HPCL to the mix, and the scale becomes even more staggering. HPCL’s Director of Finance, Rajneesh Narang, said: “Now, coming to your LPG under recovery, yes, we had absorbed almost INR 10,900 crores of LPG under recovery.\n\nBut subsequent to that, you had seen that the government has increased the prices of LPG by INR 50… That would bring down and currently, there is an under recovery of around INR 165 to INR 170 per cylinder.” To ease the pain further, BPCL and others are also looking at cheaper sources.\n\nWe are expecting a USD 20, USD 30 per metric ton opportunity by shifting AG (Arab Gulf) cargoes to US-based cargoes.” But there’s a technical hitch here—U.S. LPG tends to be richer in propane, while India’s domestic distribution network and appliances are calibrated for a specific propane-butane mix. Using propane-heavy LPG could impact pressure regulation and burner performance, which means OMCs need to either blend the imported fuel or upgrade infrastructure to accommodate it.\n\nSo while American LPG may be cheaper on paper, its usability hinges on logistical and safety adjustments. The LPG distribution network in India is one of the most extensive in the world. Over 200 bottling plants, more than 24,000 distributors, and delivery mechanisms that reach every district—urban or rural.",
    "title": "Why India’s LPG System Is Under Pressure",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-indias-lpg-system-is-under-pressure",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "the currency from appreciating. Why all this hidden intervention? Taiwan’s life insurers were shovelling massive amounts of money into overseas US dollar assets — we’re talking hundreds of billions of dollars. On paper, these insurers promised payouts in Taiwanese dollars to local policyholders. But as we mentioned before, their currency mismatch was a crucial risk: one large forex move could ruin their entire business.\n\nTo manage this, the insurers had to hedge: they needed to lock in the future USD-TWD exchange rate, so that a rising TWD wouldn’t crush the value of their USD assets. But that created its own problem: the size of the hedging demand was so enormous that it would have swamped Taiwan’s onshore derivatives market, driving up the value of the TWD. And because Taiwan depends so much on exports, that was precisely what the central bank wanted to avoid.\n\nSo the central bank itself quietly stepped in as the counterparty to Taiwanese insurers, effectively absorbing the hedging flows through foreign exchange swaps and forwards. But crucially, it didn’t report this activity in its official reserves. After all, it was uniquely shielded from the International Monetary Fund’s (IMF) disclosure requirements.\n\nSee, the IMF has guidelines — backed by increasing global pressure — around what counts as “foreign exchange intervention” and the disclosures a country’s central bank is expected to make. Typically, countries on the IMF’s Special Data Dissemination Standard (SDDS) are required to report detailed reserve data, including forward and derivative positions. But here’s the catch: Taiwan wasn’t signed up to the SDDS at all .\n\nAfter all, most countries in the world don’t even recognise Taiwan’s existence, because of its history with China. It couldn’t conceivably become a member of the IMF. But that very fact also gave the Taiwanese central bank a legal loophole. Because it wasn’t bound by the same reporting standards as other countries, Taiwan wasn’t technically required to disclose its derivative positions or forward book.",
    "title": "A 6%+ jump in 2 Days – What’s pushing Taiwan’s Dollar?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/a-6-jump-in-2-days-whats-pushing",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "unning, and less on the trucks to haul their output. That’s how they managed to keep ₹1,270 of cash profit per tonne—and that’s why their EBITDA looks strong. Adani Cement When the Adani Group bought Ambuja and ACC just three years ago, in 2022, the pair had 66 million tonnes of capacity. Fast forward to today: with new acquisitions (Sanghi, Penna, Orient) and various expansions, they’ve grown to over 100 million tonnes.\n\nIn other words, in less than half a decade, they’ve become a player to reckon with. Source In the March quarter, they shipped 18.7 million tonnes of cement — up 13% year-on-year. As volumes went up, their revenue, too, rose to ₹9,889 crore, up 11%. Its EBITDA followed, reaching ₹1,868 crore — up 10% year-on-year.\n\nSource But because costs went up — including higher spending on branding, consultancy, and purchased clinker — the EBITDA margin slipped slightly to 18.9% from 19.1% a year ago. Source But there was a surprise. The company’s PAT actually fell by 16% — to ₹1,282 crore. Somehow, the company became less profitable, despite doing good business.\n\nThey scrapped some 40-year-old kilns at Barchasa, booking a ₹200-crore impairment charge. This is like writing off old equipment that’s no longer useful — a one-time expense on its books, but one that doesn’t point to any deterioration in its business fundamentals. In the same quarter last year, the company received a ₹826-crore government subsidy, which boosted its income artificially.\n\nThere’s no such subsidy this time, so the comparison looks weaker. If you remove these quirks, though, their core business is actually improving. Just like UltraTech, Ambuja has been working on costs: Its fuel cost fell 14%. Like Ultratech, that’s thanks to more captive coal, and cheaper pet-coke sourced via Adani’s trading network.",
    "title": "What’s Powering the Cement Boom?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/whats-powering-the-cement-boom",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "I'm really big on that.” Look, if you’re a regular user of AI, you’ve probably already been creeped out a couple of times by what all it knows about you. And if that hasn’t yet happened to you, just open your most used AI app, and ask it to give an honest, unfiltered opinion of you without sugarcoating things. Zuckerburg wants to dial this up to 11.\n\nMeta already has years’ worth of data on you, from all your Facebook and Instagram activity. He’s going to teach all that to AI as well. You know how Reels have that scary ability of giving you junk that’s tailored exactly to the person you are, keeping you watching for hours at an end? Well, the AI you talk to might soon have that uncanny understanding of you as well.\n\nThere’s another ingredient to this: he wants to change how people interact with AI apps from the current chatbot-centric way of doing things, to something much more conversational. From his conversation with Dwarkesh, once again: “Being able to mix [Meta’s new voice model] in with the right personalization is going to lead toward a product experience where, if you fast-forward a few years, I think we're just going to be talking to AI throughout the day about different things we're wondering about. You'll talk to it while browsing your feed apps.\n\nIt'll give you context about different stuff. It'll help you as you're interacting with people in messaging apps. Eventually, I think we'll walk through our daily lives and have glasses or other kinds of AI devices and just seamlessly interact with it all day long. Whatever the benchmarks are that lead toward people feeling like the quality is where they want to interact with it, that's what will ultimately matter the most to us.” Now, we’ve already seen other labs focus on having AI models talk.\n\nThat’s not an innovation by itself. What caught our attention, though, was the overall vision: of you constantly in touch with your voice-based AI companion all day long — a little like Ironman and JARVIS. For that to happen, it’s not enough that your AI app is intelligent, or capable. Meta’s focus, with AI, is no longer just on making it more intelligent.",
    "title": "No Buyers for Maruti, No Limits for Zuckerberg, No Path for Growth | Who said...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/no-buyers-for-maruti-no-limits-for",
    "date": ""
  },
  {
    "learning": "So we are doing this model in a profitable manner with a very strong unit economics. Reliance also expanded its consumer brands business rapidly. Products like Campa Cola and Independence groceries earned a staggering ₹11,450 crore revenue in just their second year​. They also launched Shein — the fast-fashion giant — back into India via Ajio.\n\nIn doing so, it brought over 12,000 clothing options to India, making it one of the widest fashion selections available​. Jio Platforms: The beast keeps growing Jio is now the world’s largest data company outside China. And yet, its growth has somehow not slowed down even now. Its revenue from this segment grew 17.8% YoY, and 2.8% QoQ.\n\nIts EBITDA was up 18.5% year-on-year and 2.6% QoQ. Source All these customers are paying it more as well. The segment’s ‘average revenue per user’ (ARPU) rose to ₹206.2, up 13.5% from last year​, helped along by price hikes. Jio’s achievement, by the way, isn’t just financial — it’s also making major technological leaps.\n\nJio has transitioned 191 million users to 5G already. Remarkably, 45% of all Jio data traffic now happens over 5G​. One jaw-dropping achievement: Jio successfully handled the world's densest mobile event at the Mahakumbh 2025 — where 660 million devotees reportedly gathered over 45 days. As Anshuman Thakur, Head of Strategy, put it : \"Nobody anywhere in the globe had ever seen something like this.\" And also: \"There were jammers, limited access zones, drones causing interference — and yet our network gave 200 Mbps+ speeds and processed 2.2 million GB of data traffic.\"​ This is being treated as a case study globally.\n\nNo telecom company anywhere had ever managed something at that scale. Separately, Jio has also opened a new business-to-business vertical. It launched private 5G networks for industries (like at their own Jamnagar refinery), offering dedicated, secure 5G slices for things like robotic automation and video surveillance.​ Oil & Gas Exploration: Mixed bag Reliance’s oil and gas business is small, at least compared to its retail or telecom giants.",
    "title": "Is Reliance Building the Future? Q4 Results Deep Dive",
    "articleUrl": "https://thedailybrief.zerodha.com/p/is-reliance-building-the-future-q4",
    "date": ""
  },
  {
    "learning": "The state of India’s economy The electric 3-wheeler revolution has flaws The state of India’s economy A few months ago, we tried digging into the data to understand where India’s economy was. This was right before the GDP figures for the December quarter were in, and we were trying to gain a mental picture of where things were. After digging through many dozen charts, we came up with a messy, nuanced picture: of an economy that was trudging along, resilient but not buoyant.\n\nWhat we hadn’t bargained for, back then, was that all our economic assumptions would suddenly shift. That’s precisely what has happened since. America’s historical tariffs are slated to choke trade across the world. We’re looking at a time of deep, global uncertainty. The level of economic risk, all across the world, has escalated wildly.\n\nGlobal growth will most likely weaken in the months to come. In a worst-case scenario, America, the biggest pillar of global trade, could even hit a recession this year. And that doesn’t even account for the long-term problems that could arise from the world collectively slamming the brakes on global trade.\n\nWe could see an era of widespread industrial disruption and reduced investment if countries keep spiralling towards a trade policy disaster. Of course, not all of this will transmit to India. We’re relatively insulated from the global economy. We have much less to lose, right now, compared to other developing countries like Vietnam or Bangladesh.\n\nOur goods exports to the United States make up just 2.1% of our GDP. But we aren’t cut off from the world either. If the entire global economy takes a severe beating, we’ll take a bad hit as well. This is an interesting time to be observing the economy. And so, we’re diving into the data once again. Like the last time, this is going to be a messy, chaotic exercise.",
    "title": "A Quiet Shift in India’s Economic Story",
    "articleUrl": "https://thedailybrief.zerodha.com/p/a-quiet-shift-in-indias-economic",
    "date": "October 26, 2025"
  },
  {
    "learning": "Rough patch for Indian IT The IMF has no idea what’s happening Rough patch for Indian IT Indian IT companies are hitting a rough patch. At least in the short term, the future doesn't look any brighter either. And this isn't just us speculating or echoing market experts — it's straight from the horse's mouth.\n\n” That's significantly below analysts' expectations, which were around 6.3% . Infosys isn't alone here; TCS and Wipro are feeling the heat too. Wipro's CEO, Srini Pallia, shared similar sentiments, pointing out , \" Going from FY25 to FY26, uncertainties have dramatically increased .\" He even forecasted a sequential revenue decline of between 1.5% to 3.5% for the coming quarter.\n\nICICI Securities noted that Wipro’s guidance for Q1FY26 “is the weakest ever (except Covid)” Industry leader TCS, meanwhile, missed its earnings estimates last week. Of course, these estimates aren’t always reliable, but yet another more indicator that things aren't exactly rosy. The stock market is reflecting this anxiety as well.\n\nWhile the broader Nifty 100 index has almost broken even for the year, the IT basket is down about 20% since the beginning of the year. Source Now, we did touch upon this issue last month , pointing out concerns around the weakening US dollar and how that could negatively impact Indian IT exports. Back then, we talked about potential economic hurdles from Trump's second run — higher inflation, slower growth, and elevated interest rates in the US — were all bad news for Indian IT.\n\nAfter all, Indian IT exports track the US economic growth, given how the US contributes 60-62% to the revenues for the sector . Source But since then, things have gotten much trickier. Trump's latest \"reciprocal tariffs\" announcement has added massively to the uncertainty. And now, with recent earnings and commentary from the big three — TCS, Infosys, and Wipro — we're getting a clearer picture of what’s happening directly from the companies themselves.",
    "title": "What’s Going Wrong with Indian IT?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/whats-going-wrong-with-indian-it",
    "date": "October 26, 2025"
  },
  {
    "learning": "ee on the Markets YouTube channel and in the newsletters. And that’s because we don’t always know what we’re talking about; we’re constantly learning on the job. That’s our philosophy: we approach everything on this channel as people who are learning . The world has had enough “experts”; it needs more amateur geeks and nerds who delight in learning about new things and sharing them with the world.\n\nThat's how I see myself, and that's the attitude I ask all my wonderful colleagues to have when they're exploring different rabbit holes. Current success We started Daily Brief late last July . It has quickly become India's most popular daily finance podcast.\n\nI would be lying if I said I don't feel an incredible high that we've managed to achieve this in less than a year. Not because we want to be media moguls — we know very well how quickly this could all fall apart — but because there are so many people who seem to care about the things we care about. As nerds that are out to do an honest job of exploring our fascinations, there are few things this gratifying.\n\nSuccessful experiments Along the way, we've never stopped experimenting. One of the reasons this channel is what it is today is that we constantly keep trying new things. Some experiments have worked well, like \" Who Said What \" or \" The Long Answer \". We also started a weekly book club and it’s been fun.\n\nThere have been other ideas I promised, which, for a variety of reasons, we couldn't make work. You’re going to see a lot of this churn ahead too. I'm not a cruel person when it comes to killing my babies . Future plans Everything we do, we approach from a place of pure curiosity. But increasingly, I've been thinking about what comes next.",
    "title": "The Story Behind Markets by Zerodha: Our Journey and Future Plans",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-story-behind-markets-by-zerodha",
    "date": ""
  },
  {
    "learning": "Why we struggle to innovate Delhivery added Ecomm express to its cart Why we struggle to innovate Commerce Minister Piyush Goyal just struck a raw nerve in the Indian start-up ecosystem. Speaking at the ‘StartUp Mahakumbh’, he claimed that Indian start-ups needed a ‘reality check’. The sorts of businesses that Indian start-ups are entering — most of them consumer-focused, from quick commerce to healthy ice creams — weren’t really start-ups , he said; they were closer to simple, traditional businesses that didn’t push us forward as an economy.\n\nHe contrasted our start-ups with the sort of deep tech startups that you see in China. We need more innovation, he said, so that it could take its businesses across the world. His clincher was this comparison: Source Ouch. This sparked a huge social media flame war, because of course it did. Start-up founders returned his charge with their own counters: Indian start-ups are doing important work ; India’s economy doesn’t yet have room for deep tech start-ups ; the Indian government is sclerotic and unconcerned ; and its unending appetite for bribes and licenses kills businesses.\n\nMany things can be (and often are) true at the same time. India does lag the Chinese economy; as does our deep tech ecosystem. We’re nowhere close in a head-to-head match (check out Finshots for examples of where we stand). We’ve spoken before about how China’s innovation ecosystem came about, though, and isn’t always pretty .\n\nChina’s innovation strategy is deeply inefficient and frequently gamed. It pits hundreds of start-ups together in a bout of what some call “hunger games capitalism”. It is a strategy that is meant to create national champions, but at the expense of its traditional economy. At the same time, we are serial laggards in the realm of innovation.\n\nThis is a sphere where we routinely punch well below our weight. We are simply absent from some of the world’s most dynamic industrial sectors, and serially under-invest in research and development. What’s actually holding us back? For answers, we’re digging through a recent paper by Sarthak Pradhan and Pranay Kotasthane from the excellent Takshashila Institution .",
    "title": "Why India Can’t Build the Next Apple or Tesla",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-india-cant-build-the-next-apple",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "he Global Consumer Is the Real Test What Uday Kotak said isn’t just about global recognition. It was about what it takes to build truly world-class companies . “The global consumer is your test of quality, your excellence. If you have a strong brand, you can command a much higher price.” That’s what Indian companies need to strive toward.\n\nBut until then, as investors, it’s on us to build portfolios that reflect where the world is—not just where we are. Because while India is a great story, it’s not the only story. And as we’ve seen with China, even a great economic story doesn’t always lead to great market returns. Uday Kotak says banks are not making money?\n\nThere’s another thing that Uday Kotak said this week, that honestly I couldn’t understand very well. Here’s what he said: Now, if that sounds like greek and latin to you I understand. I asked Kashish from the team who claims to be banking expert to help me with this piece and he made sure that I gave him credit for this, so here’s his two seconds of fame.\n\nWhat Uday Kotak is Really Saying So here’s what’s happening: some banks are raising money by taking in wholesale deposits — large, lump-sum deposits from companies or institutions — and they’re paying around 8% interest for that money. But banks don’t get to use all of that 8% freely. A chunk of it has to be set aside because of regulations: CRR (Cash Reserve Ratio) : This is money the bank has to park with the RBI.\n\nSLR (Statutory Liquidity Ratio) : This is money the bank must invest in safe government bonds — which usually offer lower returns. Deposit Insurance : Banks have to pay a small premium to insure your money. Priority Sector Lending : Banks are required to lend a portion of their funds to specific sectors like agriculture or small businesses — not always very profitable.",
    "title": "Who said what about No Global Indian Giants, Bank Profit Illusions & India’s ...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/who-said-what-about-no-global-indian",
    "date": ""
  },
  {
    "learning": "arge, formalised businesses get strong legal protection, very few such jobs are available. Instead, we have a segmented labor market, where most Indian workers have no job security—and most firms have no reason to formalize or grow. MSMEs don’t get much financing Indian MSMEs don’t have enough capital, and finding financing is a nightmare.\n\nSee, MSMEs are bad candidates for bank loans. They often lack sufficient collateral, credit history, or banking relationships, and that makes it hard for them to get the money they need — to expand, upgrade their technology, or even find enough working capital to get by. Informal enterprises have it the worst — they’re cut off from the formal banking system, and have to fall back on informal sources of money, like family, friends, or even moneylenders.\n\nThese could work if you’re just trying to survive, but they aren’t nearly enough if you really want to grow. In 2012, for instance, an IFC study found that MSMEs had unmet credit needs of roughly $418 billion . That number could be even larger today. These money constraints stop tiny household firms from “graduating” into larger enterprises.\n\nOne study, in fact, found that around one-third of informal firms saw finance as a major constraint to their growth. Interestingly, the same study found that when informal firms gained better access to banks — thanks to branches opening nearby — their odds of hiring non-family workers jumped by 25% . That is, these branches made them far more likely to become real employers.\n\nThis lack of finance also stops them from investing in productivity. Without enough capital, small businesses cannot invest in modern machinery, better inputs, or process improvements. Now, as we’ve spoken about recently , policymakers recognise these issues. Schemes like priority sector lending pushes a lot of finance to SMEs.",
    "title": "Why Do Small Businesses in India Struggle to Grow?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-do-small-businesses-in-india",
    "date": ""
  },
  {
    "learning": "In fact, the former chairman of ICICI, K.V. Kamath, said in an Economic Times interview a couple of months ago that there is evidence that households have borrowed money to invest in the stock market… We went to a prominent high street bank in a [U.P.] district. We saw an illiterate man come and take a 10 lakh loan from the bank, and he said he would invest that money in futures and options in the stock market.” The Bigger Picture So what happens when a sizeable portion of the middle class is under financial strain?\n\nIf households are spending more of their income servicing debt, they’re spending less on everything else—appliances, travel, even school fees. That impacts business revenues, which in turn affects jobs and investments. We are already seeing this happen, consumption has started to go down. The management of big FMCG cos have been constantly saying this for the past year.\n\nMarcellus Investment Managers Two, defaults rise. We’re already seeing early signs of this. Credit card NPAs are above 2%, personal loan defaults are inching up. These are still manageable—but the direction matters. Three, policy blind spots emerge. Saurabh makes an important point: despite paying most of the taxes, the middle class isn’t politically powerful.\n\nThey make up maybe 10–15% of the voting base. So policies tend to cater either to the very poor (through welfare schemes) or to the very rich (through capital-friendly reforms). The middle class often ends up squeezed in the middle—without the subsidies of the poor or the capital of the wealthy. Not everyone with a loan is in trouble.\n\nMany borrowers are using credit responsibly, for assets, business, or emergencies. But what Saurabh is pointing out is a structural issue. A significant number of households are now using credit as a substitute for income. That’s when debt becomes a trap. Saurabh’s not saying the economy is on the verge of collapse.",
    "title": "Who said What about India’s middle class, India’s growth, US-China war and more",
    "articleUrl": "https://thedailybrief.zerodha.com/p/who-said-what-about-indias-middle",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "e system hadn’t gotten any cheaper. It had, instead, eliminated a critical revenue stream for banks and payment providers. And with that, these companies argued, the sustainability of the system had become a significant concern. Yet, the Other Side of the Coin: Sustainability Concerns Even though the elimination of the MDR had granted merchants immediate savings, industry stakeholders were unhappy.\n\nAfter all, they found themselves subsidising India’s digital payments system, for little reward. As an article from Ikigai Law notes, without money coming in from MDR, over the long run, you could actually see investments in digital payment systems go down . After all, these revenues are the main incentive banks have to invest in digital payments.\n\nFor whose sake are they bearing those costs? Ikigai Law argues that the biggest beneficiaries of a zero MDR aren’t small businesses, but large businesses that are already capable of absorbing these fees easily. Ironically, the small merchants who ought to benefit didn’t really see much practical advantage from the policy.\n\nTheir low transaction volumes and ticket sizes mean that they’d pay very little MDR anyway. If anything, the policy has distorted market incentives , which has perverse effects. Without a legitimate source of revenue from UPI transactions, instead, banks and payment providers began levying opaque, indirect charges.\n\nThey also found ways to cross-subsidise the service: by selling data, upselling other products, or selling advertisement space. What could have been a straightforward business essentially became a lot more murky and opaque. Of course, it’s not as though the government was blind to these issues. It introduced several incentive schemes to (partially) cushion the industry's revenue losses.",
    "title": "Will UPI Stay Free Forever?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/will-upi-stay-free-forever",
    "date": ""
  },
  {
    "learning": "ubsidy investigation into Chinese EVs to curb imports, for instance, Germany actively lobbied against it . Similarly, when the EU mooted tariffs on Chinese EVs, Germany voted against it . After all, Volkswagen and BMW feared retaliation that could hurt their China business further. The German government found itself in a difficult position: defend its own industry or avoid angering China.\n\nIn the end, though, the EU moved forward with 45% tariffs on German EVs — over the objections of the EU’s largest car-makers. But beyond this, there were two other, albeit smaller, reasons as well. The energy crisis and the Ukraine war The war in Ukraine had immediate and far-reaching effects on German industry — including its auto industry.\n\nBefore the war, Germany depended heavily on Russian natural gas to power its factories. In fact, before the war, nearly 55% of Germany’s natural gas supply came from Russia. When the conflict began, and sanctions were imposed on Russia, that supply was severely disrupted. Making a car, as you can imagine, is an energy-intensive process.\n\nThe increase in energy prices was a sudden shock . It squeezed profit margins for automakers who were already struggling with supply chain disruptions from the pandemic. For context, today, German automakers pay 3-5x as much as their competitors in the United States or China for energy — even after the initial shock subsided.\n\nSuddenly, running the factories became much more expensive. And so, the industry was severely hit with a double blow: declining demand and rising costs. Overcapacity and high labour costs During its boom years, Germany built enormous production capacity. But now, with demand declining, many of these factories are underutilized.",
    "title": "The Fall of Germany’s Car Giants?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-fall-of-germanys-car-giants",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "actively bringing capital into other economies, and creating thousands of jobs. Source: CBM Notably, however, its diversification hasn’t purely been economic. Instead, a lot of its proposals have apparently gone to countries that seem ‘friendly’ to China. Last year, the EU voted for new tariffs on Chinese cars.\n\nIn retaliation, China asked its EV companies to pause their investment plans in countries that voted in favour of the tariff. Meanwhile, countries like Spain and Hungary — which China sees as friendly to it — benefited from investments. Some commentators have argued that India has seen the worst end of Chinese investment policy.\n\nThis is, arguably, why India hasn’t really benefited from the China+1 move, despite trying to play itself up as a natural replacement for the country. But does this narrative really hold water? Is China throttling Indian investments? A key narrative, amidst this global shift, is that China is directing its firms not to invest in India.\n\nWhile China was never a major source of FDI into India — at least compared to countries like the United States or Japan — their investments are even lower now. Since 2020, in fact, we’ve only seen a faint trickle of investments from the country. In 2023, for instance, we barely received US$ 42 million from China.\n\nSource: Think China But is this entirely the Chinese government’s doing? There are some reports, for instance, that the Chinese Ministry of Commerce strongly told their car makers to avoid investing in India . A major reason China doesn’t invest in India is that we weren’t keen on taking Chinese investments in the first place.",
    "title": "Why China Won’t Let India Rise?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-china-wont-let-india-rise",
    "date": ""
  },
  {
    "learning": "ledensity — which measures the number of connections Indians have — is around 85%. Our urban teledensity is roughly 130% (that is, there are 1.3 connections for every urban Indian), while our rural teledensity is around 60%. India’s internet penetration, too, has increased sharply, with over 900 million internet users.\n\nFixed-line broadband penetration is low, with only 40 million wired broadband connections nationwide, mostly in cities. Mobile data is the primary way people access the internet. Specifically, a large portion of rural India still lacks reliable broadband connectivity. So, India does have an unserved market for high-speed connectivity, largely in rural areas.\n\nThat could be the market segment it goes for. But we wonder if most rural Indians will make the switch from cheap mobile data to Starlink. Which brings us to the biggest issue here. The biggest issue with these deals? See, Starlink is already operational in other countries — and that gives us a sense of what they might want to charge.\n\nThe company has an ARPU (Average Revenue Per User) that’s many multiples as high as Indian telecom services. Starlink’s yearly ARPU is around ₹1.5 lakh. Even in Indonesia, one of Starlink’s cheaper markets, monthly bills start at almost ₹4,000 a month . In contrast, Reliance Jio’s monthly ARPU is ~₹200, which adds up to around ₹2,400 per year.\n\nSo Starlink is around 60x as expensive as a regular Jio connection. The point behind bringing Starlink to India — at least from the announcements — seems to be to bring the internet to the remotest parts of the country. But if the cost is even nearly this high, can it actually work? — Starlink’s biggest market — the service is used only in the most remote parts of the country, while urban areas are well covered by traditional players.",
    "title": "Jio, Airtel & Starlink – What’s Cooking?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/jio-airtel-and-starlink-whats-cooking",
    "date": ""
  },
  {
    "learning": "Here, different departments of the bank would contract with each other to manage each of their forex risks — presumably at internal rates rather than the market rate. This internal desk followed “hedge accounting”, where it could spread gains and losses gradually. Here, for years — five to seven years, in fact — the bank did something odd.\n\nOften, when the bank had notional, mark-to-market gains, it promptly booked those gains. On the other hand, a lot of the money that it notionally lost was parked with its “ other liabilities ” — where it would get lost amongst a lot of other short-term payments it was due to make. So basically, any gains from prop trading looked like income, but it dressed losses up so that they didn’t look like lost money.\n\nMeanwhile, it also had an “external desk,” which dealt with trades it was making outside the bank. Here, it used a daily mark-to-market approach, where it was updating values in real time. Because each desk booked derivative results differently, somewhere, a mismatch started to happen. While its external operations were reported accurately, there were issues in its internal operations.\n\nEssentially, the bank began over-reporting some profits but under-reporting certain offsetting losses. This created a growing gap that went unnoticed. The RBI spoils the party At first, this might not have mattered. These mismatches weren’t visible from the bank’s accounts, and the bank kept running as usual.\n\nThe bank could have smoothened the losses in its “other liabilities” over several quarters — by recognising them over months. Instead of one large number, the bank may have shown minor trading losses over the span of years — which people may have considered trivial. But then, the RBI came in its way. In April 2024, the RBI implemented new rules for how banks must classify and value these derivative contracts.",
    "title": "IndusInd Bank Faces a Crisis!",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indusind-bank-faces-a-crisis",
    "date": ""
  },
  {
    "learning": "in response, had to cut down lending. NBFCs saw their financing options shrink. Suddenly, banks were a much less attractive source of money, and they had to turn elsewhere for funds. Source: Business Standard Some lenders took a particularly bad hit. Consider microfinance institutions (MFIs), for instance.\n\nThese were overwhelmingly NBFCs that borrowed money from banks (or from other NBFCs who, in turn, borrowed from banks) and then gave out unsecured loans. Suddenly, they were starved for funds, as banks stopped lending to MFIs. At the same time, with the new norms, they found it harder to lend to their customers.\n\nMFIs saw a sharp drop in their asset quality and profitability. This was made even worse by the fact that people were failing to pay back their loans, causing serious stress for many institutions. These hardships aside, however, the RBI succeeded in its goal of slowing down loan disbursals. The growth in bank loans, which was once hitting a pace of 20% year-on-year, stalled and then fell off a cliff.\n\nSource: Care Edge Source: S&P Personal loan growth kept moderating through 2024. It fell to 13.7% in December — from nearly 25% at the start of the year. Some of this, perhaps, came from the broader slowdown in consumption that India saw over the course of last year — as people became less optimistic about their finances and cut down on their spending.\n\nThat said, risk weights, too, were a major factor in this story. Back in 2023, credit had been growing at a frenzied pace to a point where a majority of India’s bank deposits were being lent out. Banks had to turn to newer, more expensive sources of money to fund new loans. This had sent India’s credit-deposit ratio galloping upwards.",
    "title": "Why RBI Is Making Borrowing Easier Again!",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-rbi-is-making-borrowing-easier",
    "date": ""
  },
  {
    "learning": "Sales volumes followed a similar trajectory — climbing 21% year-on-year to 10.7 million tonnes (MT), which is 15% above Q2. In all, its net profit jumped by a massive 140%, to 2620 cr. Source: ACC’s Investor Presentation A big part of the profit jump this quarter came from many government incentives being recognized at once.\n\nThese payouts, tied to capacity investments and state-level concessions, can arrive unpredictably. They should therefore be seen as a one-time thing — while the company saw a short-term boost in one quarter, the same lump sum might not show up every quarter (or might have already shown up in a previous year), causing its year-on-year numbers to look less dramatic. Why revenue grew and margins recovered A big slice of the year-on-year and sequential revenue bump came from the company’s higher cement volumes.\n\nAccording to the company, infrastructure projects—especially those that had stalled—picked up steam from December onward. Rural housing demand remained steady, particularly in North and Central India. These factors pushed ACC’s utilization levels higher and helped it weather some of the headwinds it faced earlier in the year.\n\nSouthern markets remained softer than in the north, but the company’s overall realization improved slightly quarter-on-quarter. Why ACC, too, is doubling down on capacity ACC is in the midst of a capacity expansion that aims to cater to the demand coming in from the rest of the Adani Group — across all its business verticals. The company plans to add or optimize several grinding units to keep pace with the growing cement demand.\n\nIt is also planning to cut down transportation costs considerably, by bringing its clinker assets closer to their respective grinding plants and connecting its plants through rail and water. The company is also in the process of integrating newly acquired assets, such as those from Penna and Sanghi. While these plants will eventually improve Adani’s cement business, these integrations carry short-term costs — for plant overhauls, brand alignment, and hiring.",
    "title": "Cement giants getting even bigger?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/cement-giants-getting-even-bigger",
    "date": ""
  },
  {
    "learning": "t improve its long-term position. Source: Company’s Investor Presentation Healthy revenue growth Apollo’s hospital business, which contributes 52% of its revenue, grew 13% YoY to ₹2,785 crore. Source: Tijori Finance Higher and more profitable patient admissions drove this increase. The company saw an 8% YoY increase in ARPOB to ₹60,839 per day, and improved bed occupancy, at 68%.\n\nSource: Company’s Investor Presentation At the same time, its pharmacy and digital health segment grew at 15% YoY, to ₹2,352 crore. The company also rapidly scaled up its ‘Apollo 24|7’ online platform. This was, in fact, the first quarter that Apollo 24|7 turned profitable, contributing ₹32 crore in PAT — compared to a ₹27 crore loss last year.\n\nThis is interesting — last year, Apollo sold a major chunk of Apollo 24|7 to the PE firm Advent International, for ₹2,475 crore. This move to profitability is a good sign for Advent. Better margins, higher profits Beyond revenues, the company also improved its margins. Apollo reported better operational efficiency and a more streamlined revenue mix this quarter.\n\nAs a result, its EBITDA margin expanded to 13.8%, from 12.7% last year. Source: Company’s Investor Presentation The hospital segment — the most profitable part of the business — maintained a steady EBITDA margin of 24.1%, which is only slightly higher than last year. In particular, the company improved its per-bed revenues — driven by its focus on high-margin specialties such as oncology, neurology, and transplants, as well as a rising share of international patients, who pay premium prices.\n\nSource: Company’s Investor Presentation The turnaround of Apollo 24|7, meanwhile, sparked a further improvement in its margins. The quarter saw the company cut its losses in this business line and turn a profit instead. With better margins and more revenue, Apollo’s net profit this quarter surged by a massive 52% YoY — to ₹372 crore, from ₹245 crore last year.",
    "title": "Hospitals deliver strong results",
    "articleUrl": "https://thedailybrief.zerodha.com/p/hospitals-deliver-strong-results",
    "date": ""
  },
  {
    "learning": "alysts and disclose every detail of their operations means transparency is now mandatory. For institutional players, not much has changed. They’ll continue using their proprietary algos, but with more oversight on their operations. Trump’s Tariffs & the Fall of Rules-Based Trade A few days ago, we touched upon Donald Trump's tariffs on China, Canada, and Mexico.\n\nWe have a small update on this front: the tariffs against Canada and Mexico have been paused for one month . Both countries have committed to improving border security and drug enforcement, and are now scrambling to strike a deal with the United States. China, on the other hand, has launched retaliatory tariffs targeting America's energy and automotive sectors.\n\nIt also intends to challenge the tariffs before the World Trade Organisation, or WTO. But that’s not what we want to talk about today. Today, we want to give you some context on the scale of what’s happening. While our previous discussion explored the repercussions we expected to follow Trump’s tariffs, it didn't fully capture the magnitude of the broader shift we’re seeing.\n\nWhile nobody knows how things will look when the dust settles, we might be witnessing something truly historic — the dying breaths of what's known as the 'rules-based international order.' That would mark a global sea change — one that threatens to upend a multi-decadal move towards globalisation. An unprecedented shift This current flare-up is unprecedented. It’s the greatest single spike in tariffs America has seen in the past century, and it's happening in a world that has transformed completely since then.\n\nTo put this in perspective: before Trump took office, the average tariff on all American imports (i.e. both tariffed and non-tariffed goods) was 2.4%. Overnight, this has shot up to 10.5%. This is one of the largest tariff escalations in American history. As we mentioned last time, these new tariffs are five times higher than the total tariffs implemented by Trump during his first administration.",
    "title": "SEBI's latest algo trading rules",
    "articleUrl": "https://thedailybrief.zerodha.com/p/sebis-latest-algo-trading-rules",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "ine with the belief that, with the right regulatory policies, it could maintain its strength. After all, Europe was arguably still the world’s best market. Every company in the world wanted to sell its wares in Europe. This created a point of leverage that Europe could use to maintain control over everyone else.\n\nMany good things came out of this — from global scrutiny over big tech’s data policies, to the universal Type-C charger. At the same time, however, this led to major regulatory overreach, making life hard for European businesses. The poly-crisis Europe’s reliance on its past successes left it ill-prepared for the tectonic shifts of the coming years.\n\nIn the last decade, the continent has been hit by a series of crises — each of which feed into each other: Brexit: When Britain withdrew from the EU, it raised fundamental questions about the union’s role and purpose. The Union’s cohesion was shaken, and ‘Eurosceptic’ voices in other countries have since become much louder . Rise of Trump: Trump broke from decades of precedence in his first term, when he questioned the extension of America’s security umbrella over Europe.\n\nWhile this security cover hasn’t been withdrawn, it has caused a lot of uncertainty in Europe. COVID-19: While the COVID-19 pandemic devastated the entire world, Europe was one of the worst-hit regions in the world — especially in its early years. The economic and political impacts of the pandemic are still being felt in the continent.\n\nRussia’s invasion of Ukraine: When European pushed back against Russia’s Ukraine invasion, it severed Europe’s access to cheap energy. Energy costs in Germany, today, are 3-5 times higher than in the US. As Europe struggled to emerge from these crises, the world had shifted. Many of its natural advantages had disappeared.",
    "title": "Is Europe a lost cause?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/is-europe-a-lost-cause",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "He paints a stark picture: \"Can you really make good long-term returns from US equities when your starting point is arguably the most expensive in history? Financial history suggests this is a bad bet.\" Interestingly, Sanjeev Prasad had also discussed valuations in a CNBC interview sometime back. He pointed out that headline valuation numbers can be very misleading.\n\nFor instance, he explained: \"About 50% of the net profits in the Nifty come from low P/E sectors like banks, metals, and oil & gas. These sectors are trading at relatively modest valuations, but the rest of the market is extremely expensive on both an absolute basis and compared to history.\" He didn’t mince words about “narrative stocks,” saying: \"Many midcap and small-cap narrative stocks have corrected by 20-50%, but their true value is often only 20-50% of their current market prices. There’s still a long way to go for these to align with reality.\" So, are the markets overvalued?\n\nBut both Sanjeev Prasad and Akash Prakash make compelling cases that many sectors and stocks—whether in India or the US—are priced for perfection, if not beyond. If you look underneath the indices there’s a lot of blood. Source: Capitalmind Source: Capitalmind What do you think? ITC is not happy The Indian Express recently published an article saying that ITC wrote in a letter to the Directorate of Revenue Intelligence(DRI) that the smuggling of misbranded cigarettes from Southeast Asian countries into India is causing an annual tax revenue loss of Rs 21,000 crore, apart from helping finance terrorism.\n\nI tried to find this letter but I couldn’t find it anywhere. But here’s what I did find—ITC in their l ast annual report had highlighted this number. They said that: It is estimated that illicit trade causes an annual revenue loss of appx. ` 21000 crores to the Exchequer. With respect to other tobacco products as well, the revenue losses are significant since about 68% of the total tobacco consumed in the country remains outside the tax net.\n\nIndia smokes roughly 12,600 crore cigarettes annually. However large this number may seem, India’s cigarette consumption is relatively low compared to some other countries. For instance, China’s cigarette consumption dwarfs India’s by a wide margin. This leads us to an interesting statistic: India is the second-largest producer and consumer of tobacco in the world.",
    "title": "Who said what about overvalued markets, smuggling cigarettes, achieving AGI a...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/who-said-what-about-overvalued-markets",
    "date": ""
  },
  {
    "learning": "This keeps customers coming back again and again. For DMart, it’s all about volume: selling a lot of products, even if the profit margin on each item is small. That said, things aren’t perfect for DMart. There’s been growing chatter about how quick commerce is starting to impact their business. DMart’s core strength has always been customer loyalty, but with more people prioritizing convenience over cost, it’ll be interesting to see how they adapt to this challenge.\n\nNow, let’s dive into their quarterly results to see how they’re holding up in this changing landscape. For Q3 FY25, DMart reported revenue growth of 17.5% year-on-year, reaching ₹15,973 crore. Their net profit stood at ₹724 crore, reflecting a year-on-year growth of about 5%. While the top line looks strong, the margins tell a different story.\n\nSource: Tijori Finance DMart’s net profit margin dropped to 4.53%, down from 5.09% a year ago and 4.57% in the previous quarter. The management pointed to “increased discounting in the FMCG category” as one of the main reasons for this margin squeeze. Source: DMart’s Press Release The same-store sales growth (SSSG), an important metric for retailers, stood at 8.3% for stores older than two years.\n\nThis is a decent recovery compared to the last quarter but still reflects the pressure of a challenging economic environment. Several factors have impacted margins. First, the rising share of low-margin food and FMCG products in DMart’s sales mix continues to weigh on overall profitability. Categories like general merchandise and apparel, which typically have higher margins, have seen stagnant growth.\n\nIn other words, DMart isn’t selling enough high-margin items to balance out the growing share of essential, low-margin products. Source: DMart Secondly, higher discounting by FMCG companies to stay competitive in metro markets has further squeezed DMart’s margins, as we mentioned earlier. DMart’s rapid expansion has also added to cost pressures.",
    "title": "Here's how DMart works",
    "articleUrl": "https://thedailybrief.zerodha.com/p/heres-how-dmart-works",
    "date": ""
  },
  {
    "learning": "e’re talking about tariffs on machinery and electronics, we’re really talking about making it more expensive for US companies to compete on a global scale. The Peterson Institute also looked at what might happen if the US imposed 25% tariffs on goods from Mexico and Canada. This could cause major disruptions because our manufacturing systems are so closely connected.\n\nTake the auto industry, for example—parts often cross the border several times during production. Adding tariffs at each step would make the whole process a lot more expensive. Here’s what makes these warnings even more compelling: we’ve seen something like this before. New research by economists Klein and Meissner explores America’s original high-tariff experiment during the Gilded Age, from 1870 to 1909.\n\nBack then, the US kept average tariffs at around 35%, and the results weren’t exactly what you might expect. Source: NBER Their research uncovered something surprising: industries with higher tariffs actually saw lower labor productivity. But here’s the real kicker—it wasn’t just about being less efficient.\n\nThe tariffs created a safety net where smaller, less productive companies could survive when they probably shouldn’t have. Think of it this way: instead of encouraging companies to innovate and compete, the tariffs acted like a protective bubble. They also looked at specific industries, like textiles.\n\nEven with tariffs as high as 70%, American producers couldn’t match the quality of European goods. Instead of driving innovation, the tariffs trapped US manufacturers into making lower-quality products. It’s a clear example of how protection doesn’t always lead to competitiveness. The researchers uncovered something else that feels especially relevant today—many of these historical tariffs weren’t even about smart industrial policy.",
    "title": "The Silent Threat of Tariffs: Are We Ready?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-silent-threat-of-tariffs-are",
    "date": ""
  },
  {
    "learning": "de to him as the company unraveled. But we want to take a step back and unpack this slowly. You see this story isn’t just about NestAway or one disappointed founder. This is a story of the golden days of sky-high valuations, the lack of oversight during the funding frenzy of the COVID era, and the fallout that we’re still seeing now.\n\nNestAway, once a promising rental housing startup backed by big names like Tiger Global and Goldman Sachs, seemed to tick all the right boxes. By 2019, it was a leader in the space, valued at ₹1,800 crore. But cracks soon appeared—competition grew, service quality dipped, and the pandemic crushed urban rental demand.\n\nBy 2023, the company was sold to Aurum PropTech for just ₹90 crore. The founder, Amarendra Sahu alleges that investors forged his signature, coerced him into stepping down, and reneged on a promised ₹11.72 crore payout. NestAway’s story isn’t an isolated case. It’s part of a larger pattern of turmoil in India’s startup ecosystem, especially after the COVID-era funding boom.\n\nOnce a billion-dollar unicorn revolutionizing the fashion supply chain, it raised over $300 million from marquee investors like Sequoia Capital and Temasek. But by 2022, things fell apart. CEO Ankiti Bose was suspended over alleged financial irregularities, and the company eventually liquidated. Bose has denied wrongdoing, claiming she was targeted, but Zilingo's collapse left behind a trail of lost jobs and questions about governance.\n\nPositioned as a disruptor in the car servicing market, it had raised money from VCs like Sequoia Capital and Tiger Global. But then the founder admitted to inflating revenue numbers. An audit revealed fake invoices and fictitious garages, forcing investors to write off their stakes and pushing the company into insolvency.",
    "title": "Who said What About diamond prices, Indian startups, SBI deposits, and India'...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/who-said-what-about-diamond-prices",
    "date": ""
  },
  {
    "learning": "want the option to work closer to home or drop into an office just a few days a week. For businesses, co-working means less upfront cost, less hassle, and an added benefit they can offer employees—especially Gen Z and Millennials, who really value flexible work setups. So, what’s making co-working the trend to watch?\n\nLet’s break it down: Startup Culture: India now has over 100 unicorns, and the startup ecosystem is booming. These companies need office spaces quickly, but they don’t want to lock themselves into 5–10-year leases. Co-working is the perfect solution. Source: Smartworks Coworking’s DRHP Asset-Light Models for Big Corporates: Traditional corporates are jumping on board too.\n\nMany are adopting “hub and spoke” strategies, with a main office in the city center and smaller satellite offices in suburban or Tier-2 locations. Co-working spaces make this setup simple and cost-effective. GCC Expansions: Global Captive Centers (multinational companies setting up tech or operations hubs in India) are also turning to co-working spaces.\n\nThey need quick solutions without long-term commitments, and flexible office setups help them adapt to changing workforce needs. Source: Smartworks Coworking’s DRHP Strong Investor Support: Big investors are backing co-working spaces because they see stable, long-term demand. With hybrid work on the rise, occupancy rates at some co-working centers are hitting 80–90%.\n\nSince 2018, real estate in India has attracted around $40.8 billion in FDI equity, with annual inflows averaging over $6 billion. Source: Smartworks Coworking’s DRHP Redeveloped Spaces: Older commercial buildings are being revamped into modern co-working hubs. Landlords love this because smaller, flexible spaces are easier to rent out than a single large office.",
    "title": "Why Co-Working Spaces are Taking Over India’s Office Market",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-co-working-spaces-are-taking",
    "date": "October 26, 2025"
  },
  {
    "learning": "’t many good “finance communities” in India. By community, I mean a clean, safe space where people can interact with finance geeks, nerds, newbies, and experts. Think about it—if you have an embarrassing finance question, want quality advice on finance careers, or just want to bounce some insane ideas off someone, do you have a good circle of people you can turn to?\n\n(ChatGPT doesn’t count.) We think some of the other people reading this post could be that circle for you. But there’s a problem: none of us really know what such a community would look like or how it would even work. We’ve decided not to do anything until we’re clear about what we want to accomplish.\n\nThis only makes sense if we identify a genuine, well-defined problem that such a group could solve. Without that, “building community” is just a hacky corporate trick to lure more customers—and that’s not what we’re here to do. Here’s one idea we have, though: It’s a new year, and that means most of us will be making resolutions.\n\nOne common resolution is to read more. We’re not saying this because we’re already avid readers. Everyone on our team struggles to read as much as we’d like. We keep making plans to read more, but then life gets in the way, and reading takes a backseat. In my view, the odds of you doing something regularly are higher when you have someone to keep you accountable, encourage you, and talk to about it.\n\nFrom what I’ve seen, you’re more likely to stick with something if you have a friend or partner. I’ve noticed this at my gym—people with workout buddies tend to be regular. Maybe this applies to reading as well. As a recovering reader, I can confidently say that if I’m a little less dumb today than I was a year ago, it’s because of the reading I’ve done (however little that may have been).",
    "title": "Let's build a reading habit together!",
    "articleUrl": "https://thedailybrief.zerodha.com/p/lets-build-a-reading-habit-together",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "They also need to limit API access to authorized users with unique keys. Stock exchanges will monitor algo trades after they are executed. If they spot any malfunctioning algos, they will have the authority to stop them immediately using a \"kill switch.\" Exchanges will also ensure that brokers clearly differentiate between algo orders and non-algo orders.\n\nTo understand why SEBI is focusing so much on algo trading, let’s take a look at its history in India. Algo trading started in 2008 when SEBI introduced Direct Market Access (DMA). This allowed institutional investors to place orders directly into exchange systems, skipping brokers. It gave them faster trade execution and better control.\n\nLater, exchanges like NSE started offering co-location services, where traders could place their servers close to the exchange’s systems, reducing delays even further. In the beginning, algo trading was limited to big institutions like mutual funds, hedge funds, and proprietary trading desks. By 2012, SEBI released its first set of guidelines for algo trading, focusing on managing risks and preventing market manipulation.\n\nIn recent years, algo trading has moved beyond institutions. Brokers started offering APIs, which allowed tech-savvy retail traders to connect their own algorithms to trading systems. Platforms also emerged, making it easier for retail investors to create and test algo strategies, even without coding skills.\n\nIn 2021, SEBI released a consultation paper to address the growing retail interest in algo trading and the risks from unregulated platforms. The paper proposed that all algos be pre-approved by exchanges and placed the responsibility of compliance on brokers. It was one of SEBI’s first major steps to regulate algo trading for retail investors.",
    "title": "SEBI has something to say about algo trading",
    "articleUrl": "https://thedailybrief.zerodha.com/p/sebi-has-something-to-say-about-algo",
    "date": ""
  },
  {
    "learning": "Once a match is found, the securities are credited to the buyer’s account, and the funds from the buyer are transferred to the seller. While the intermediary role played by the platform ensures the transaction is completed, it also means the platform temporarily holds the securities and funds, which introduces an additional layer of risk and reliance on the platform's integrity. Another significant concern with transacting in unlisted securities is price volatility .\n\nA striking example is Reliance Retail. In 2023, its unlisted share price experienced a dramatic crash, dropping overnight from ₹2,500–₹2,700 levels to ₹1,362. This sudden plunge occurred after Reliance, during a board meeting, decided to cancel all public shares and compensate shareholders at a fixed rate of ₹1,362 per share.\n\nThe decision blindsided many retail investors, who were understandably outraged by the steep markdown in value. However, given the unregulated nature of such platforms, there was little they could do to seek recourse, leaving them to bear the brunt of the decision. And this isn’t an isolated incident.\n\nIn 2022, the logistic company - Delhivery’s unlisted share price dropped nearly 35%—from ₹750 to ₹487—after the company set its IPO price band between ₹462 and ₹487. So, while the idea of getting in early on unlisted securities can be tempting, tread carefully. The unlisted market is lucrative but unregulated, and risks abound.\n\nThe future of these platforms remains uncertain. Will they continue to operate as they have been, or will SEBI eventually take action to shut them down or regulate their activities? For now, SEBI has limited itself to issuing a cautionary advisory, warning investors against engaging in investment or trading activities through unregistered web applications or electronic platforms.",
    "title": "Before you invest in unlisted shares, read this!",
    "articleUrl": "https://thedailybrief.zerodha.com/p/before-you-invest-in-unlisted-shares",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "Source: Kotak Mutual Fund Over the past four years, India’s market capitalization and corporate profits have grown significantly. This naturally raises questions: Are the markets overvalued? Are current valuations justified? And how sustainable is this trend in the long run?' Source: Kotak Mutual Fund The number of overvalued stocks in the BSE 500 index has more than doubled, rising from 79 in January 2020 to 181 in December 2024.\n\nThis significant increase highlights the growing valuations in the Indian stock market over the past few years. Source: Kotak Mutual Fund At the sectoral level, Consumer Durables, Infrastructure, Telecom, and Capital Goods are trading significantly above their historical valuations. Source: Kotak Mutual Fund On the other hand, sectors like Private Banks and Automobiles are trading below their historical valuations and have been doing so for an extended period.\n\nSo whether something is overvalued or undervalued, it can remain in that state for a prolonged duration, often defying expectations. Source: Kotak Mutual Fund Despite concerns about overvaluation, India’s equity market has some distinct strengths. One standout factor is the consistently high return on equity (ROE).\n\nAbout one-third of Indian companies boast an ROE of over 20%, making India one of the most ROE-driven markets globally. For some perspective, India’s 10-year average ROE is 14%, outperforming peers like Mexico (13%) and China (12%). On top of that, India’s market risk is relatively low. The 1-year rolling beta of MSCI India against MSCI Emerging Markets has been on a downward trend, signaling reduced volatility and lower risk compared to other emerging markets.\n\nThese factors make India’s equity landscape particularly appealing for long-term investors. Source: Kotak Mutual Fund Now, let’s dive into the global economic forecasts. The Economist Intelligence Unit (EIU) expects global GDP growth to stay moderate at 2.6% in 2025, the same as in 2024. In the United States, growth is projected to ease to 1.7% in 2025, reflecting a broader slowdown.",
    "title": "What’s in store for the global economy in 2025?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/whats-in-store-for-the-global-economy",
    "date": "October 26, 2025"
  },
  {
    "learning": "oposal as \"a joke\" and accused Azerbaijan’s presidency of \"stage-managing\" the talks to favor developed countries. In a sharply worded statement, India said: \"This has been stage-managed, and we are extremely disappointed.\" India believes this $300 billion commitment—just like the $100 billion pledge before it—isn’t a serious plan to tackle climate change. To India, it’s nothing more than a band-aid.\n\nOfficials pointed out that India’s own climate goals require at least $2.5 trillion by 2030— roughly $250 billion annually. Energy Transition: India’s goal of 500 GW of non-fossil fuel capacity by 2030 demands massive investments in solar, wind, and the infrastructure to support these systems. Adaptation: As one of the most climate-vulnerable countries, India has to prepare for floods, droughts, and heat waves, which are expected to worsen in the future.\n\nBuilding resilient infrastructure comes with a hefty price tag. Coal Dependency: Half of India’s electricity still comes from coal. Transitioning to renewable energy while ensuring a stable energy supply is a monumental challenge. When just one country like India requires such enormous funding, the $300 billion global proposal falls drastically short for all developing nations combined.\n\nTo make things worse, much of this funding would come as private financing, especially loans, which developing countries would eventually have to repay. This shifts the financial burden onto them instead of offering real support through grants. Another major sticking point at COP29 was the debate over fossil fuels.\n\nShould the world commit to phasing them out entirely—stopping the use of coal, oil, and gas—or settle for phasing them down, simply reducing their use over time? The controversy hit a boiling point when Saudi Arabia was accused of editing official negotiation texts. Normally, these documents are shared as non-editable PDFs to ensure transparency and fairness.",
    "title": "India rejects $300 Billion climate deal",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-rejects-300-billion-climate",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "are areas where FIIs had significant investments. But despite the heavy selling by foreign investors, the Indian market hasn’t collapsed. If you’re wondering why, it’s because Domestic Institutional Investors (DIIs)—which include mutual funds, insurance companies, and pension funds—have stepped in to buy shares.\n\nIn October 2024, DIIs purchased stocks worth ₹83,271 crore, more than covering the amount sold by FIIs. This strong domestic buying has helped stabilize the market and prevent a major downturn. Retail investors, who invest through SIPs (Systematic Investment Plans), have also played a key role. SIPs have been steadily growing, averaging around ₹22,321 crore per month.\n\nThis shows that domestic investors still believe in the long-term potential of the Indian market, even as FIIs pull out. Despite the current sell-off, many analysts remain optimistic about India’s long-term growth story. The fact that domestic investors are buying during this period of foreign selling reflects strong confidence in India’s future.\n\nGovernment initiatives like the Production Linked Incentive (PLI) scheme are expected to further boost the economy, potentially making India an attractive destination for investments over time. Looking back at history, the Indian stock market has bounced back from large FII sell-offs before. For example, after the Global Financial Crisis in 2008, the market fell sharply but recovered by over 127% within just 12 months.\n\nSimilarly, after the COVID-19 crash in 2020, the market rallied significantly. So, while the Indian market may remain volatile in the short term, the outlook for the long term is more hopeful, with expectations for a recovery down the line. We discussed what’s driving foreign investment flows out of India with Sahil Kapoor, Head of Products and Market Strategist at DSP Mutual Fund, in this episode of The Big Perspective.",
    "title": "₹82,000 Crore Gone! Why Foreign Investors Are Ditching Indian Markets",
    "articleUrl": "https://thedailybrief.zerodha.com/p/82000-crore-gone-why-foreign-investors",
    "date": ""
  },
  {
    "learning": "disruptive entry in 2016, offering ultra-low-cost 4G data plans. Fast forward to today, and Vodafone's market share has plummeted to less than 20%, all thanks to Jio. Source: Tijori After years of intense competition and massive investments in infrastructure, particularly in 5G networks, telecom operators are now focusing on profitability.\n\nJio recently led the way in increasing tariffs, with Vodafone and Airtel quickly following suit, signalling an industry-wide shift towards boosting Average Revenue Per User (ARPU). Last month, rating agency CRISIL projected that the ARPU for the industry is set to rise to ₹225 from the current ₹182. Higher ARPUs are crucial for recovering and sustaining the massive investments required for expanding and upgrading network infrastructure, especially as India races to roll out 5G services nationwide.\n\nJio has transformed from a disruptive telecom upstart to a comprehensive digital services provider, with ambitions that extend far beyond traditional telecom services.\n\nThe company completed India's fastest 5G rollout, with 130 million 5G users already. Recent tariff increases aim to boost average revenue per user, a key metric for telecom profitability. Jio is expanding beyond mobile services into home broadband and business solutions. The introduction of JioBrain signals Jio's ambition to be a leader in AI services, not just a network provider.\n\nNew Energy As the world moves away from fossil fuels towards more sustainable energy sources, Reliance is positioning itself to not be left behind. With a global push for cleaner, renewable energy, Reliance—a giant in oil and petrochemicals—is making a bold move into the renewable energy sector. Adani, another major Indian conglomerate, has already established a significant presence in solar and wind energy.",
    "title": "Reliance Industries is trying to transform itself",
    "articleUrl": "https://thedailybrief.zerodha.com/p/reliance-industries-is-trying-to",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "The catalyst for this discussion was an edition we published on Thursday , focusing on the recent developments in the oil markets. China, a key player in global economics, has been causing a significant decline in oil demand. In short, oil demand is falling globally because the Chinese economy is in bad shape.\n\nEven if you've only been following the news from a distance, you might already know that China’s economy has been struggling for a while. But what’s less understood is why it’s in such a state, how China became the powerhouse we know, and what’s causing its current domestic problems. A historical context To grasp what’s happening in China today, we need to step back in time to the 1980s, when China’s economic reform journey began.\n\nBack then, China and India were roughly at the same economic level. For context, India's per capita GDP was about $380, and China’s was around $430—a negligible difference. However, what followed in China was nothing short of spectacular. From the 1980s onwards, China’s economy grew at an average rate of 10%.\n\nThis unprecedented growth, often termed the “Chinese Miracle,” has no close comparison in modern economic history. Sustaining a 10% growth rate for 20 to 30 years transformed China into the world’s second-largest economy by GDP, all within a brief period from the 1980s to around 2010. Source: OurWorldInData The investment-led growth model China’s economic rise was driven by what is known as an investment-led growth model.\n\nThis model isn’t unique to China; it has roots in the Soviet Union, pre-World War I Germany, and was later adopted by countries like South Korea, Japan, and the Asian Tigers. The model involves two key components: massive investment and the suppression of household consumption. China poured immense amounts of money into building an industrial base, a real estate sector, and infrastructure that didn’t previously exist.",
    "title": "Weekly Brief: China's economic history, the early August panic, and are India...",
    "articleUrl": "https://thedailybrief.zerodha.com/p/weekly-brief-chinas-economic-history",
    "date": "October 26, 2025"
  },
  {
    "learning": "or not taxed, but the rest of the sectors increasingly are being sought to be taxed.\" The shortage of skilled workers is due to multiple factors. Workers are heading to the Middle East for better pay, and this year's severe heatwave in India also hindered construction work, with workers unable to work during large parts of the day. Lastly, L&T is diversifying its business, focusing on sustainability and renewable energy projects.\n\nThey are venturing into nuclear energy, green hydrogen, and solar projects. This move aligns with the broader theme of green transitions. Due to climate change, countries will be compelled to invest in renewables like solar and wind, and clean energy sources like nuclear, to reduce carbon emissions. L&T is positioning itself to play a significant role as this massive transition unfolds.\n\nSo, while we aren't focusing on their profit numbers, L&T’s latest trends provide a fascinating glimpse into broader economic and industry shifts. In a previous episode, we talked about Reliance bringing the fast fashion giant Shein’s products into India and touched on the 2020 ban on Chinese apps. Remember when the Indian government banned several Chinese apps back in 2020?\n\nSince then, all Chinese companies have needed government approval to enter India or make any investments. But it looks like India wants to go back to the pre-COVID relationship with China. The Economist recently published an interesting story about how the India-China relationship might be heading toward some sort of normalcy.\n\nIndia and China have had a rocky relationship since their border clash in 2020, but things seem to be improving. While India still wants China to resolve the border issue, it also needs Chinese technology and investments to boost its industries. Despite the push to make everything in India, there are some things that we just can't manufacture at home.",
    "title": "India China, bhai bhai…again!",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-china-bhai-bhaiagain",
    "date": "October 26, 2025"
  }
]