[
  {
    "learning": "It is, at one level, an exercise in accountability ; where the government puts its finances forward, giving the country an opportunity to take a long, hard look at how our money is being managed. It is also a constitutional exercise, where the government asks the parliament’s permission on how it plans to raise money, and spend it. To that end, it is a strategic presentation; the government indicates what its priorities are, what it will commit money to, and how that money could help achieve those priorities. All of this is wrapped in a public communication exercise; the budget is the most important public statement on the government’s economic performance, goals, and plans.\n\nAt The Daily Brief , we wanted to look at the budget in three ways. To begin with, in our minds, you can only understand a budget within a wider framework — of how money moves through the system . To that end, we begin by digging into the public accounts themselves. Next, we look at how the government is changing its taxing decisions, and by extension, the incentives of everyone in the economy. Finally, we wanted to leave you with what are, to us, the most consequential policy changes that the government has signalled.\n\nThis budget comes in a trying time, at a moment when the global economy is fraying. That’s why it is trying to do three things at once. One, it is trying to keep capital spending going — making enough future-oriented investments for our economy to maintain its upwards trajectory. At the same time, it’s trying to slowly bring down how much India borrows. And finally, it wants to have the flexibility to spend more if the moment calls for it.\n\nHow realistic does this agenda seem? How do we get there? To answer that, let’s take a tour through the government’s accounts.\n\nA government is funded, first and foremost, by its taxpayers. This is its financial backbone ; the most durable source of its funding. Ideally, this taxpayer money should anchor the lion’s share of its spending.\n\nIn the coming year, the government targets over ₹44 lakh crore in taxes. Meeting this target, however, is easier said than done. Last year, its targets were lower, at ₹42.7 lakh crore. In reality, though, it will probably fall short of that target by just under ₹2 lakh crore. That isn’t an insignificant sum — it’s a shortfall of over 4.5%.",
    "title": "Everything you need to know about the budget",
    "articleUrl": "https://thedailybrief.zerodha.com/p/everything-you-need-to-know-about-b93",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "We sat down with Deepak Shenoy, CEO of Capitalmind , to not ask about “what to expect from the budget” but to understand how to read and make sense of the budget. Instead of predictions and market guesses, the focus was on building a clearer framework for thinking about budgets and government policy.\n\nHe explains why the Union Budget is often overhyped and why it doesn’t have the same importance today as it did in the past. He breaks down what a budget really is at its core—how the government plans its spending, where the money comes from, and how gaps are financed. He also shares why headlines and budget speeches can be misleading and why the real insights lie deeper in the budget documents.\n\nThe discussion goes into what actually matters for investors and citizens alike. Deepak talks about how to spot meaningful policy changes, understand long-term spending direction, and separate symbolic announcements from decisions that can truly impact the economy over time. He also touches on areas where India needs stronger policy thinking, such as infrastructure, logistics, agriculture, and capital markets.\n\nA large part of the conversation focuses on common mistakes people make on budget day. Deepak explains why reacting to market moves during the budget can be risky, especially when liquidity is low and price signals are unreliable. He shares practical advice on staying calm, avoiding knee-jerk trades, and thinking beyond a single day or headline.",
    "title": "Deepak Shenoy on how to think about the budget",
    "articleUrl": "https://thedailybrief.zerodha.com/p/deepak-shenoy-on-how-to-think-about",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "Today, I’ll start by talking about cement. UltraTech’s results came out last week, and the management sounded extremely bullish about the economy. I wanted to understand why. What I found was a larger story about public infrastructure and private capex — and the gap between them.\n\n“Let me get to the core topic for discussion: demand. That is the most important aspect of our business. Everything else becomes secondary and falls in line.”\n\nFor the next several minutes, he proceeded to lay out an exhaustive, region-by-region catalogue of infrastructure projects across India. Punjab is spending Rs 16,000 crores on road development. Delhi Metro is announcing new corridors worth Rs 12,000 crores. And, the list went on.\n\nBut he wasn’t just listing projects for effect. He was making a specific argument about what these projects mean for cement demand. Elevated metros for example require 11,000 metric tons per kilometer. So, when you read that a city is adding 80 kilometers of elevated metro track, that’s potentially 880,000 tons of cement.\n\n“As we see the progress, government’s focus on infrastructure is translating into a robust pipeline of new projects nationwide, with several marquee investments announced across every region, translating into solid demand.”\n\nGovernment’s focus on infrastructure. Remember this point. I’ll come back to it.",
    "title": "Why private capex in India is still not picking up? | Who said what? S2E28",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-private-capex-in-india-is-still",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "On one hand, the United States is playing bullyball, slapping 50% tariffs on many Indian goods. Europe, meanwhile, has been threatened with additional levies if they don’t meet Trump’s demands on Greenland. At Davos recently, US officials openly berated the European economy. All of this has left the Europeans disillusioned with their long-standing ally.\n\nOn the other side lies China. With how it weaponises global trade, both entities find China too unreliable a trade partner. The EU is worried about Chinese goods evaporating their industry. Our own relationship with China is colored by a long history of conflict.\n\nIn this context, more than ever before, hedging against the great powers is something India and Europe now see eye-to-eye on. In fact, Europe views us as perhaps the only significantly-sized alternative to China .\n\nBut India-EU ties haven’t always been smooth. Negotiations for an India-EU trade deal began nearly 20 years ago, but stayed in limbo due to differences they couldn’t settle. So, how did two sides finally find common ground this time?\n\nThe composition of trade reflects each side’s strengths. As a whole, the EU is India’s largest importer currently, making up 17% of India’s total exports to the world. India ships textiles, apparel, chemicals, petroleum products, medicines and gems to Europe. Many of these are labor-intensive manufacturing goods, but we also export plenty of services (like IT, consulting, etc) to the EU.\n\nHere’s the problem: India is only the EU’s 9th-largest trading partner , accounting for just 2.4% of the bloc’s exports. Compare that to the US at 17% or China at 15% . For a country as big as ours, India has punched well below its weight in European markets. The same is true of European firms in India.",
    "title": "India, Europe, and the art of the deal",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-europe-and-the-art-of-the-deal",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "Well, copper’s best trait is that it carries electricity very efficiently, while not corroding easily. It’s effective and long-lasting, which is perhaps why it’s used in every modern electrical appliance today, from a light to a toaster to a smartphone.\n\nBut beyond that, copper has also become a foundational metal for many new technologies: like EVs, wind turbines, solar panels, power grids, data centres, and so on. An EV, for instance, uses a whopping 80-90 kg of copper on average: 4 times that of a normal car.\n\nEvery country in the world is trying to electrify transport, decarbonise power, and digitise its economy, which ends up demanding more copper. There is no easy substitute for it. Some make the argument that aluminium can replace copper, but that’s difficult. In high-performance electrical systems, where efficiency and heat resistance matter, aluminium can’t do what copper can. Silver might be the best alternative to it, but it is too expensive for everyday use. On top of that, silver prices are having their own moment anyway.\n\nThis insatiable demand for copper shows up in its sky-high prices. The global benchmark price for copper is set on the London Metal Exchange, commonly referred to as LME copper. Over the past year, copper prices have risen sharply and even crossed the $13,000 per tonne mark. As of January 23, prices hover around $12,800 per tonne, levels that were once considered extreme.\n\nCopper is usually spread thinly through vast quantities of ore. The concentration of copper in this rock is known as the ore grade. Decades ago, some of the world’s best copper mines operated at ore grades of 1.5% or higher. That meant 1.5 kilograms of copper for every 100 kilograms of rock. Today, many new mines operate at grades closer to 0.6% or even lower. Far more rock has to be dug up and processed to extract the same amount of copper.\n\nWhen a copper deposit is discovered, the richest and most concentrated parts of the ore body are usually closest to the surface and easiest to access. These high-grade zones are mined first because they deliver more copper with less effort. Over time, those zones get depleted, which is why new ore grades are declining in copper material. The deeper you go, it seems, the lower the copper concentration gets.",
    "title": "The world hunts for copper",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-world-hunts-for-copper",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "This past week, the World Economic Forum held its annual conference at Davos. It is a gathering of some of the most powerful people in the world — heads of state, economists, billionaire entrepreneurs, and so on.\n\nIt’s the most exclusive of exclusive gatherings, full of meetings, private dinners, and, well, partying . Here, people have to be very nice to each other, no matter what. But, in such a situation, what they say to each other might have more meaning than what’s on the surface. In fact, FT came up with a pretty funny list of how the code of Davos speech works:\n\nHowever, this year, Davos didn’t really have many of these niceties. In fact, it was extremely blunt. World leaders were being brutally honest about their needs and wants — even going as far as berating other leaders.\n\nIn particular, many implicitly voiced how uncertain they were about the US being a reliable partner or ally. Of late, under the Trump administration, the US has been trying to shore up manufacturing within its own borders. For them, globalization is now a mistake.\n\nAs the US retreats from worldwide economic integration, so are other nations. They are all prioritizing indigenizing supply chains and reducing dependence on other countries, even if it’s not economically efficient to do so . It’s clear that on a global level, trust is broken.\n\nTo start with, let’s take Howard Lutnick, the US Secretary of Commerce. On a Davos panel, Lutnick went on a rant against Europe’s energy ambitions to go net-zero. Here’s what he said:",
    "title": "Some interesting things were said at Davos | Who said what? S2E27",
    "articleUrl": "https://thedailybrief.zerodha.com/p/some-interesting-things-were-said",
    "date": ""
  },
  {
    "learning": "India’s quick service restaurant, or ‘QSR’, sector hasn’t been doing too well. Over the last few years, most QSR companies have posted net losses, while their per-store sales have been falling. This seems like a bad time to be in the fast food business.\n\nThere’s a new development that confirms the industry’s tepid state — Sapphire Foods and Devyani International, two of India’s largest QSR companies, are merging . With this deal, Sapphire Foods shall no longer exist as a standalone listed company. It will be folded into Devyani International, and Sapphire’s shareholders will be issued shares of Devyani instead.\n\nOn paper, it looks like just another consolidation in India’s QSR space. But to us, this merger looks very different from how mergers usually work. That difference is what we want to explore today.\n\nBoth Devyani International and Sapphire Foods are, in a sense, mirror images of each other. They both operate most Indian franchises of Yum! Brands — the global company that owns KFC, Pizza Hut, Taco Bell, and a few other famous fast-food chains. Yum! licenses its brands and know-how to the two companies. These companies take care of the actual day-to-day management — running stores, hiring employees, paying rent, sourcing ingredients (within strict rules), and executing everything on the ground.\n\nThe two companies share a unique relationship. They are, on paper, competitors. But their businesses are, in a sense, identical. They both run the same brands. And their operations, to a great extent, match those of each other.\n\nThe only major differentiator, perhaps, is that they both operate in different territories. Devyani has historically been stronger in the north and east of India. Sapphire has focused on the south and west.",
    "title": "Can two struggling businesses make a strong one together?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/can-two-struggling-businesses-make",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nFor anyone tracking food delivery or quick commerce in India, the past couple of years have started to feel repetitive. Blinkit and the likes keep talking about improving unit economics and focusing on margins and sustainability growth, and occasionally even report profits. And then, there are new funding rounds announced, and just as quickly, the discounts return and losses widen again.\n\nThat question is why something that happened recently in China is worth paying attention to. Earlier this month, Meituan, China’s largest food delivery and instant commerce company, reported its first quarterly loss since 2022 . The company’s management described the year 2025 as “an expensive year ” , a reference to the sheer amount of money being spent to defend its position.\n\nNow, on its own, a loss-making quarter at a Chinese tech company is not remarkable. What makes this interesting is who Meituan is, why the losses happened, and what that tells us about how this industry behaves once competition really kicks in. It might sound a little like how it is here in India.\n\nMeituan is best understood not just as a food delivery app, but like a super app that houses everything that has to do with local consumption, whether it’s groceries,meds, hotel booking, rides, and whatnot.\n\nAt its core, Meituan connects nearby demand with nearby supply and moves things across short distances very efficiently. Food delivery mattered because people order food frequently, and that frequency helped Meituan build dense rider networks and daily habits. Once that infrastructure existed, adding other categories became much easier.",
    "title": "Lessons from China’s delivery war | Who said What? S2E24",
    "articleUrl": "https://thedailybrief.zerodha.com/p/lessons-from-chinas-delivery-war",
    "date": ""
  },
  {
    "learning": "From December 26 to December 31, we won’t be running editions of The Daily Brief. Instead, however, we’ll introduce you to the people who run our writing room: those whose words you read here every day.\n\nOf course, India, the fastest-growing major economy in the world, is an attractive playground for global capital right now. Indian banks and lenders are benefiting from rapid digital adoption, pro-growth government policies, and a stable regulatory framework. That also explains large deals in this sector for the year. Japanese megabanks have openly voiced their enthusiasm towards this too.\n\nHowever, the India story is only one part of the equation . The surge of Japanese money into India is also a broader symptom of a transformation happening in Tokyo. While you might be familiar with the Indian leg of these stories, let’s dive into what’s happening in Japan’s domestic market and corporate culture.\n\nIn mid-2022, roughly 43% of all companies on the Tokyo Stock Exchange’s (TSE) top tier  traded below 1.0 times book value (P/B). That effectively means that investors think its management is actively destroying the assets it holds — and so, each dollar retained in the business is valued at less than a dollar . In other words, if you immediately tore those companies apart and sold them for parts, you could probably make more money than their respective managements were bringing in.\n\nThis is not normal. In the U.S., for instance, only about 5% of S&P 500 companies traded below book value in that period. Japan’s chronic undervaluation signaled a “ Japan Discount ” . It was an existential issue for Tokyo’s market attractiveness.\n\nWhy were Japanese stocks stuck in this rut? A big reason was capital inefficiency . Profits piled up on balance sheets rather than being reinvested or returned to investors. They simply couldn’t seem to find attractive avenues to deploy that capital. Many firms had low Return on Equity (ROE) – they weren’t generating enough profit relative to all the capital they held. This gave them lower valuations.",
    "title": "Indian banks court some suitors from Japan",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indian-banks-court-some-suitors-from",
    "date": ""
  },
  {
    "learning": "In the first part of the 2026 outlook, the focus was on the overall macro mood and how AI is starting to change the physical economy. The next part zooms out and looks at how kthe world is adjusting underneath—how trade is being rerouted, why governments are running bigger deficits, and why different regions are starting to look less alike.\n\nIf you only look at the headlines, it feels like globalization is going backwards. Tariffs are rising, trade wars are back, and every country wants products stamped “Made in X.” But when you look through the big global outlook reports, they’re all saying something slightly different. Trade isn’t falling apart. It’s changing how it works.\n\nMorningstar’s outlook captures this mood by calling the moment “Global Trade in Turmoil.” US tariffs are clearly higher than they were before 2018. But for most major trading partners, they still sit below 10%. That’s a real shift, but it’s a long way from the kind of shutdown the world saw in the 1930s. The bigger change isn’t how high tariffs are. It’s where their impact is showing up.\n\nThe clearest break is in trade between the US and China. A few years ago, the US took nearly one-fifth of China’s exports. That share has steadily fallen—from around 18–19% in 2017–18 to about 14–15% in 2024, and closer to 11–12% in 2025.\n\nGoldman Sachs helps put numbers around this shift. In their 2026 Outlook , they estimate that US tariffs now amount to about 18%, the highest burden on American consumers since 1934. Even so, they don’t expect global trade to collapse. Companies have adjusted instead. They’ve shifted supply chains, sourced from more places, and raised prices where possible. So far, many have managed to protect margins despite the policy swings.\n\nOther reports describe the same shift in different ways. JPMorgan calls it a move from globalization to fragmentation, driven by tariffs, technology controls, and geopolitics. Goldman talks about a new trade order, where companies worry less about being the cheapest and more about keeping supply chains secure.",
    "title": "Outlook 2026 - Part 2: Trade, government, and growth",
    "articleUrl": "https://thedailybrief.zerodha.com/p/outlook-2026-part-2-trade-government",
    "date": "October 26, 2025"
  },
  {
    "learning": "Just a quick heads-up before we dive in. The Wakefit IPO is open now. We wrote about them earlier — you can read the full story on Wakefit here .\n\nThese were “world scale” incidents, but they were borne out of something painfully ordinary. In both cases, a single, little-known company called Cloudflare made a minor update — the first time , because it was modifying some permissions for its database systems, and the second , because of a tiny bug that had been around for years, but had never acted up before. Both were enough to strangle much of the internet.\n\nHow did tiny failures inside one company infect so much of the world? To understand that, you need to understand why the internet, today, is fundamentally different from the “web” it began as — and how this is creating single points of failure .\n\nMost people — at least most non-engineers — who think they understand the internet are working off an outdated idea. They see the internet as a decentralised, formless cloud — a web — with innumerable computers, including your own, that talk to each other through infinite pathways.\n\nThat may be true of the core technology beneath the internet. But as it has grown, layers have been built on top of it all, which behave very differently. The internet is no longer a flat mesh that directly connects the world’s computers together. Instead, it is slowly centralising . A new hierarchy is coming into being. At the heart of the internet, there is, now, a small cadre of infrastructure providers who manage, route, and secure most of its traffic. These now make up a meta-layer that most of the internet is wrapped within.\n\nOne of the most critical of these is Cloudflare. While Cloudflare is a private company, it is best understood as a global utility — it is to the internet what a grid operator is to our electrical systems.",
    "title": "When Cloudflare sneezes, the internet catches a cold",
    "articleUrl": "https://thedailybrief.zerodha.com/p/when-cloudflare-sneezes-the-internet",
    "date": ""
  },
  {
    "learning": "Today, we complete one year of Who Said What?. We started this show as an extension of The Daily Brief because we kept coming across fascinating comments from business and finance leaders that deserved more room than we had there. Thank you for watching every Saturday and helping me keep my job.\n\n“The risk is that if the targets become unscientific and unjust, Then, just to meet CAFE-3 regulation, a small car -- which produces a very low absolute carbon dioxide -- will have to be discontinued.”\n\nFor a company that more or less built the Indian small-car market to say, out loud, that a new policy might force it to kill small cars is a very big deal. Now, the obvious question is, why would he say this?\n\nLet me give context on what CAFE norms are. See, whenever a petrol or diesel engine runs, it burns fuel and produces carbon dioxide. You can improve the engine, you can make the car lighter, you can tweak the gearbox, but as long as you are burning fuel, CO₂ comes out of the exhaust. A small hatchback burns less per kilometre than an SUV, but both burn something. An electric car is the only one with zero CO₂ at the tailpipe because there’s no combustion happening in the car at all.\n\nCAFE stands for Corporate Average Fuel Efficiency. It doesn’t look at one car. It looks at all the new cars a company sells in a year and calculates the average CO₂ emissions across that entire fleet.\n\nSome cars will be gas-guzzlers, others will be efficient. What matters is where the company lands overall. So if a carmaker sells a bunch of big SUVs that spew out a lot of CO₂, they need to balance that out by selling enough smaller, cleaner cars – or EVs – to bring their average down.",
    "title": "Why CAFE-3 has carmakers worried... and Why AI can’t replace humans yet | Who said what? S2E23",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-cafe-3-has-carmakers-worried",
    "date": "October 26, 2025"
  },
  {
    "learning": "Just a quick heads-up before we dive in. The Meesho IPO is open now. We wrote about them earlier — you can read the full story on Meesho here .\n\nWhen Wakefit began in 2016, it was a mattress brand that only ran online. It would sell Indians comfortable memory‑foam mattresses, without middlemen. The product was so good, the promise went, that Wakefit would let you return your mattress if you didn’t like it in the first 100 days.\n\nToday, the company is on the verge of its IPO. But the business is meaningfully  different from what it was back in 2016. For one, it is slowly growing into a “ full home solutions ” brand, selling everything from sofas to yoga mats. Two, in its quest for growth, it is becoming a more conventional, offline brand with large showrooms across big cities. Most of the n ew money it’s raising is actually meant to fund its offline expansion.\n\nThese changes are probably paying off. In the recent past, the company has grown its revenue at roughly 25% a year. Over the last half-year, it even turned its first profit.\n\nBut what are you really getting, if you buy a piece of this company? Should you see it as a new-age, digital-first business with explosive potential? Or is it closer to a traditional, physical business — one that earns on its mastery of operations and logistics rather than its innovation chops?\n\nIndia’s home furnishings market is growing at a healthy pace of 11-13% a year. It isn’t an easy market to dominate, either. People only buy a new bed or mattress so often, leaving little room for loyal, repeat customers. When they do make these purchases, the sheer cost makes them care more about prices  than brands.",
    "title": "The Wakefit IPO: new dog, old tricks?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-wakefit-ipo-new-dog-old-tricks",
    "date": ""
  },
  {
    "learning": "We at Markets often decide our stories based on recent triggers, like a new policy, or earnings call, or a recent report, at the very least. Today’s story is different. A couple of mornings ago, we found ourselves talking about amusement parks — reminiscing about school picnics and summer days at water parks.\n\nAs we spoke, the questions started piling up. These are all businesses , after all. How do they actually make money? Why do so few of them scale? And why does a country of 1.4 billion still not have anything close to Disneyland?\n\nThe more we dug, the more complex the picture got. While visiting an amusement park is one of the most fun, carefree things you can do, running it is anything but. Behind the rides and the wave pools is a seasonal, operationally brutal, capex-heavy business — which is hard to put together, hard to maintain, and hard to stay relevant in.\n\nTo build an amusement park, you start with land—a nice, big parcel that you’re likely to find just outside the city border. Once the land is secured, the spending begins. Concrete foundations, power infrastructure, water filtration plants, restaurants, locker rooms, maintenance sheds, staff housing, and, of course, the rides themselves. A single new park can easily absorb ₹400–700 crores of capex . Even then, the business needs 7-10 years just to recover the investment.\n\nIronically, the rides are the least Indian part of it all. India doesn’t really manufacture serious, high-thrill machines like roller coasters, drop towers and giant pendulum rides. While some (like Wonderla) do make simple rides in-house, the best attractions are imported from companies in Europe, North America, and Turkey. They come with decades of safety data, metallurgical precision and control systems that Indian OEMs don’t yet have.\n\nAmusement parks are an incredibly seasonal business . Monsoons shut or slow down rides and keep people home. Winters are better in some cities, while worse in others. They work on just a handful of very good months and maybe a few average ones, while in the rest, they hope for the rains to stop.",
    "title": "The economics of amusement",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-economics-of-amusement",
    "date": ""
  },
  {
    "learning": "When people in investing circles talk about healthcare, the conversation almost always gravitates to two giant segments: pharma services and hospitals. It makes sense too; the two swallow the bulk of India’s medical spending. But there’s a third space — smaller, and far less glamorous — but one that sits at the heart of the entire system: diagnostics.\n\nDiagnostics makes up less than 10% of India’s total healthcare spending . That’s tiny on paper. At the same time, though, diagnostics has been one of the most lucrative wealth-creation stories in Indian healthcare. Companies from the sector — like Dr. Lal PathLabs, Metropolis, and Vijaya Diagnostic — have built businesses worth tens of thousands of crores. The industry’s EBITDA margins have hovered around 25–27% , which is unheard of in most of healthcare. And the industry is growing steadily. CareEdge pegs diagnostics at a ~12% CAGR , heading toward a $15–16 billion market over the next few years.\n\nPeople often lump diagnostics into the same bucket as hospitals — but the two businesses couldn’t be more different. A diagnostic company doesn’t treat you. It doesn’t operate ICUs, admit patients, or perform surgeries. It has a single focus: running tests . Diagnostics companies trade in information .\n\nFirst, pathology . These are tests on blood, urine, tissues — your regular CBC, blood sugar, vitamin levels, and the like. These everyday use cases are the industry’s “bread-and-butter”, and it’s where they get the most volumes.\n\nSecond, radiology & imaging — which includes X-rays, ultrasounds, CT scans, and MRIs. This isn’t a high-value business, either. Vijaya Diagnostics focuses heavily on this market, building a deep imaging-heavy model unlike its pathology-focused peers.\n\nThird, advanced and specialized testing . This is the high-skill, high-margin end of the industry — with a focus on genetics, cancer markers, molecular diagnostics, hormonal tests, and more. CareEdge noted that genomic testing, in particular, is now one of the fastest-growing areas in diagnostics, consistently clocking double-digit growth and offering superior profitability. It requires very specialized machines and brings small volumes, but the margins are incredible. Dr. Lal and Metropolis keep highlighting this segment in their earnings.",
    "title": "Diagnosing the Diagnostic Business",
    "articleUrl": "https://thedailybrief.zerodha.com/p/diagnosing-the-diagnostic-business",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "Over the last few quarters, Maruti has been saying that something is off in the middle of the Indian economy. They kept repeating that the entry segment was not growing, that first-time buyers were missing, that small cars had basically stopped moving. We even did a Who Said What episode along those lines.\n\n“To buy a car costing 10 lakh plus, you normally would need to be in this household bracket of 12 lakh plus.“Car buying in India is largely restricted to this 12% of households. “How can you get high growth if 88% of the country are below levels of income where they cannot afford these cars costing 10 lakhs and above?”\n\nThis quote wasn’t a rant as much as it was a recognition of a key economic fact about India. That is, our lower-middle and middle-middle households, who normally power the first-car and small-car market, simply didn’t feel confident enough to stretch anymore. Let us rephrase it this way: the chairman of the country’s largest automaker says that the market is effectively resting on a very narrow top of the income pyramid . And sadly, there’s no other source of long-term demand.\n\nYou see, how we buy cars says a lot about our economy as a whole. Families only commit to buying them when they believe life over the next few years won’t surprise them in a bad way. Things like EMIs, fuel, school fees, rent, groceries — all of it must be stable enough before deciding to buy a car, which is already a depreciating asset. That’s why Maruti’s warnings about the entry segment felt heavy.\n\nBut this quarter, after two whole years, Maruti started to narrate a different, more optimistic story. Let’s dive into how Maruti Suzuki has performed this quarter — and how, conversely, Tata Motors hasn’t.\n\nHow did revenue grow so much when volumes didn’t? It turns out that the overall quarter still occupied a pretty sizable share of higher-priced models and strong exports, as opposed to small cars which yield lower realizations per car. Exports, for instance, jumped more than 42% to 1.10 lakh cars.",
    "title": "India’s biggest carmakers switch gears — both up and down",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indias-biggest-carmakers-switch-gears",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nOla’s latest results had a line that changes the way you read everything that follows. The company said the electric two-wheeler industry has been “largely flat for the last two to three quarters,” and used that to explain why it hasn’t been chasing volume. Instead, they said, they’ve taken “the opposite approach,” focusing on cost discipline and margin improvement.\n\nOn paper, the margin story looks strong. Ola reported a 30.7% gross margin — and even added that this is “much better than many internal combustion engine companies.” But a margin number never speaks for itself. You have to place it next to what the company is doing with volumes, how it is revising expectations, and what competitors in the same market are experiencing.\n\nBecause in the same quarter, Ola calls the industry flat, Ather described its own performance as one of its strongest ever. They sold around 66,000 vehicles in Q2, a 67% jump year-on-year and 42% quarter-on-quarter. October registrations were nearly 50% higher than last year.\n\nScooters are growing faster than the broader market. Bajaj said October was an all-time high for its Pulsar portfolio, and that exports have reached a new peak after months of volatility. Both companies are pointing to momentum — steady, broad-based, and visible across segments. If Ola is describing the market as flat, it is the only one seeing it that way.\n\nPart of the answer sits in the details Ola didn’t emphasise. Back in July, the company publicly guided for 3.25–3.75 lakh vehicles in FY26, anchored on the festive season and the rollout of its Gen 3 platform.",
    "title": "Ola says the market is flat, Tata Steel says it’s going green | Who said What? S2E20",
    "articleUrl": "https://thedailybrief.zerodha.com/p/ola-says-the-market-is-flat-tata",
    "date": ""
  },
  {
    "learning": "Zepto raised fresh capital and is rumoured to be inching toward an IPO. Reliance Retail’s management declared that they re-pivoted their quick commerce model to 30-minute delivery, and they’re simply riding on top of an existing store base that covers most of urban India. Swiggy is raising funds after insisting not long ago that it didn’t need external capital. Blinkit, deep into a major shift in its operating model, is accelerating store additions in its strongest markets. The list is endless.\n\nWe aren’t really interested in the debate on whether the space is overvalued or undervalued. What is in our scope is breaking down what the 2 big players, Swiggy and Zomato Eternal, actually said and actually did this quarter. This is a sector we’ve followed very closely, and the landscape changes so quickly that each quarter feels like a new chapter.\n\nEternal’s adjusted revenue was massive at ₹13,968 crore, growing 172% year-on-year. On the face of it, that kind of growth looks extraordinary. And most of it came from quick commerce — compared to last quarter, Blinkit’s revenue jumped over 3x , which sounds unbelievable at first glance.\n\nBut there’s an important catch. Over time, Blinkit has been shifting from a marketplace model to an inventory-led model (or 1P) — which means it directly owns and buys the stock it sells instead of relying on marketplace sellers. This shift makes comparisons against past years or quarters much less useful. Their 3x quarterly jump is mostly an accounting effect, not a sudden explosion in the underlying business.\n\nIf you look at the real operating metric — which is net order value (NOV) — the fog gets clearer. NOV is simply the total value of all customer orders placed on the platform by removing the discounts. On that basis, Blinkit still grew at roughly 100% year-on-year, which is genuinely strong and far more representative of the scale the business added over the past year.\n\nIf the revenues are to be believed, both companies seem to be growing well. But in this sector, where everyone seems to be growing at breakneck pace, revenue is gradually becoming less useful as a metric of judgment. What may be more useful is to look elsewhere: in the costs, the cash burn, and the choices made about where to slow down and where to push harder.",
    "title": "Quick commerce feels the need for speed",
    "articleUrl": "https://thedailybrief.zerodha.com/p/quick-commerce-feels-the-need-for",
    "date": ""
  },
  {
    "learning": "Through the last decade, there’s been a wave of new financial products: one-tap SIPs, “round-up” investing, and rewards for paying rent by card. One part of this wave was “digital gold.” It came with a nice, shiny pitch (much like gold itself): why keep your savings in a bank when you can buy pure, 24-karat gold on an app in under a minute? Just tap the “₹100” button and that amount of gold will sit in a vault “in your name.”\n\nIn a country that loves gold, this was hugely attractive. Look at this year alone — according to ET Wealth , UPI transactions in digital gold ballooned from ~₹760 crore in January to nearly ₹1,180 crore by August 2025.\n\nBut as they say, not all that glitters is gold. These deals might gleam on the surface, but their insides are murky. See, at its heart, digital gold is not a regulated product . There’s nobody policing those apps to ensure that they play fair by you. And yet, because it was sold so aggressively across apps, many unsuspecting customers jumped in without questioning the offer.\n\nThe note was a reminder to everyone: India already has regulated ways to invest in gold — from gold ETFs by mutual funds, to electronic gold receipts (EGRs) you can trade on exchanges, to even gold derivatives on commodity exchanges. The “digital gold” you see on many apps, however, is not one of them. It sits outside SEBI’s rulebook.\n\nIn fact, back in the Union Budget for FY 2021-22, Finance Minister Nirmala Sitharaman had announced that SEBI would be made the regulator for a dedicated gold exchange. That announcement signalled that the government was thinking seriously about bringing order and transparency to gold trading. So far, that project hasn’t gone anywhere. But the need for one very much remains.\n\nWhen you buy a stock through a broker like us, your shares don’t actually sit with us. They’re in a demat account that’s maintained with government-backed depositories — CDSL or NSDL. If we were to go down some day, by some misfortune, your shares would stay safe . They would remain in a completely separate system, with legal protections and audits. Your assets aren’t mixed with our balance sheet.",
    "title": "SEBI isn't a big fan of digital gold",
    "articleUrl": "https://thedailybrief.zerodha.com/p/sebi-isnt-a-big-fan-of-digital-gold",
    "date": ""
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nStarting with Open AI’s CFO who recently said that they’re talking to the U.S. government about loan guarantees for their trillion-dollar data-center buildout. Basically, she was saying: this infrastructure is too big and too expensive for private markets alone and we might need you i.e. the govt to help underwrite it.\n\nThe logic, she said, was simple: this stuff costs too much and doesn’t last long enough. The servers, the GPUs, the data-center power — all of it depreciates fast. Government backing would make it cheaper to borrow, because the risk shifts to taxpayers.\n\nMichael Burry, the one who’s famous for his betting against the market in 2008. He’s The Big Short guy.  He has now disclosed a $1.1 billion short bet against AI-related stocks. At the same time, Deutsche Bank, which has lent billions to the data-center industry, started looking for ways to hedge its exposure — basically, insure itself in case this AI infrastructure boom goes wrong.\n\nAnd, the best one out of this week was when Sam Altman went on a podcast with Brad Gerstner, who’s an investor in OpenAI and Satya Nadella. Brad asked him the blunt question that everyone has been talking about for the longest time:\n\nAnd, the reply was just bold.  He said, first of all, that the $13 billion figure is wrong — “we’re doing well more revenue than that. ” Then he said, “If you want to sell your shares, I’ll find you a buyer.”",
    "title": "AI’s wild spending spree, Maruti’s unexpected turnaround | Who said What?S2E19",
    "articleUrl": "https://thedailybrief.zerodha.com/p/ais-wild-spending-spree-marutis-unexpected",
    "date": ""
  },
  {
    "learning": "Turns out, it’s not just about buying fancier stuff. It’s about how our aspirations evolve as our lives and incomes change. From upgrading a cycle to a scooter to an SUV, or normal bottled water to bottled Himalayan water, it’s all the same story: an ongoing search for a slightly better experience.\n\nThere’s a brilliant bit about Indigo launching business class despite being known for low-cost efficiency, and another on how wealth effects and technology shifts (like the iPhone or Jio) quietly push entire markets forward.\n\nWhy? Because PEBs reflect a whole new world in how construction is done. Most commercial buildings in India (like factories, warehouses, airports) are made the usual way: months of on-site work with concrete columns and rebar. But in the last few years, as opposed to this model, a growing number of buildings are being pre-engineered as separate blocks in factories , and then assembled into the final product.\n\nIn fact, the penetration of PEB is somewhere between 3-5%. Now, that’s not a big number, but that’s 3-5% of India’s entire real estate. It’s already a ₹21,000-crore industry in India as of FY25, according to CRISI L, and could grow to roughly ₹33–35,000 crore by FY30. For a new industry to reach that point is quite impressive, really.\n\nSo, we decided to take a look at PEBs. Now, we may not be able to do justice to the industry in a single Daily Brief piece. But we’ll ensure that you understand the basics of how to think about PEBs going forward.\n\nThink of a large warehouse, maybe the size of a football field. In regular construction, you’d dig foundations, pour reinforced concrete columns, wait for them to cure, and then build beams, floors, and roofing on top. It’s slow, messy, and weather-dependent.",
    "title": "The literal building blocks of the future are here",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-literal-building-blocks-of-the",
    "date": ""
  },
  {
    "learning": "Hi folks, Krishna here. A few weeks ago, I sat down with the good folks at SOIC Finance ( Ishmohit and Siddhant ) to talk about a word that’s everywhere from presentations to the earnings calls these days: premiumisation .\n\nThe person who once bought a hatchback now wants an SUV; someone who used to drink plain curd now buys Greek yogurt; the basic toothbrush becomes an electric one. It sounds like people are simply spending more, but it’s really about something deeper: how Indian consumers are evolving, and how aspiration itself is changing shape.\n\nPremiumisation, as Ishmohit put it, is “the aspiration for a better life experience.” It’s not about chasing luxury; it’s about upgrading life in small, deliberate steps, from necessity to comfort, from function to feeling.\n\nFamilies that once booked budget hotels now prefer four-star hotels because they care about safety and comfort. Mineral water has become “Himalayan” or “alkaline.” Even investing has its own version, from mutual funds to private equity, from fixed deposits to startup portfolios. Each move says the same thing: I want better, because now I can.\n\nYou can see this pattern everywhere. A decade ago, hatchbacks made up half of India’s car market and SUVs barely a tenth. Today, that’s flipping. The middle class wants larger cars, sleeker dashboards, ambient lighting, features that once lived in luxury catalogues.\n\nIn liquor, the same thing: regular whisky grows 2–3% a year, but Indian single malts and craft spirits are compounding 15–30%. As Siddhant said, “It’s driven by aspiration, but also by confidence. Indians now want to consume their own premium products, not just import them.”",
    "title": "The rise of premiumisation ft. SOIC",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-rise-of-premiumisation-ft-soic",
    "date": ""
  },
  {
    "learning": "From the fuel that powers our cars to the internet that powers our phones, from the food in our kitchens to the clothes we wear: Reliance is everywhere. Which is why, its quarterly results aren’t just about itself — to a degree, it also tells us how the Indian economy itself is moving.\n\nReliance recently announced its results for the second quarter of FY26. This has been another good quarter for the giant, reporting a consolidated revenue of roughly ₹2,80,000 crore, up 10% from a year ago. The quarter’s PAT stood at ₹22,092 crore, a rise of 14.3% year-on-year.\n\nBut Reliance shouldn’t be looked at as a single business. It’s a machine made up of many cogs, each moving with its own rhythm and responding to very different forces. To really understand what’s going on, it’s looking under the hood to see each cog.\n\nThis is where crude oil comes in, and is turned into everything else: like fuel for vehicles, or plastics, or even the materials for textiles and detergents. The O2C business runs one of the world’s largest refineries in Jamnagar, turning it into petrol and diesel that it sells through Jio-bp stations across India.\n\nThis quarter, O2C’s revenue stood at about ₹1.6 lakh crore, up 3.2% from last year. Its EBITDA, however, grew by a whopping ~21% as margins on gasoline, diesel, and jet fuel rose sharply. These margins rose because globally, oil supply stayed tight while demand stayed strong.\n\nThat dynamic, actually, should tell you the state of global oil trade today, which is buzzing with activity. Disruptions at Russian refineries pushed down the world’s diesel exports, China trimmed its own product shipments, and European diesel inventories ran low. Even as crude oil got cheaper, refiners were making more money per barrel of product, lifting margins everywhere.",
    "title": "Reliance takes big swings this quarter",
    "articleUrl": "https://thedailybrief.zerodha.com/p/reliance-takes-big-swings-this-quarter",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "In big cities, instant-delivery upstarts like Blinkit, Zepto, and Swiggy Instamart are poaching convenience-seeking customers. High-value urban shoppers, who once might have used Amazon/Flipkart for small quick orders, are instead turning to Q-com apps for super-speedy service. We’ve written about this aspect of E-commerce multiple times.\n\nIn smaller towns and rural India, a very different threat has emerged in the form of Meesho. While the giants were busy wooing metro customers, Meesho quietly captured price-conscious shoppers across tier-2, tier-3 cities and villages. It’s the online equivalent of a DMart or Vishal Mega Mart – thriving on ultra-low prices and no-frills operations to serve the masses, representing over half of India’s new online shoppers.\n\nQuick commerce has gotten a lot of hype for its flashy speeds and massive VC bets. But value commerce is proving just as disruptive. Meesho’s upcoming IPO shines a spotlight on this less-glamorous revolution: a mass-market, low-cost model that is fundamentally different from Amazon or Flipkart’s playbook. Today, we will talk about that.\n\nMeesho’s journey is a story of pivots. It began in 2015 as a platform for small sellers to set up online shopfronts, then gained fame with a reseller-driven social commerce model (think homemakers selling products via WhatsApp). By 2021, however, Meesho had reinvented itself as a more direct marketplace. Why? The reseller model, while novel, didn’t scale cleanly and people had become comfortable buying things online.\n\nUnlike Amazon or Flipkart, Meesho doesn’t charge sellers a commission fee at all. 0% commission on most categories means small vendors can sell online and keep 100% of their earnings. This was a radical move – Meesho essentially forgoes the typical ~15% marketplace cut to attract a flood of tiny sellers and super-low-priced products.\n\nHow do they make money then? Largely through logistics and advertising. We’ll dive into monetization soon, but the key is that Meesho’s take rate (revenue as a share of total merchandise sold) is the lowest in the industry – by design.",
    "title": "Inside Meesho’s IPO",
    "articleUrl": "https://thedailybrief.zerodha.com/p/inside-meeshos-ipo",
    "date": ""
  },
  {
    "learning": "Hi folks, my name is Krishna , and along with my colleagues Pranav, Kashish , Maine , Bhuvan , Vignesh , and Meher, we bring you The Daily Brief  every day in your inbox. It’s been more than a year since we have been doing this, and one question that a lot of people have asked is: how do we research?\n\nPeople keep asking us this: “How do you guys research these stories?” And honestly, there’s nothing secret about it. We don’t do anything fancy or groundbreaking. So here it is.\n\nThere are four or five of us on the team, and most of us just read. A lot. We start early around 6 a.m. and go through 40–50 different websites, articles, and reports every morning. That includes everything from The Financial Times , Business Standard , Economic Times , and Bloomberg to random research papers, government reports, and brokerage notes. We even look at journals and academic papers, the kind of stuff nobody really touches in India. This has been ingrained into all of us because of our Guru: Bhuvan.\n\nNow, the goal isn’t to read everything . After doing this for a while, we have developed a kind of instinct for what might turn into a story. Like, if the markets fall and someone says a thousand crores “vanished,” that’s not a story. But if a company’s putting up a ₹5000 crore plant, let’s say, a semiconductor plant, now that’s interesting. You can dig into what chips are, how they work, where India stands in the global chain, and so on.\n\nSo through the morning, we keep sharing interesting stuff we find in our internal chat group, links, reports, screenshots, random PDFs, whatever catches our eye. This goes on till around 11 a.m., when we all hop on a call.\n\nThat’s when everyone pitches what they’ve found. Each of us has our own area we’ve sort of gravitated towards over time. For example, I usually end up reading more on quick commerce, hospitals, and consumer stuff. So when we’re discussing stories, we lean on each other’s areas of strength.",
    "title": "How we research at The Daily Brief",
    "articleUrl": "https://thedailybrief.zerodha.com/p/how-we-research-at-the-daily-brief",
    "date": "2026-01-27T01:34:07.874Z"
  },
  {
    "learning": "The story involves a government official who allegedly leaked confidential regulatory information to a former student, who then passed it to friends and family. Together, they made a whopping ₹173 crore by betting on IEX’s stock price crashing before the rest of the market knew what was coming.\n\nThe story starts with a decision made by the Central Electricity Regulatory Commission (CERC). On July 23, CERC officially introduced something called “market coupling” , a change that would fundamentally alter how electricity is traded in India.\n\nHow does market coupling work? See, the IEX runs India’s biggest platform for short-term power trading, where electricity producers and buyers match bids for the next day. Under the old system, each exchange — IEX, PXIL, and HPX — discovered its own prices. Under market coupling, a single, central system would now set a uniform price across all exchanges.\n\nWe’d covered this change earlier : especially how it could end IEX’s dominant role in price discovery, maybe even trim its margins. And investors knew this possibility. The next morning, IEX’s stock collapsed almost 30%, one of its steepest one-day falls ever.\n\nA few days before CERC’s order, on July 21 and 22, there was a sudden burst of trading in IEX put options — a put option is a bet that a stock will fall. And as we know, with the CERC’s new order, the IEX’s dominance was about to decline. Those puts led to enormous profits when the order came into effect.\n\nSo, SEBI had to step in. Its surveillance systems had already picked up the strange movement. Around the same time, it also received a complaint pointing to possible insider trading here. So, SEBI immediately launched an investigation and began connecting all the dots to reveal the underbelly of this trade.",
    "title": "SEBI unearths a ₹173 crore insider trading scam",
    "articleUrl": "https://thedailybrief.zerodha.com/p/sebi-unearths-a-173-crore-insider",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "This week, India’s Central Electricity Authority (CEA) quietly unveiled a monster ₹6.4 lakh crore master plan spread over the next 2 decades, primarily for the Brahmaputra basin. A massive announcement by any means.\n\nInstead, the entire amount is earmarked for transmission infrastructure: power lines, substations, and high-voltage direct current (HVDC) corridors to evacuate tons of potential hydropower from India’s Northeast by 2047.\n\nThe first question in our minds was: why is hydropower getting so much focus? For one, dams take a really long time to build and require lots of capital. And in the age of solar panels becoming far cheaper than ever, wind turbines becoming more viable, and nuclear energy getting a revival, that doesn’t seem very appealing.\n\nThink of India’s grid as a massive balancing act. During sunny afternoons, electricity generated through solar reaches a peak. Wind kicks in when the breeze picks up. But what happens on cloudy monsoon days when solar drops 60%? Or calm evenings when wind generation flatlines? You need something that can ramp up fast, on demand. That’s hydropower’s superpower: it can fill the gap when weather conditions aren’t sunny or windy.\n\nThere’s more: while coal and nuclear aren’t easily switched on and off, hydropower is. Unlike nuclear plants (which prefer steady, baseload operation) or coal plants (which take hours to kickstart), hydro turbines can go from zero to full power in minutes. They provide what grid operators call “ frequency regulation “—the split-second balancing that keeps your lights from flickering when a million ACs switch on at 3 PM.\n\nHere’s how a PSP basically works. It has electric pumps that are powered using solar. So, when you have excess solar power at midday, the PSP pumps water uphill from a lower reservoir to an upper one. Come sunset, when solar dies and demand spikes the PSP releases the same water, whose downhill gravity powers wind turbines. The water also gets stored back again in the lower reservoir.",
    "title": "India has a new plan for hydropower",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-has-a-new-plan-for-hydropower",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nBut if you’ve been looking at the news, you would know that these numbers hide how wild times have been for TCS. Just last quarter, they fired over 12,000 employees, which was a whole 2% of their global workforce.This quarter, their workforce dropped by over 19000 people to below 6 lakh — which has never been crossed in the last 3 years. That’s pretty big for a company that is Inida’s largest employer.\n\nThey recorded a very dismal first quarter this financial year — so this new-found growth is, to some extent, owed to a lower base. On top of that, it seems like TCS and its peers don’t yet have a proper strategy for the age of AI.\n\nHowever, in a recent interview with ET NOW, senior executives from TCS gave us more clarity on the direction they’re headed in. This quarter, they announced a big foray into data centers, installing 1 gigawatt worth of data center capacity in the next 5-7 years. Here’s what CEO K Krithivasan said :\n\n“Demand, in the next 5-6 years is expected to grow up to 10 gigawatts. Supply is only expected to be 5-6 gigawatt in the next 5-6 years. So, there is going to be a lot of unmet demand. And that’s the reason we said we will commit 1 gigawatt of data centers over the next five to seven years.”\n\nThis is an unusual move for a company like TCS. Much of their business model involves working at the services layer — putting manpower on a client’s project and helping the client build out their systems. This model typically doesn’t require a lot of capital-intensive investments.",
    "title": "From TCS to Reliance: Major shifts shaping India’s Economy | Who said What? S2E15",
    "articleUrl": "https://thedailybrief.zerodha.com/p/from-tcs-to-reliance-major-shifts",
    "date": ""
  },
  {
    "learning": "Just a quick heads-up before we dive in. The Tata Capital and LG IPOs are open now. We wrote about them earlier — you can read the full story on Tata Capital here and on LG here .\n\nIndia gets hit by natural disasters all the time — floods, cyclones, droughts, heatwaves, even earthquakes. Each one leaves behind massive economic damage and human suffering, and it may only get worse from now with accelerating climate change.\n\nYet, around 93% of disaster-related losses in India aren’t covered by insurance, adding up to tens of billions of dollars in recent years. When disaster strikes, people mostly depend on state aid and donations. Personal insurance, however, rarely shows up in the picture.\n\nThat’s why a recent story from Reuters, on how India is considering a nationwide climate-linked insurance scheme, caught our attention. It made us curious: how does India’s disaster compensation system actually work right now? And what exactly is this new thing called “parametric insurance” that policymakers are suddenly so excited about?\n\nState governments take the primary on-ground relief operations — including emergency response, temporary housing, and immediate rehabilitation — with the central government “supplement[ing] the efforts of the State” through financial grants and logistical support (military aid, supplies, etc.)\n\nThe primary funding vehicle is the State Disaster Response Fund ( SDRF ) of each state, funded by both state and central governments. For severe calamities that overwhelm a state’s finances, the National Disaster Response Fund (NDRF), which is fully financed by the central government, steps in to supplement them. But central funds are not released until a full assessment of the damage is approved by a central team, introducing delays in the process.",
    "title": "India wants to insure against climate change",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-wants-to-insure-against-climate",
    "date": ""
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nDiamonds are one of those topics we’ve returned to more than once on this channel. We’ve done a Who Said What on it recently and a full deep dive on The Daily Brief where we spoke about the downfall of DeBeers. And I’m coming back to it again today because of an interview that Botswana’s president, Duma Buko, gave to Bloomberg.\n\nThat’s a remarkable level of confidence, not just because De Beers itself is in trouble —sitting on huge stockpiles,  prices cut for the first time , the parent company preparing its exit — but also because Botswana isn’t exactly flush with cash. The interviewer was sharp to press him on the funding bit.\n\n“We produce 70% of De Beers’ diamonds through Jwaneng mine and Orapa. So, we want to have a firm voice and the direction that the industry is taking. We want to have some control and involvement in the diamond value chain, including its marketing, which we believe has slacked somewhat over the years. And we now see the advent of synthetic diamonds purportedly almost seeking to supplant and replace natural diamonds. Well, it is our firm belief and stance that there is no way in which a fake can outshine the real.”\n\nIt’s a powerful line, but also one that shows the stakes for Botswana. The country’s prosperity has long rested on people believing exactly this — that diamonds are rare, special, and enduring. For decades, De Beers sold that story through advertising. But the world has changed. Today, lab-grown diamonds are chemically, visually, and structurally identical to natural ones. The only difference is origin — and price. A lab-grown stone costs a fraction, which means millions more people can afford this once-exclusive commodity.\n\n“Absolutely. It is anticipated that there will be an upswing indeed, over the next 2 to 3 years. But obviously, it will also be a function of proper marketing and differentiation in the market and traceability.”",
    "title": "Saudi Buys EA, Botswana Eyes De Beers & Jamie Dimon Warns… | Who said What?S2E14",
    "articleUrl": "https://thedailybrief.zerodha.com/p/saudi-buys-ea-botswana-eyes-de-beers",
    "date": ""
  },
  {
    "learning": "Previously, on The Daily Brief , we explored how lithium has emerged as the ‘metal of the century’, powering everything from smartphones to electric vehicles. This rush has fundamentally reshaped global supply chains, with a single country dominating the world’s ecosystem: China .\n\nThe three largest battery manufacturers from China — CATL, BYD, and CALB Group — collectively command a massive share of the global battery market. In fact, CATL alone has captured over 35% of the global battery market, with production capacity exceeding 500 GWh annually.\n\nBut we’ve talked about batteries enough, over here. Why are we bringing all this up again, today? Well, because India is now turning to China for its battery-making expertise. Ashok Leyland, one of India’s largest makers of commercial vehicles, just inked a long-horizon deal with China’s CALB to climb that ladder.\n\nHere’s what Ashok Leyland and CALB have agreed to: CALB will supply lithium-ion cells while Ashok Leyland learns to assemble them into battery packs. Gradually, Ashok Leyland shall build out its capability to design and manufacture those cells in India. The partnership involves over ₹5,000 crore ($600 million) in planned investments over the next 7-10 years.\n\nThe deal is practically a technology apprenticeship. At first, CALB shall ship cells to India, as Ashok Leyland’s engineers learn critical processes — like thermal management, battery management software integration, or pack design — under Chinese guidance. Ideally, over the next five years, as Indian teams absorb this expertise, they’ll transition towards learning how to make those cells indigenously.\n\nThe deal is a massive win for Ashok Leyland. While it has been betting big on electric vehicles, those plans have a severe shortcoming — batteries, which makes up much of the value of an EV — is something it has no expertise in. This deal plugs in that critical gap, giving it access to proven technology and know-how.",
    "title": "India plugs into China’s batteries",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-plugs-into-chinas-batteries",
    "date": ""
  },
  {
    "learning": "Well, getting Wi-Fi beamed down from space isn't merely about building satellites and orbital mechanics. The real drama is happening on planet Earth, in the state offices of Delhi. Bureaucrats there are wrestling with a question that only sounds simple, but really isn’t:\n\nThe Telecom Regulatory Authority of India (TRAI) has made a set of recommendations on satellite spectrum pricing, based on consultations with private players. However, the Department of Telecom (DoT) has suggested that TRAI rework the set.\n\nThis is no mundane regulatory back-and-forth. What it really reflects is the incentives and goals of the TRAI, the DoT, and different private sector firms — and how those goals conflict with each other. This story won’t solely be about individual players Starlink, but the whole maze of pricing India's satellite spectrum.\n\nWhether internet signals should be transmitted from space or land completely changes how it should be priced. And that’s the core of this maze. But before that, let’s understand what internet signals even are.\n\nThey are basically radio waves which have their own frequencies. Each frequency decides how much data the signal carries, and how widely it is broadcast. For instance, low-frequency waves (below 1GHz) travel far and are focused, but don’t carry a lot of data — making them useful for smartphones. High-frequency waves (above 24 GHz), on the other hand, carry a lot of data but don’t cover enough ground.\n\nTo transmit good internet to cities, mid-frequency waves — decent coverage with enough data — make the most sense. Your home Wi-Fi (2.4-5 GHz) usually operates in this band. However, when two signals in the same frequency band are targeted in the same area, they interfere with each other. Imagine two radio stations on the same frequency in the same city — you’d get nothing but static. Turns out, the internet works in much the same way.",
    "title": "India's deadlock on pricing internet from satellites",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indias-deadlock-on-pricing-internet",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nFive years ago? This wasnt the case at all. Back then protein was just a big whey tub. Today it’s high-protein paneer, high-protein curd, yogurt, high-protein milk. Infact, ITC just launched a protein atta, McDonald’s is doing protein cheese slices. And Amul? They’ve gone as far as a protein kulfi. A kulfi. Clearly, the protein wave is here.\n\n“So by March doubling the capacity for almost for manufacturing of high quality whey protein products double almost every alternate month and by March our capacity this year will be actually six to seven times more than what was in the beginning of the year”\n\nSix to seven times more capacity. Two million app users already. This is massive.\n\nOne is supply. After the monsoon, milk supply in India shoots up. Farmers and cooperatives like Amul end up collecting far more milk than households can drink fresh. Traditionally, that extra was parked in storable products like butter, ghee, skimmed milk powder.\n\nBut here’s where it gets interesting. When you turn milk into cheese, you don’t just get cheese. You also get a watery liquid called whey . It’s basically what’s left after the solid curds separate. For decades in India, this whey was considered waste so it was drained off or used as cattle feed. The irony is, whey is loaded with protein.",
    "title": "Amul’s Protein Push, Fed vs Trump & Nestle in Crisis | Who said What? S2E12",
    "articleUrl": "https://thedailybrief.zerodha.com/p/amuls-protein-push-fed-vs-trump-and",
    "date": "October 26, 2025"
  },
  {
    "learning": "Right now, this is just an expression of interest without a formal price tag, not a signed deal. But Jindal is ready to splash billions of euros on buying one of the oldest names in European steel, which also operates the largest steel plant in Europe in its headquarters — Duisburg.\n\nBut, the plant is also one of the dirtiest by emissions, still running on old coal-fired blast furnaces. To keep selling steel in Europe, where strict climate rules are being rolled out, Duisburg has to be rebuilt. That is going to cost a fortune, and Thyssenkrupp has been struggling to find someone willing to foot the bill, until now.\n\nThyssenkrupp used to be a sprawling German industrial giant whose history spans all the way back to the 1800s. It made steel, car and ship parts, and its elevators and escalators were known worldwide. If you’ve ever taken a lift (or escalator) in a metro station, airport, or even society building in India, you probably noticed their logo.\n\nBut in 2020, the group sold its entire elevators business for €17 billion (~₹ 1.5 lakh crore ). It was drowning in debt and needed a reset. That sale gave it cash but also signaled a shift in strategy . Thyssenkrupp no longer wanted to be a jack of all trades. It wanted to slim down and master just its core businesses.\n\nBut Europe’s new climate rules threw a wrench into those plans. Duisburg’s green rebuild will take billions — its old furnaces have to be torn down and replaced with those running on cleaner sources like hydrogen. But, it is also losing money fast: it makes €10.7 billion (₹ 80,000 crore ) in revenue a year but often runs at a loss.\n\nThe company has tried different escape routes, none of which worked. A joint venture with Tata Steel was blocked by the regulator. UK’s Liberty Steel circled but never closed . In 2023, Czech investor Daniel Křetínský bought 20% of its steel arm, but that didn’t solve much.",
    "title": "Another Indian steelmaker wants a big piece of Europe",
    "articleUrl": "https://thedailybrief.zerodha.com/p/another-indian-steelmaker-wants-a",
    "date": ""
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nIf you’ve been watching this show for a while, you’ll know we closely listen to what Neelkanth Mishra, Chief Economist at Axis Bank,  has to say. His readings of India’s macroeconomy are really insightful. This week, he gave an interview to CNBC TV18, and we tuned in.\n\n“The main reason the economy slowed over FY25 was not just the fiscal consolidation that was scheduled but it was mostly because of the inadvertent monetary tightening so so if you're if you're uh uh credit growth goes from 16.3% in March 24 to 9.8% in May 25. That's a 6.5% point of slowdown. And given that the system is about 56% of GDP, banking system credit um we're talking about more than a 3% point drag in credit growth. Now there is birectional causality. So slowing economy also drives this that's a slower credit.”\n\nThink of it this way: credit is like the water pipes under the city. More than half of India’s economy runs through those pipes. If the flow suddenly slows down, the whole city starts to feel it. That’s what happened. It wasn’t that people or businesses lost interest in borrowing. It was that policy that tightened the taps.\n\nAnd because it was policy-driven, it can also be reversed by policy. That’s why he thinks that the recent rate cuts and liquidity moves can flip the loop i.e., turning a cycle of low credit and weak growth into one where easier credit boosts demand, which in turn makes more people borrow and spend.\n\nBut don’t mistake this for a shift in the government’s priorities. Mishra is clear that GST cuts are not a big switch towards consumption. As he put it:",
    "title": "India’s Credit Crunch, The AI Talent War & China’s Engineering State | Who said What? S2E11",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indias-credit-crunch-the-ai-talent",
    "date": "October 26, 2025"
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nDevyani International, which operates major quick-service restaurant (QSR) brands like KFC and Pizza Hut, during their recent earnings call made a telling observation about how their business has fundamentally changed:\n\nThis represents a huge shift that we observed in our Daily Brief piece on QSRs. This is no temporary change in consumer behavior — it's a fundamental transformation in how people consume food from QSR chains. The fact that they've cut their KFC store formats by more than half, from 3,000 square feet to 1,400, shows how dramatic this shift has been.\n\nWestlife Foodworld, the McDonald's franchisee for West and South India, is also betting heavily on these changing consumption patterns. During their earnings call, Managing Director Saurabh Kalra revealed an interesting strategic shift in how they're thinking about store locations:\n\n\"We are experimenting on metro stations, stores, etc. I do not think that is strategy yet. But our goal is very simple, we have got to be where consumers are spending. And whether it is long-distance transit in some of the areas like all the access-controlled highways. We would like to be a part of all access-controlled highways, we would like to be a part of all airports. We would definitely look at short-term transit like metro as opportunities for the future, but that does not mean that we are compromising on other areas like high street or a mall opportunity.\"\n\nWestlife is pointing out that more and more people are eating while they’re on the move. Instead of going to a restaurant as a separate activity, food stops are happening at airports, highways, and even metro stations. Eating has become part of people’s travel and daily commutes, not just something they do after reaching a destination.",
    "title": "Less Dining Out, More Solar Power, and the AI Job Puzzle | Who said What? S2E10",
    "articleUrl": "https://thedailybrief.zerodha.com/p/less-dining-out-more-solar-power",
    "date": ""
  },
  {
    "learning": "At its arrival in 2017, GST promised a single tax system across the whole country. Its pitch was that India would finally function like a single marketplace, with goods moving seamlessly and businesses freed from the patchwork of state VATs, central excise, and service taxes.\n\nBut anyone who has dealt with GST over the past eight years knows the story didn’t quite go that way. Instead of simplicity, India got five main rates, a collection of cesses on top, and endless disputes about classification. Was a packet of popcorn a 5% item, a 12% item, or an 18% item?\n\nBut now the government has just announced the biggest changes to the GST since 2017. They're making the tax slabs far simpler, while also cutting taxes on hundreds of everyday items and services that regular people buy. This is GST 2.0.\n\nBefore we dive into the changes, we’d like to state that it is too early to comment on how impactful these reforms will be. We aren’t experts, but we’ll be looking into what analysts are predicting will happen.\n\nThe Council’s reform is straightforward on paper. Four slabs — 5, 12, 18 and 28%— have been collapsed into two. From 22 September, instead of four different tax rates, there are now just two main ones: 5% and 18%. There's also a special 40% tax rate just for luxury items and \"sin\" products like alcohol and tobacco.\n\nFor households, the GST 2.0 reforms are a welcome relief for the monthly budget. Kitchen staples like paneer, breads, and butter are down to either 0 or 5%. All household basics (soap, shampoo, toothbrushes) are also at 5%. Consumer durables  like ACs and televisions are down from the earlier 28% tax to 18%.",
    "title": "And here comes GST 2.0",
    "articleUrl": "https://thedailybrief.zerodha.com/p/and-here-comes-gst-20",
    "date": ""
  },
  {
    "learning": "For instance, we often go through reams of conference calls and interviews for our weekly newsletter, The Chatter . And something we kept noticing was how much attention they paid to a particular state in India: Andhra Pradesh. From clean energy to electronics to oil, companies across sectors, it seemed, were announcing massive projects in AP.\n\nWe couldn’t be more intrigued. Why was a single Indian state getting this much attention? What was it doing so well? We decided to take a look beneath the hood of what’s going on. Now, we’ll warn you: we don’t think we have the full picture of what’s happening ourselves. But we do think something interesting is afoot in the state.\n\nIn 2014, the old Andhra Pradesh was split into two states: Telangana, and a much smaller Andhra Pradesh, made up of the coastal Andhra and Rayalseema regions. This wasn’t an equal division. The old state’s capital, Hyderabad — which made up more than 30% of the old state’s GDP — now belonged to Telangana. Most of its economic heft was gone.\n\nMany residents of the new Andhra were deeply unhappy about this. There were violent protests and even huge power blackouts . The Centre gave the state some financial aid to cover its losses, but one thing was clear; the new AP would have to build an economic presence from scratch.\n\nThe state has aggressively courted investment, ever since — in a bid to transform itself from an agrarian economy to an industrial one. And it has seen some success. Since 2015, AP has grown at nearly 12% a year. Over the last five years, it has consistently ranked amongst India’s fastest-growing states. And it’s drawing business — with project commitments worth a mind-boggling ₹45,000 crore over the next 5 years.\n\nFor one, Andhra offers a large, cheap and very skilled workforce. It’s one of the largest contributors to India’s growing base of engineering talent, with 250+ engineering colleges and many other technical institutions besides. Some of the highest enrolment for the IIT-JEE exams, too, comes from AP.",
    "title": "From coastlines to assembly lines: The Andhra experiment",
    "articleUrl": "https://thedailybrief.zerodha.com/p/from-coastlines-to-assembly-lines",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "It used to be the world’s most valuable real estate developer; and the engine behind China’s incredible urbanisation push. Its founder, Hui Ka Yan, came up from nothing to become the richest man in China. Its name adorned thousands of glittering skyscrapers across hundreds of China’s fast-modernising cities. Four million workers relied on the company for their livelihood; two lakh of which were directly employed by the company.\n\nThis marks the last chapter in what was — depending on which metric you choose — perhaps the world’s greatest corporate fall from grace. It triggered a much larger property crisis that tore through China, and forced the country to change its economic blueprint.\n\nEvergrande began its life in Guangzhou in 1996, around when China first liberalised its housing market. After four decades of near-total state control, in the 1990s, China let private players enter its urban property market. This unleashed a nation-wide construction boom, and companies like Evergrande were set up to service that wave.\n\nThe company really found its feet after the Global Financial Crisis, however. The crisis was a make-or-break moment for China. The Western markets that had powered the first two decades of its rise had abruptly fizzled out. China needed a new way of fuelling its economy. It turned to real estate and infrastructure. The country’s financial system began pouring money to fund a once-in-a-lifetime rush of construction, and the sector came to make over a quarter of its economy.\n\nThe whole game centered around amassing massive pools of cash, based on promises . Evergrande constantly announced new projects, pre-selling apartments many years before they were built. This would bring in huge sums in pre-sales — which, to the company, were practically interest-free loans. That cash let the company buy up more land, announce even more projects, and accept even more pre-sales. By 2020, in fact, the company had 1.6 million pending pre-sold apartments.\n\nIt backed this with what it called its “three highs, one low” strategy: high-leverage, high-turnover, high-debt, and low-costs. The company borrowed aggressively, using that money to churn out projects at breakneck speed. At the same time, it pushed down costs — acquiring cheap land in small towns and distant suburbs, often with the help of local governments, which it sold at low margins. During the festival season, in fact, it would routinely give discounts as high as 30% to keep the orders rolling in.",
    "title": "The death of Evergrande",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-death-of-evergrande",
    "date": ""
  },
  {
    "learning": "We've talked a lot about oil on The Daily Brief — Russian oil, global crude prices, and what not. But there's a completely different type of oil that's equally important to India's economy and your daily life: edible oil. You know, the stuff you use to cook your dal and fry your samosas.\n\nWe've touched on edible oils in our tidbits a few times before, but we thought it was time for a deeper dive. Why now? Well, a lot has been happening.\n\nIn February 2025 , after skyrocketing over the last 2 decades, India's edible oil imports hit a 4-year low. The government has also been playing around with import duties — slashing them from 20% to 10% just in May to control food inflation. Even our Prime Minister Modi spoke about it, asking people to reduce their edible oil consumption by 10% ,.\n\nEdible oil is exactly what it sounds like — oil that's safe for human consumption. But it is just the broader name, and goes beyond the oil in your pan. There are many types. They are classified based on what they're extracted from. Palm oil comes from palm trees, soybean oil from soybean seeds, sunflower oil from sunflower seeds. You get the idea.\n\nEdible oil is present everywhere in our daily lives without us realising. Take any packaged snack in your kitchen — chips, biscuits, chocolate, Maggi, even ice cream. Palm oil is probably listed as one of the top ingredients.\n\nIndia is the world's second-largest consumer of edible oil. Our per capita consumption reached 19.7 kg per year or possibly even more — much higher than the WHO's recommended 13 kg . To give another perspective: in the 1960s, we consumed just 3.2 kg per person annually. That means an increase of more than 500% .",
    "title": "The trade chaos behind your cooking oil",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-trade-chaos-behind-your-cooking",
    "date": ""
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nThe dot com bubble scarred the psyche of an entire generation of investors, and for good reason. It was perhaps the most remarkable example of a pattern you see with practically every impressive piece of technology — a mass investor hysteria around an unbelievably good promise, which ends in a sudden and tragic correction.\n\n“Is AI the most important thing to happen in a very long time? My opinion is also yes. ”\n\nThat duality is important. The way he says it, such bubbles are just a way of life — a feature of anything that shows this sort of promise. It feels, almost, like he’s talking about a psychological phenomenon, not that he’s giving market commentary.\n\nTo him, “ When bubbles happen, smart people get overexcited about a kernel of truth. If you look at most of the bubbles in history, like the tech bubble, there was a real thing. Tech was really important. The internet was a really big deal. People got overexcited. ”\n\nThe dot com bubble was an odd beast. It came at the birth of something we now know to be world-changing — the internet — which coincided with a period of very low interest rates, and historically high liquidity. Companies were being spun out of nowhere, while investors had lots of money, but few places to get good returns. That meant all sorts of companies would get funded at multi-million dollar evaluations.",
    "title": "Is AI the New Dot-Com?, Smarter growth in Indian Hospitals | Who said What? S2E8",
    "articleUrl": "https://thedailybrief.zerodha.com/p/is-ai-the-new-dot-com-smarter-growth",
    "date": ""
  },
  {
    "learning": "Over the past few months, Indian pharma companies have been unusually chatty in their earnings calls about their GLP-1 plans. And that’s for good reason. They're all lining up to have a crack at one of the biggest market opportunities in pharmaceutical history.\n\nWe've been tracking GLP-1  for a while now: it is, quite clearly, a remarkable invention. For quick context, GLP-1 drugs like semaglutide promise something that might have seemed too good to be true just five years ago: they help you shed weight . They re-wire your brain's relationship with food, reducing the unhealthy cravings you feel. They help you fight temptation — perhaps the biggest barrier in anyone’s weight loss journey. That’s a miracle; and thus, multi-billion market.\n\nBut as we covered previously , in a cruel twist of fate, Novo Nordisk realised the miraculous potential of what it had created far too late. It had a ~20 year patent over the drug; and for most of that time, it thought it was selling really good diabetes medicine. It was only in 2021, five years before its patent ended in much of the world, that it realised what a goldmine it was sitting on.\n\nThat clock has nearly run out, now. Its semaglutide patent expires in early 2026. And it’s clear that anyone that can make a knock-off will do so. Take the United States: under US law, “compounding pharmacies” can make copycat versions of a patented drug, as long as they don’t mass produce it. And recently, Novo Nordisk lost an estimated 1 million patients to these compounding pharmacies.\n\nIndividual pharmacies, though, are hardly the biggest concern. With the patent cliff just months away, bigger players are eyeing the market. Novo Nordisk is already trying hard to fend them off in court. But the opportunity is enormous — this is a drug with tens of billions in sales potential, and Novo's stranglehold might soon slip.\n\nBefore we get into what these companies are saying, it's crucial to understand what they're actually dealing with. Because semaglutide isn't a simple pill. It’s a horrifyingly complex molecule with nearly six hundred atoms:",
    "title": "Sizing up the GLP race",
    "articleUrl": "https://thedailybrief.zerodha.com/p/sizing-up-the-glp-race",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nIn an interview with NDTV Profit, Vikas Gupta, the MD of PG Electroplast, explained what went down. By the way for context, PG Electroplast designs, manufactures, and assembles electronic components for other manufacturers.\n\n“Because of the early onset of monsoon and high channel inventory, the overall summer selling season for air-conditioners got compressed. And it fell off beyond the anticipation of any of the industry players.”\n\nSo, to support that momentum, they expanded production massively by investing in more capacity. PG Electroplast had in their concall last year said that in FY26 their revenues will increase by a further 30%.\n\n“ Blue Star and Voltas are a bit cautious regarding the near-term demand particularly due to early monsoon, and they are facing some rising inventory levels at the channel. But we are on the other side pretty much confident which is reflected in our numbers as well for FY26. So, sir, please help us to understand what is giving us this level of confidence. ”\n\nFast-forward to the Q1 FY26 results. Compared to the same quarter last year, net profits got squeezed by 20% . Revenue increased by 14% — far lower than the 30% they expected.",
    "title": "AC sales crash, EV charging puzzle & Trump targets trade | Who said What? S2E7",
    "articleUrl": "https://thedailybrief.zerodha.com/p/ac-sales-crash-ev-charging-puzzle",
    "date": ""
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nWhen Trump began announcing his tariffs, we at Markets lost our minds for a bit. This was a sudden reversal of the way the world economy ran for decades — and we found ourselves writing a series of frantic pieces trying to understand what this all meant.\n\nBut now that a 50% tariff is actually in place, we don’t really know what to say. We have no way of analysing what happens when the world’s largest market slaps double-digit tariffs at a whim. This isn’t serious economic diplomacy; it’s a shake-down.\n\nIn the world of social media — where most of Trump’s policy-making happens — it’s easy to point fingers at someone and scream “Russia!” It’s infinitely harder to explain complex nuances of geostrategy. India has tried, though, putting out a fairly strong statement with its point of view:\n\nWill this convince anyone to see India’s point of view? Of course not. But it’s worth digging into this response, if only to understand India’s perspective on what is genuinely a complex issue.\n\nIn case you’re wondering, countries basically never put price caps on each other. Think of how odd a choice it is: the West was basically telling Russia the price it could sell its oil to completely unrelated third parties. Why choose something so weird ? Why not just cut Russia out completely?",
    "title": "Oil, Diamonds & A $60B IPO – 3 Big Stories You Can’t Miss | Who said What?S2E6",
    "articleUrl": "https://thedailybrief.zerodha.com/p/oil-diamonds-and-a-60b-ipo-3-big",
    "date": ""
  },
  {
    "learning": "We recently did a story on the fall of De Beers on our weekend show, Who Said What . But the format of that show didn’t really allow us to get into all the little nuances and context to that whole story. So, we thought, why not follow that up with a detailed Daily Brief story?\n\nThis association was painstakingly crafted over decades. And if it’s cracking now, that too is arguably De Beers’ own doing. Here’s the story of how a once all-powerful global monopoly might be falling apart.\n\nUntil then, diamonds were incredibly rare — found mostly in small Indian riverbeds and the jungles of Brazil. Around 1870, however, everything changed, when massive diamond deposits were discovered near Kimberley in South Africa. Suddenly, diamonds were being mined by the ton.\n\nHowever, amidst this abundance, a group of British financiers, led by the controversial Cecil Rhodes, observed something crucial. Unlike, say, milk or toys that have value in their use , the value of diamonds depended on their scarcity . If diamonds could be mined by the tonne, paradoxically, all of  them would lose value.\n\nThe key to creating scarcity, De Beers realised, was controlling every single stage of the diamond supply chain — from mines to the ring on a consumer’s finger. So, De Beers set out to create a global cartel. It captured mines, controlled rough diamond supplies, and tightly managed distribution through a single sales channel known as the ‘Central Selling Organization’ (CSO). Diamonds would be mined from the African continent, travelling through key hubs of trade across the world to reach cutters, dealers, and jewelers.\n\nSurat is the diamond-cutting capital of the world. More than 90 percent of all the world’s diamonds are cut and polished in Surat. Whether a diamond originates legally, from major mines in Botswana and South Africa, or illegally from conflict zones, it probably lands up in Surat — where lakhs of skilled artisans turn raw diamonds into sparkling gems.",
    "title": "Nothing is forever: The De Beers story",
    "articleUrl": "https://thedailybrief.zerodha.com/p/nothing-is-forever-the-de-beers-story",
    "date": ""
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers, and the like, and contextualize things around them. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nQuick commerce in India is no longer a question of whether it’ll scale—it’s a question of who’ll own it or atleats a significant chunk of it. In one corner, you’ve got Blinkit, the market leader, moving fast and building for speed. In the other, the mammoth Reliance, armed with a 19,000-store+ strong offline network and a balance sheet big enough to swallow entire categories. One has operational finesse; the other, overwhelming might.\n\nLet’s start with Reliance. In ione of their recent earnings call, the company made a forceful case that it’s uniquely positioned to win this game—not because it’s nailed the 10-minute model, but because it has the widest and deepest physical footprint in the country.\n\nThat’s Reliance telling the market: you may win Delhi or Bangalore, but we already own India. And they’re backing it up with numbers: 2,000 of their 19,000 stores are now tied into their quick commerce network, reaching over 4,000 pin codes. This is what they said in the recent earnings call:\n\nThere’s a tone of inevitability in the way Reliance speaks about this market—like it's already theirs. As if scale alone is a moat. But what if scale isn’t the moat they think it is?\n\nHere’s where things start to break. The quick commerce model isn’t just about physical proximity, it’s about operational choreography. It’s about how quickly a picker can locate, grab, and hand over an order. It’s about store design, product packaging, and SKU layout. It’s not retail. It’s fulfillment.",
    "title": "Reliance vs Blinkit heats up, IT’s future in danger?, Trump on NVIDIA | Who said What?S2E4",
    "articleUrl": "https://thedailybrief.zerodha.com/p/reliance-vs-blinkit-heats-up-its",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "In India, every litre begins its journey on a farm that may milk anywhere between two cows or several thousand buffaloes. Roughly 65% of that milk still flows through the “informal” channel of local collectors and sweet-shops; the rest is funnelled into organised co-operatives like Amul and private dairies that can certify quality, pay by the milk’s fat-content, and bill the farmer by the end of the day.\n\nHere's where it gets tricky, though. While farmers' prices keep changing, the price you pay in shops stays almost the same. Why? Because price revisions are politically sensitive. Even a small hike in the price of milk angers millions of voters, and state governments cap these increases just in time for elections.\n\nThis creates a huge problem for dairy companies, which already run on razor-thin margins. Imagine you run a milk business. You have to pay farmers more when cow food is costly, but you can't charge customers more because the government won't allow it. Your profit gets crunched from both sides.\n\nRaw milk goes bad incredibly fast. If you leave it outside the fridge for just three hours, it turns sour and you have to throw it away. Milk companies need to keep it cold through the journey from the farm to your home.\n\nTo solve this, companies like Amul and others build an entire cold chain system. Think of it as a network of veins spreading out from the main factory. Each of those veins has nodes, cooling centers in villages where farmers can quickly chill their milk. They have special refrigerated trucks that work like moving fridges.\n\nThey also have testing labs to check the milk at every step. This whole system has to work perfectly. If a truck is late picking up milk from a village, that entire evening's collection spoils and becomes worthless.",
    "title": "Milky Mist is going Public - Here’s what you should know",
    "articleUrl": "https://thedailybrief.zerodha.com/p/milky-mist-is-going-public-heres",
    "date": "October 26, 2025"
  },
  {
    "learning": "Mountains were moved to smoothen their entry into India: from land grants, to legal waivers, to geopolitical maneuvering. But there’s one aspect we haven't touched yet. Foxconn was only able to set up base because thousands of workers migrated to where its operations were.\n\nThis is just one such project. As India tries to build out its industry, we need many more such projects all over the country — lining every industrial cluster in the country. Without that, our “Make in India” dreams will never translate into reality, no matter what other incentives we bring to the table.\n\nA report by NITI Aayog echoed this need for worker housing, and India’s shortfall in that aspect. That’s what we’re looking at to answer one question: what’s stopping us from building more worker housing ? The answer, it turns out, is deeply complex — lying in how Indian real estate is organized, the regulations that hinder construction, and ultimately, money.\n\nEver come across the chocolate Bournville on supermarket shelves? Bournville was originally a village founded by the Cadbury family. Shoemaker Bata, similarly, was a big proponent of townships. It exported this model wherever it set up shop — including Batanagar in West Bengal.\n\nThere, too, Foxconn was at the centre of this push. When Foxconn entered China, worker housing was an important anchor for their manufacturing ambitions. They needed thousands of workers from rural areas, and to attract them, company housing was included in their employment contracts. Together with local governments, the company set up entire townships for people that left their villages to assemble phones for Foxconn. One of them is even called the “ iPhone City ”. These townships don’t just have houses; they’re filled with amenities — malls, restaurants, hospitals — for workers to access.\n\nNow, don’t get us wrong: townships aren’t always worker-friendly . They often came with heavy surveillance, with serious restrictions on how people live. Foxconn workers, for instance, have often endured restrictions on their movement and cramped living conditions.",
    "title": "To build factories, build homes",
    "articleUrl": "https://thedailybrief.zerodha.com/p/to-build-factories-build-homes",
    "date": ""
  },
  {
    "learning": "Your neighbourhood LIC agent was the closest thing you had to a financial advisor. ULIPs seemed like excellent savings products — \"insurance with stock market returns\" — and equity investing was meant for gamblers. But in the last decade or so, a combination of regulatory prodding, a rising middle class, and relentless marketing (oh, and fintech companies like us!) ensured that mutual funds would become a strong pillar of the Indian retail investing ecosystem.\n\nYet, even today, there are miles for the industry to go. Of more than 70 crore PAN holders in the country, just around 5 crore are mutual fund investors. And that counts folios , not unique individuals. The actual number of Indian people who invest in mutual funds is closer to 3.8 crore — barely 5% of our population.\n\nThat’s the context in which ICICI Prudential AMC, one of India’s largest mutual fund houses, has decided to IPO . This comes when the business model of active fund management is being reshaped by regulation, passive funds are getting commoditised, and digital platforms are turning things on their head. The total pie, on the other hand, is expanding .\n\nFirst, the basics. We don’t know what the price of the IPO will be. Or when it’ll be open. All we know at the moment is that this will be a 100% Offer for Sale (OFS) — meaning that existing shareholders are selling their stake in the company.\n\nOne of the most important details, in such a business, is its ‘AUM’. A company’s AUM, or ‘Assets under Management’, is the total money it currently manages for its customers. What the company earns is a function of its AUM. As of Q4 FY25, ICICI Prudential AMC’s average mutual fund AUM stood at ₹61.3 lakh crore.\n\nBut the AUM alone doesn’t tell you much. The nature of that AUM is as important — because different categories of mutual funds have different ‘expense ratios’, i.e. they earn wildly different fees.",
    "title": "ICICI Pru AMC's IPO: A window Into India’s MF boom",
    "articleUrl": "https://thedailybrief.zerodha.com/p/icici-pru-amcs-ipo-a-window-into",
    "date": ""
  },
  {
    "learning": "Barry Callebaut, the world's largest chocolate manufacturer, announced this week that it was cutting its sales volume guidance for the second time this year. The Swiss company, which processes nearly 2 million tons of cocoa annually, cited \" unprecedented cocoa volatility \" as the primary reason for reducing its outlook.\n\nThis announcement marks a significant moment in what has become the most severe cocoa crisis in over six decades. What started as localized weather problems in West African cocoa farms has evolved into a global crisis affecting everything from farmer livelihoods to chocolate bar prices at local grocery stores.\n\nGlobal cocoa production declined by 13% in the 2023/24 season to 4.368 million tonnes , while demand remained steady. This created a supply deficit of 494,000 tonnes — the largest shortfall in more than 60 years.\n\nGhana's cocoa production reached only 531,000 tons in the 2023/24 season, while its average hovers around 800,000 tons. This season is Ghana’s worst performing cocoa bean production session over the past 15 years.\n\nThere aren’t enough cocoa reserves in the world right now. The cocoa-to-stocks ratio, a key indicator of market tightness, suggests we have less than two months of consumption. Usually, the markets require a three-to-four buffer for stable prices.\n\nFutures contracts reached wild highs of $12,931 per metric ton in December 2024, more than four times from typical levels of $2,000-$3,000 per ton. At its peak, a kilogram of cocoa became more valuable than precious metals of the same weight.",
    "title": "Is this the End of Cheap Chocolate?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/is-this-the-end-of-cheap-chocolate",
    "date": ""
  },
  {
    "learning": "The idea is that we will pick the most interesting and juiciest comments from business leaders, fund managers and the likes and contextualise things around it. Now, some of these names might not be familiar, but trust me, they’re influential people, and what they say matters a lot because of their experience and background.\n\nShorts sellers are investors who make money by betting on a company's stock price going down. They sell a stock for a high price, and if they get their bets right, they buy it back later at a lower price, pocketing the difference. They are kind of like the janitors of the stock market: they sweep up the mess in the market by identifying fraud and bringing some order to the chaos. Now, let’s be clear: Since they are a short seller, they make money if Vedanta’s stock price falls. Just because they’ve published a research report doesn’t mean they’re right. They want people to believe Vedanta is in trouble, because that’s how their trade pays off. So take their claims with two buckets of salt. That said, sometimes short sellers shine a light where others aren’t looking.\n\nSo, here’s what Viceroy calls a ponzi scheme: they say that Vedanta Resources — the parent entity — is feeding on its listed subsidiary just to stay alive. The key claim is this: Vedanta Resources forces its subsidiary to borrow money in order to pay it dividends. It uses those to pay off the interest on its own massive debt, that came from years of borrowing to fund acquisitions, projects and what not. But this, Viceroy claims, is self-destructive: the only valuable thing that Vedanta Resources owns is its shareholding in Vedanta Limited. But by feeding on it, it’s eating away at that very value.\n\nHow bad is it? Viceroy says that over the last 3 years, Vedanta Ltd generated around ₹46,000 crore less in cash than it paid out in dividends. It paid roughly ₹66,400 crore in dividends during that time — money it didn’t earn.\n\nThe one other thing that Vedanta Resources — the parent company — owns is the ‘Vedanta’ brand. VEDL and its group companies have paid ₹8,000 crore over 3 years in so-called “brand fees” to the parent company for using the \"Vedanta\" brand. But it asks: is this a genuine service that the parent company offers? Or is it just an arrangement to funnel money up the chain? To be fair, though, this isn’t exactly unique. Many other conglomerates have similar arrangements, where a parent company earns by leasing its brand to many revenue-creating group companies.\n\nViceroy says the interest expenses of Vedanata Resources don’t add up. See, when you look at the books, it seems like Vedanta Resources is effectively paying interest of 15.8%. But the bonds it has issues, and the term loans it discloses, have an interest rate of around 9–11%.",
    "title": "Vedanta's ponzi allegation, China’s industrial obsession, GST still broken? | Who said What? S2E2",
    "articleUrl": "https://thedailybrief.zerodha.com/p/vedantas-ponzi-allegation-chinas",
    "date": ""
  },
  {
    "learning": "It’s been about a year since I really started paying close attention to the news — listening to earnings calls, reading transcripts, and watching what company managements are saying. And one thing that stood out almost immediately was how many FMCG CEOs kept repeating the same thing: there’s a slowdown in consumption, the middle class is shrinking, demand is weak — that sort of stuff.\n\nAnd honestly, it made sense. If you looked at the numbers — volume growth vs PAT growth — the gap was clear. Plus, these are the people closest to the customer. They’re in the weeds.\n\nOver the past year, India's FMCG leaders have expressed growing concerns about the shrinking urban middle class. Nestlé India Chairman Suresh Narayanan observed that the middle segment, which historically formed the core customer base for FMCG companies, appears to be diminishing.\n\nThis sentiment was reinforced by Hindustan Unilever CEO Rohit Jawa, who noted that overall FMCG volume growth has decelerated, reflecting weakened demand, with urban markets continuing to slow even as rural areas show signs of gradual recovery.\n\nColgate-Palmolive India's MD & CEO Prabha Narasimhan pinpointed the issue more precisely, stating that the bottom 70% of urban India is experiencing significant pressure, which is dragging down overall volume growth.\n\nSo I was pretty much convinced. But then I came across something Rajeev Thakkar, CIO of Parag Parikh Mutual Fund, said in a recent chat with Moneycontrol — and it really made me think. He said:",
    "title": "Business, Biotech & Brand Battles: A Story of Three Shifts | Who said What? S2E1",
    "articleUrl": "https://thedailybrief.zerodha.com/p/business-biotech-and-brand-battles",
    "date": "October 26, 2025"
  },
  {
    "learning": "Every year, in April-June, various companies battle each other to put their soft drinks in your refrigerator. They prepare to mount aggressive marketing campaigns, ramp up their production capacity, and court retailers and kirana stores with incentives to stock their product. From Coke to Rooh-Afza to energy drinks, every summer, India sees an intense, heated battle of the beverages .\n\nRecently, however, a new heavyweight has emerged on this battlefield: Reliance . The Mukesh Ambani-led giant has announced its intention to invest upto ₹8,000 crores on expanding its beverages business. This is their largest investment outlay in the FMCG sector to-date.\n\nReliance has been making waves in soft drinks for the last couple of years. It famously mounted an audacious challenge to the duopoly of Coke and Pepsi, by reviving the Campa-Cola brand. That is the flagship of Reliance’s push. Much of its ₹8,000 crore investment will be devoted to Campa-Cola’s expansion. But it is only the most notable of a series of drinks Reliance is bringing to the market.\n\nSo why is Reliance investing in such a crowded industry? What are the tides that favor them in this battle? How are its competitors reacting to this offensive?\n\nIt began from 1956, when Coca-Cola entered India and made a major splash among relatively-richer Indians. But this was an older India, where business was seen with suspicion. Politicians across parties accused it of exploiting its monopoly to siphon excess profits back to the United States.\n\nThis suspicion reached a fever pitch in 1977. The Janata Party had just won the Lok Sabha elections, becoming the first non-Congress national government in our history. Back then, our pre-liberalisation economy faced unending shortages of foreign exchange. Multinational corporations became a key target of the politicians of the time. That is why India introduced its “Foreign Exchange Regulation Act”, or FERA.",
    "title": "Reliance's soft drink shake-up",
    "articleUrl": "https://thedailybrief.zerodha.com/p/reliances-soft-drink-shake-up",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "“ The US has made exaggerations about Huawei’s achievements. Huawei is not that good yet. ”\n\n“ If the United States doesn’t want to participate in China, Huawei has got China covered. Huawei also has got everybody else covered. ”\n\nWhich made us ask the question — while much has been made of their industrial prowess, where are China’s chip capabilities really? How serious a competitor are they in the chip war? What are their strengths, weaknesses, successes and failures? To answer these questions, we need to dive deeper into their strategy, how their various firms are doing, and what the technological frontier even is for semiconductor tech.\n\nIn most situations, the best strategy you can have is an “emergent one” — one that you stumble into, rather than plan out. Crises, after all, have a bad habit of throwing your best-laid plans into the ocean. No one knows this better than China.\n\nRight now, China is at the receiving end of bans from both the US and Taiwan, preventing it from getting its hands on their most advanced chips. This is the situation it’s trying to improvise its way out of.\n\nThe first emergent strategy response from China has been to rely on their legacy chips industry. By and large, this industry made semiconductor chips that were 28 nanometers (nm) and above, where today’s highly-advanced chips can be smaller than a couple of nanometers . Nonetheless, they’ve provided a base that China can rely on.",
    "title": "Can China crack the chip game?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/can-china-crack-the-chip-game",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "Maybe that is the case. But behind this is one of the most complex, globally-entangled industries we’ve come across. Trust us, it’s a lot . It’s a space where science meets law, where pricing power meets public health, and where decades of investment can collapse — or explode — with a single regulatory call.\n\nIt took us ages to get any sense of the sector, and we’re still not sure we have much of a command on it. But we’re going to run through two major pharma companies to understand how they work, and how they did last quarter. We’ll do this in two parts — today, we’ll look at India’s reigning generics giant, Sun Pharma. One of these days, we’ll return to look at India’s contract drug manufacturing industry.\n\nSmall molecules are your standard chemical drugs — something like a paracetamol . They’re made through a series of chemical reactions, batch after batch, in reactors. These medicines usually dominate pharmacy shelves, and make up most of what India exports.\n\nOn the other side are large molecules, or biologics — insulin, antibodies, vaccines, and the like. These are many orders of magnitude more complex. Standard lab procedures don’t work at this scale. These are often made using living cells, have to be stored in perfect conditions, and are mostly injected.\n\nAs you might imagine, the requirements of the two are so different that they’re practically two different industries. India’s global edge was built on small molecules. But we are now learning how to compete in biologics too.\n\nSee, patents usually protect the rights of inventors over their inventions. In the pharma business, this means a pharma company has a complete monopoly over any new drug it discovers for a while — usually twenty years.",
    "title": "Why Sun Pharma Is Betting on New Drugs",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-sun-pharma-is-betting-on-new",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "There are a bunch of sectors we haven’t yet covered on this channel. Forgive us — we’re a small team that’s learning on the go. We’re figuring things out one-at-a-time ourselves, and keying you in on whatever we find.\n\nA sector we’ve been interested in for a long time is chemicals , specifically specialty chemicals . This is a complex space that’s new to us. And so, we’ll keep our scope limited. We’ll pick up three companies, as stand-ins for their respective segments, and dive into their Q4 results. Disclaimer: we’re certain to miss a lot of nuance, and we’ll park a lot of threads for later. But we’ll hopefully come around to it again, one of these days.\n\nMost products you’re familiar with — plastics, paints, fertilisers and so on — are made using chemicals . These chemicals come in all forms, from all sorts of sources — from minerals, to plants, to animals. Petrochemicals, though, form the backbone of a lot of chemical products. For example, you get compounds like propylene and benzene from crude oil, which then go on to become building blocks for plastics, detergents, and much more.\n\nBulk chemicals are your standard, mass-produced industrial chemicals. The basic stuff you’d find in your high school chemistry lab — like caustic soda, or sulfuric acid. These are produced in large volumes and trade like commodities, with prices swinging based on global demand and supply.\n\nSpecialty chemicals, on the other hand, are a completely different beast. This business is not about volumes, but function ; these chemicals are used for very specific purposes. For instance, a specialty chemical might be something that helps a shampoo foam up, or makes a T-shirt wrinkle-free, or helps crops absorb pesticides better. This market is a lot less commodity-like: here, performance matters.\n\nSpecialty chemicals have better margins, and are more insulated from commodity price swings. If a customer likes your product, they tend to stick around. But it’s a harder business to get into. You have to work with clients closely — sometimes even co-develop the product with them — and make sure you meet all their performance and safety standards. And if you want to export, you’re also under pressure to meet environmental and safety standards.",
    "title": "India’s Specialty Chemicals Industry Explained",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indias-specialty-chemicals-industry",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "Batteries, it sometimes seems, are the talk of the town. There’s been a huge surge in interest, recently, around batteries — much of it fueled by their pivotal role in the green energy transition. In particular, two areas are driving today’s battery boom.\n\nBatteries are at the heart of the EV shift. They’ve quickly become the costliest component of an EV — historically as much as 30-50% of the car’s cost. Thanks to improving technology and scale, battery costs are falling. Average EV battery pack prices dipped below $100 per kWh recently, in fact. Nevertheless, they remain a major factor in vehicle pricing. And so, as EV sales skyrocket, battery demand is booming.\n\nSolar panels only generate power when the sun shines, and wind turbines only when it’s windy. If you want to keep the lights on 24/7 with renewable energy, you need to store excess power and use it later. That’s where grid-scale battery installations (often called Battery Energy Storage Systems, BESS ) come in.\n\nThese can soak up surplus power, when power generation peaks, and then release it later — when demand exceeds supply. They can also step in quickly to stabilize the grid if there’s a fluctuation. As Duttatreya Das of energy think-tank Ember puts it:\n\n“ Battery is the single biggest missing piece in a renewable powered world. They add a lot of value – firming up renewables, shifting excess solar generation to evening peaks, providing stability to grid fluctuations and so on. They would become much more essential for the power system as the share of solar and wind grows exponentially. ”\n\nThey’ve been used for decades, running everything from your inverter to your mobile phone. But these segments, while important, are growing relatively slowly. EVs and large-scale renewable storage, on the other hand, are experiencing exponential growth, driving demand at a scale that we’ve never seen.",
    "title": "Batteries are the New Oil?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/batteries-are-the-new-oil",
    "date": ""
  },
  {
    "learning": "A recent CareEdge report made a simple but telling observation:  LPG Under-recoveries of OMCs Expected to Reduce by ~45% Y-o-Y in FY26 . That’s the kind of line you’d typically skim past, unless you happen to be one of those people who care deeply about LPG. If that’s the case, it’s a little sad.\n\nBut let’s say you’re not one of those people. What exactly is an under-recovery? Why does it matter? And does this all mean that we will pay more for our cooking gas?\n\nLet’s start with the gas itself. LPG, or liquefied petroleum gas, is a mix of propane and butane—byproducts of oil refining and natural gas processing. It’s compressed into a liquid so it can be stored in pressurized steel cylinders and shipped just about anywhere. When released, it vaporizes, burns with a clean blue flame, and makes tea.\n\nBut what’s interesting is how India went from LPG being a luxury for the urban elite to something that fuels nearly every household kitchen in the country. In the 1960s, when Indian Oil launched its Indane brand, the idea of having a gas connection at home was novel. By the 1990s, it was slowly reaching middle-class homes in small towns. But for much of rural India, cooking meant firewood, cow dung, or coal.\n\nFor decades, the government provided LPG at a subsidized price. Initially, the subsidy was built directly into the cylinder price. But this led to leakages, diversion, and misuse. So in 2013, the government rolled out PAHAL—short for Pratyaksh Hanstantarit Labh— one of the world’s largest direct benefit transfer (DBT) schemes. Instead of selling subsidized cylinders, oil companies sold them at market price and the government deposited the subsidy directly into the customer’s bank account. The scale was enormous—over 200 million households linked their Aadhaar and bank accounts to their gas connections.\n\nThen came the GiveItUp campaign. Launched in 2015, it asked well-off households to voluntarily surrender their LPG subsidy. Reportedly, millions of consumers responded, freeing up subsidy for needy households. This was the warm-up act for what came next: the Pradhan Mantri Ujjwala Yojana (PMUY).",
    "title": "Why India’s LPG System Is Under Pressure",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-indias-lpg-system-is-under-pressure",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "When one says the Taiwanese dollar “appreciated,” it means it became stronger relative to other currencies, usually the US dollar (USD). So, for example, if it took 33 TWD to buy 1 USD last week, and that now only takes 30 TWD, the TWD has strengthened (appreciated) over the last week. Conversely, the USD has ‘depreciated’ relative to the TWD.\n\nThese movements matter a lot. A stronger currency can make a country’s exports more expensive and imports cheaper. It also affects all sorts of other money decisions — like financial flows, investment returns, and hedging strategies.\n\nTaiwan essentially constantly exports far more than it imports, especially in high-value sectors like semiconductors and electronics. This surplus means that the country is constantly accumulating foreign currencies like the USD.\n\nBut there’s a twist: unlike countries that recycle these dollars into their central bank reserves — something we do in India as well — Taiwan does something unusual. Much of this surplus foreign exchange has been channelled through its enormous life insurance sector.\n\nSee, Taiwanese life insurers are global financial powerhouses. They manage nearly $1 trillion in assets. But here’s the problem: Taiwan’s domestic capital markets are too small to absorb that much money. Its domestic bond market is tiny, the stock market is not nearly diverse enough, and local real estate is already expensive. Then where do insurers park their money?\n\nA huge chunk of Taiwan’s economy is tied up in this. According to the Financial Times, foreign investments by insurers add up to more than 60% of Taiwan’s GDP. This is why the USD-TWD exchange rate is so systemically important to the country.",
    "title": "A 6%+ jump in 2 Days – What’s pushing Taiwan’s Dollar?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/a-6-jump-in-2-days-whats-pushing",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "Now, cement may just look like a dull grey powder. But in India, it is one of the surest pulse-checks on growth: every kilometre of highway, every metro viaduct, every apartment tower and warehouse drinks it by the truck-load.\n\nUltraTech’s management came out with a nice run-down of the construction work happening across the country. They pointed to strong activity in states like Andhra Pradesh and Bihar, where road-building and infrastructure spending are picking up. At the same time, they acknowledged a temporary slowdown in urban real estate. In their words:\n\nThat’s one of the many under-appreciated ways in which climatic conditions can impact the fates of businesses. Heat waves can literally stop construction in its tracks — workers can’t pour concrete or work outdoors safely in extreme temperatures, so projects pause.\n\nAll in all, both companies are optimistic about the future. They see demand holding up — and possibly accelerating — at least once we get past this scorching summer and head into cooler, building-friendly months.\n\nUltraTech, owned by the Aditya Birla Group, is leading the expansion of India’s cement industry. After buying India Cements and Kesoram, it can now churn out 184 million tonnes of cement a year. In fact, over the last year, 57% of India’s new cement capacity was added by Ultratech alone.\n\nAnd the company’s seeing robust growth at the moment. That’s not just because of its acquisition activity, by the way. Even if you exclude its newly acquired plants, its core business still grew 10%. That’s a lot more cement – not just because of its new factories, but because of stronger demand. The company’s revenue rose to ₹22,788 crore, up 14% year-on-year.",
    "title": "What’s Powering the Cement Boom?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/whats-powering-the-cement-boom",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "I’m Krishna and this is the show where I dive into interesting comments by notable figures from across the world—whether it’s finance or the broader business world—and dig into the stories behind them.\n\nImagine you run a car company. For decades, you’ve been growing steadily, expanding your reach, and building a reputation as the country’s largest carmaker. But over the past few years, something strange has been happening. The segment that once made up nearly 40% of your sales—the small, affordable cars—has started shrinking. Not just slowing down, but actually declining.\n\nIf you’re RC Bhargava, the Chairman of Maruti Suzuki, you call it like it is. In his latest remarks, he pointed to a hard economic truth that few in the industry openly admit: most Indians simply can’t afford to buy a car anymore.\n\n“The households which have incomes above $25,000 and between $18,000 and $25,000 they are about 8%. If we go up to 12 lakh of rupees which is about $14,000 we get another 5-6% added. So about 12% households in India are above 12 lakhs income annually.”\n\nIn other words, just 12% of Indian households earn enough to even think about buying a car that costs ₹10 lakh or more. And that price tag, Bhargava says, is what it now takes to own a typical car in India—thanks to rising input costs, stricter safety and emissions regulations, and taxes.\n\nThis is the crisis at the heart of India’s auto industry. It’s not that demand has disappeared because people don’t want cars. It’s that the majority of Indian households have been priced out of the market.",
    "title": "No Buyers for Maruti, No Limits for Zuckerberg, No Path for Growth | Who said what? #20",
    "articleUrl": "https://thedailybrief.zerodha.com/p/no-buyers-for-maruti-no-limits-for",
    "date": ""
  },
  {
    "learning": "Reliance Industries just announced its results for the March quarter of FY 2025. And given its heft as one of India's largest industrial conglomerates — which sells everything from petroleum, to dresses, to sim cards — we had to take a look at what’s happening.\n\nThis isn’t just so we understand Reliance’s own business, by the way. The company’s size and presence means that any story about the fate of its business is really a story about India’s economy, while any change in its business has ripple effects across the entire Indian economy. Its results are a window into what’s happening in the country as a whole.\n\nIn the fourth quarter of FY 2025, Reliance’s overall business revenue grew to 8.8% year-on-year and 7.7% QoQ. Its ‘EBITDA’, a measure of how much profit a company makes from its core operations, grew 3.6% year-on-year and 1.5% QoQ. Meanwhile, it’s net profit — that is, its actual bottom line — rose 6.4% year-on-year and 3.1% QoQ.\n\nTo better understand what’s happening, though, let’s dive into each of their business segments. We’ll go through them in the order of their contribution to the company’s revenue, starting with the biggest.\n\nAt the heart of Reliance’s business is the O2C segment. In this segment, Reliance refines crude oil into fuels like petrol and diesel — and also makes plastics, polymers and other chemicals that go into clothes, packaging, and more. This is where the company generates all the cash that lets it chase all its other projects. In fact, this single business line contributes roughly half of the company's total revenue.\n\nIn Q4 FY25, Reliance’s O2C revenue grew 15.4% year-on-year. But its EBITDA actually fell by 10%. Why? Because while the company’s business ran as usual, its operating margin — the difference between what they pay for crude and what they earn from selling fuel and chemicals — has collapsed over the last financial year.",
    "title": "Is Reliance Building the Future? Q4 Results Deep Dive",
    "articleUrl": "https://thedailybrief.zerodha.com/p/is-reliance-building-the-future-q4",
    "date": ""
  },
  {
    "learning": "A few months ago, we tried digging into the data to understand where India’s economy was. This was right before the GDP figures for the December quarter were in, and we were trying to gain a mental picture of where things were. After digging through many dozen charts, we came up with a messy, nuanced picture: of an economy that was trudging along, resilient but not buoyant.\n\nWhat we hadn’t bargained for, back then, was that all our economic assumptions would suddenly shift. That’s precisely what has happened since. America’s historical tariffs are slated to choke trade across the world. We’re looking at a time of deep, global uncertainty. The level of economic risk, all across the world, has escalated wildly.\n\nGlobal growth will most likely weaken in the months to come. In a worst-case scenario, America, the biggest pillar of global trade, could even hit a recession this year. And that doesn’t even account for the long-term problems that could arise from the world collectively slamming the brakes on global trade. We could see an era of widespread industrial disruption and reduced investment if countries keep spiralling towards a trade policy disaster.\n\nOf course, not all of this will transmit to India. We’re relatively insulated from the global economy. We have much less to lose, right now, compared to other developing countries like Vietnam or Bangladesh. Our goods exports to the United States make up just 2.1% of our GDP. But we aren’t cut off from the world either. If the entire global economy takes a severe beating, we’ll take a bad hit as well. This is an interesting time to be observing the economy.\n\nAnd so, we’re diving into the data once again. Like the last time, this is going to be a messy, chaotic exercise. There aren’t many simple takeaways here. Nor will this tell you what American tariffs mean for the economy — mind you, none of the recent disruption would have shown up in the data just yet. At best, we have figures from March — back in the good days before America’s worldwide tariffs. That data has already turned stale.\n\nThis is more of a snapshot: one of our economy right before the chaos erupted. It is the baseline against which you should watch future developments. Let’s dive in.",
    "title": "A Quiet Shift in India’s Economic Story",
    "articleUrl": "https://thedailybrief.zerodha.com/p/a-quiet-shift-in-indias-economic",
    "date": "October 26, 2025"
  },
  {
    "learning": "Indian IT companies are hitting a rough patch. At least in the short term, the future doesn't look any brighter either. And this isn't just us speculating or echoing market experts — it's straight from the horse's mouth.\n\nInfosys isn't alone here; TCS and Wipro are feeling the heat too. Wipro's CEO, Srini Pallia, shared similar sentiments, pointing out , \" Going from FY25 to FY26, uncertainties have dramatically increased .\" He even forecasted a sequential revenue decline of between 1.5% to 3.5% for the coming quarter. ICICI Securities noted that Wipro’s guidance for Q1FY26 “is the weakest ever (except Covid)”\n\nIndustry leader TCS, meanwhile, missed its earnings estimates last week. Of course, these estimates aren’t always reliable, but yet another more indicator that things aren't exactly rosy. The stock market is reflecting this anxiety as well. While the broader Nifty 100 index has almost broken even for the year, the IT basket is down about 20% since the beginning of the year.\n\nNow, we did touch upon this issue last month , pointing out concerns around the weakening US dollar and how that could negatively impact Indian IT exports. Back then, we talked about potential economic hurdles from Trump's second run — higher inflation, slower growth, and elevated interest rates in the US — were all bad news for Indian IT. After all, Indian IT exports track the US economic growth, given how the US contributes 60-62% to the revenues for the sector .\n\nBut since then, things have gotten much trickier. Trump's latest \"reciprocal tariffs\" announcement has added massively to the uncertainty. And now, with recent earnings and commentary from the big three — TCS, Infosys, and Wipro — we're getting a clearer picture of what’s happening directly from the companies themselves.\n\nSo think of this piece as an extension of our earlier conversation. The fate of the sector looks the same to us — ultimately, things aren't looking good. But now, we've got even more clarity on why exactly that's the case. And as always, we're here to break it down for you.",
    "title": "What’s Going Wrong with Indian IT?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/whats-going-wrong-with-indian-it",
    "date": "October 26, 2025"
  },
  {
    "learning": "Hello, folks! My name is Bhuvan , and along with my wonderful colleagues — Pranav, Anurag , Krishna , Shubham , Prerana , Vignesh , Nithin , Meher and Kashish (I hesitate to call Kashish wonderful, but I guess I have no choice) — I'm involved with the YouTube channel and series of newsletters that go under Markets by Zerodha .\n\nThis channel started really on a whim. It was born out of a discussion we had internally with Nithin Kamath . He said that there isn't any single good daily podcast in India that gives you a sense of what's happening in the financial markets.\n\nSo we started with a simple daily show. We weren’t trying to tell people about the ups-and-downs of the markets themselves — that problem was already solved by traditional financial media. The bigger problem was that many people didn't have good resources to understand why anything was happening. Nothing told them of the context in which things were happening or its historical perspective, if any, and without that, the path ahead seemed obscure.\n\nWhen we started, I had absolutely no idea how to do this. In the first few months, it was just Anurag and me writing all the stories. Anurag hated working till late, and I've spent many sleepless nights editing scripts until right before they were to go on. Thankfully, things have become much easier now, but it was all a massive learning curve.\n\nEven though it might not show, a lot of effort goes into everything you see on the Markets YouTube channel and in the newsletters. And that’s because we don’t always know what we’re talking about; we’re constantly learning on the job.\n\nThat’s our philosophy: we approach everything on this channel as people who are learning . We’re hobbyists. The world has had enough “experts”; it needs more amateur geeks and nerds who delight in learning about new things and sharing them with the world. That's how I see myself, and that's the attitude I ask all my wonderful colleagues to have when they're exploring different rabbit holes.",
    "title": "The Story Behind Markets by Zerodha: Our Journey and Future Plans",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-story-behind-markets-by-zerodha",
    "date": ""
  },
  {
    "learning": "Speaking at the ‘StartUp Mahakumbh’, he claimed that Indian start-ups needed a ‘reality check’. The sorts of businesses that Indian start-ups are entering — most of them consumer-focused, from quick commerce to healthy ice creams — weren’t really start-ups , he said; they were closer to simple, traditional businesses that didn’t push us forward as an economy. He contrasted our start-ups with the sort of deep tech startups that you see in China. We need more innovation, he said, so that it could take its businesses across the world.\n\nThis sparked a huge social media flame war, because of course it did. Start-up founders returned his charge with their own counters: Indian start-ups are doing important work ; India’s economy doesn’t yet have room for deep tech start-ups ; the Indian government is sclerotic and unconcerned ; and its unending appetite for bribes and licenses kills businesses.\n\nIndia does lag the Chinese economy; as does our deep tech ecosystem. We’re nowhere close in a head-to-head match (check out Finshots for examples of where we stand). We’ve spoken before about how China’s innovation ecosystem came about, though, and isn’t always pretty . China’s innovation strategy is deeply inefficient and frequently gamed. It pits hundreds of start-ups together in a bout of what some call “hunger games capitalism”. It is a strategy that is meant to create national champions, but at the expense of its traditional economy. At the same time, we are  serial laggards in the realm of innovation. This is a sphere where we routinely punch well below our weight. We are simply absent from some of the world’s most dynamic industrial sectors, and serially under-invest in research and development.\n\nBut why? What’s actually holding us back? For answers, we’re digging through a recent paper by Sarthak Pradhan and Pranay Kotasthane from the excellent Takshashila Institution . Here’s what we learned.\n\nThe answer, as you might expect, is  complex. There’s no single thing that guarantees innovation. There are, instead, dozens of things that matter at the same time — from what a company’s leadership is looking for, to the quality of its workforce, to the networks it’s embedded in. Here’s an indicative list of the kinds of things you should look for:\n\nThis list is only a beginning. The truth is that these factors usually play off against each other in a variety of ways. Pranay and Sarthak have this fascinating, if somewhat confusing, chart that lists out all the ways in which these different ingredients come together:",
    "title": "Why India Can’t Build the Next Apple or Tesla",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-india-cant-build-the-next-apple",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "“Give me one global Indian consumer brand that you go to any corner of the world—from Boston to Paris to Bolivia to China to Sydney—where the global consumer recognizes an Indian consumer brand for what it is. Frankly, I have struggled to find one.”\n\nWe’re a country of over a billion people, with a thriving startup scene and companies that do amazing things in IT, pharma, manufacturing—you name it. But when it comes to consumer brands that resonate globally, the cupboard’s pretty empty. You might think of TCS, Infosys, or Wipro, but those are IT service providers. They’re not the brands that someone picks off a store shelf in Berlin or walk into in New York.\n\nNow, bollywood might be known around the world. Growing up, I used to think Maagi or Dairy Milk is an Indian company but how wrong was I. Even brands like Zomato or Ola, which have tried going international, haven’t really cracked it.\n\nThe reason behind this according to him lies in comfort and protectionism. Indian companies can thrive within the domestic market—one of the biggest in the world—and that removes the urgency to build truly global operations. Why battle it out on a global scale when you can make a healthy margin selling to Indians?\n\n“We are a very protected country and people are very comfortable in the comfort of a 1.4 billion people home market... Why should I really try to become a global brand? I'm making enough money.”\n\nMost of us, i.e. Indian investors tend to build portfolios heavily concentrated in Indian equities. That might feel diversified—after all, we might own stocks in banks, pharma, tech, and consumer—but that’s diversification within just one country . From a global investing standpoint, that’s not enough.",
    "title": "Who said what about No Global Indian Giants, Bank Profit Illusions & India’s Trade Truth",
    "articleUrl": "https://thedailybrief.zerodha.com/p/who-said-what-about-no-global-indian",
    "date": ""
  },
  {
    "learning": "A recent ICRIER report got us thinking about this question. This is, after all, a foundational problem for our economy. Small businesses — or technically, “Micro, Small and Medium Enterprises” (MSMEs) — are deeply important to the India growth story. Really, they’re the heart of our economy. They make for 16.5% of the value our economy creates, employ around 120 million people, and form the industrial underbrush for the rest of our economy. If these enterprises can’t grow, there’s a ceiling to how far India can grow as a whole.\n\nAnd that’s precisely what we’re seeing. Despite reforms, schemes and sustained economic growth, most of our MSMEs can’t seem to capture much of India’s economic upside. They’re overwhelmingly small and underpowered. This fact explains so many of our economy’s problems: from why we’re always short on jobs, to why we can’t seem to establish a manufacturing presence.\n\nThat’s a huge question, frankly, and we can’t promise we have all the answers. But from the little we can see, our small businesses are trapped under a mountain of structural issues. At the same time, as we shall soon see, there are also reasons for hope.\n\nWhy so? The biggest problem, perhaps, is just how small these businesses are. A vast majority of India’s small businesses are micro enterprises; that is, they employ fewer than 10 people.\n\nNow, it’s hard to really keep a track of MSMEs, given how little data we have. The most professional of these businesses are registered on the government’s Udyam portal, and that data’s quite revealing. 98% of the businesses on the portal are micro-sized. While we don’t know much about the rest, it’s unlikely that they’re any bigger. In fact, 85% of MSMEs that haven’t registered on Udyam are own-account workers. That is, they employ nobody at all.\n\nThe small size of these businesses bleeds their productivity. While bigger firms are more productive than small ones anywhere in the world, simply because of their ‘economies of scale’, India faces a particularly perverse version of this problem. India’s small businesses are only a quarter  as productive as large ones. That is, each worker in a large business creates four times as much value as those in smaller ones. Things are even worse in manufacturing, where small businesses are just 14% as productive as large ones.",
    "title": "Why Do Small Businesses in India Struggle to Grow?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-do-small-businesses-in-india",
    "date": ""
  },
  {
    "learning": "“Our research suggests that five to ten percent of middle-class India is in a debt trap. A debt trap is when people with modest incomes have taken on multiple loans which they’re never going to be able to repay… it’s reasonably easy to show that there are five to ten percent of middle-class Indians who’ve taken on multiple loans that they’ll never be able to repay.”\n\nSee, Saurabh when talking about middle class—he’s going strictly by income data. According to him, based on income tax filings, India’s middle class includes households earning between ₹5 lakhs and ₹1 crore per year. That’s a pretty wide range, but what’s interesting is that this group makes up around 40 million families and contributes roughly 70% of the country’s income tax collections. So, these are people like us—most people reading or listening to this probably belong to.\n\nThe term “debt trap” is thrown around a lot, so let’s break it down into what it really means. Imagine someone earning ₹12–15 lakhs a year. But then you layer on a home loan, a car loan, one or two personal loans, and a few active credit cards. That by itself isn’t unusual—many families use loans to build assets or manage large expenses. The problem starts when income growth stalls while expenses rise, and the only way to make ends meet is by borrowing more. Or worse, using one loan to repay another.\n\nAt this point, your debt isn’t helping you grow—it’s just helping you survive. That’s the classic definition of a debt trap. And Mukherjea believes that up to 10% of middle-class families are already in this situation.\n\nNow, some may argue that 5–10% doesn’t sound like much. But when you remember we’re talking about a middle class that covers around 150 million people, even the lower end of that estimate translates to several million households. That’s not a small problem.\n\nThat’s nominal income. When you adjust for inflation, incomes have actually gone down. So while the cost of living has moved steadily upward—tuition fees, healthcare, rents, groceries—household earnings haven’t kept pace.",
    "title": "Who said What about India’s middle class, India’s growth, US-China war and more",
    "articleUrl": "https://thedailybrief.zerodha.com/p/who-said-what-about-indias-middle",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "On March 24, 2025, the Payments Council of India (PCI) — a body which represents over 180 digital payment companies, including the likes of PhonePe, Google Pay, Razorpay, BharatPe, and CRED — wrote directly to Prime Minister Narendra Modi . They wanted the government to reconsider an old demand — of removing the “zero Merchant Discount Rate (MDR)” policy currently applied to UPI and RuPay debit card transactions.\n\nIf you’ve kept tabs on the payments space, this is probably no surprise to you. You see such demands crop up every once in a while, only to be shot down by the government. But despite the obvious political friction around this, they keep coming up again. And that should tell you something. Because at stake is the sustainability of our entire digital payments space.\n\nSee, when you use a shop’s QR code to make a payment, you aren’t somehow teleporting your cash directly to a merchant. Although the payment process (usually) feels effortless, it’s only possible because of a giant, sophisticated, interconnected system.\n\nBehind the nifty little interface you see on your UPI app screen, the National Payments Corporation of India (NPCI) has stitched together an entire ecosystem of financial entities. It links together bank accounts, payment apps, and layers of infrastructure — all of which need to come together for your money to move to someone else.\n\nEvery time you hit ‘send,’ you kick off a series of events over the next few milliseconds. Your UPI app talks to your bank. Your bank checks if you have enough balance. NPCI steps in to route the request. The receiver’s bank gets the signal, confirms the credit, and the app shows ‘Payment Successful.’ All of this unfolds instantly. While you see a giant green tick on your screen, what you don’t see is a chain of financial institutions clicking together perfectly.\n\nNaturally, running this system isn’t cheap. Everyone involved incurs substantial costs, from building the necessary digital rails, to combating fraud, to ensuring server uptime, to innovating and scaling their parts of the system.",
    "title": "Will UPI Stay Free Forever?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/will-upi-stay-free-forever",
    "date": ""
  },
  {
    "learning": "Here’s an interesting headline we came across recently:  Audi to cut 7,500 jobs in Germany to become more efficient . Now, on the face of it, this might look like a normal restructuring that a company might do to improve their numbers. But it marks a broader trend: Germany’s famous automotive industry — famed for making cars that you dream of owning someday — is in deep trouble.\n\nYou see, the world’s big three auto manufacturers — Volkswagen (which owns Audi), BMW, and Mercedes — all hail from Germany. This industry is extremely important for Germany’s economy. It accounts for a huge portion of Germany’s GDP — roughly 5% — and more than one-tenth of its exports.\n\nThe industry is also a big employer. Not only do automotive manufacturers employ hundreds of thousands of people on their own rolls, but they also sustain a massive supply chain, indirectly creating millions of more jobs. In all, 5.3 million German jobs are dependent on the automotive sector. For context, that is one in every seven of the country’s jobs.\n\nAt its peak, Germany was producing over 6 million cars annually, with exports flooding into markets worldwide, from the U.S. to China. Chances are, every really rich person you know owns one of those cars. For years, everything was going right. Profits were pouring in, the brands were expanding, and demand was strong.\n\nWhen the world reopened, German automakers found themselves in a vastly different reality. Their dominance was slipping. These job cuts, perhaps, are a result of this\n\nNow, we can’t point to a single specific reason why the German auto industry is in deep trouble. The landscape is complex, and we aren’t fans of ascribing single causes to complex events. Even so, we read through a bunch of things, and this is our best understanding of everything that might be relevant.",
    "title": "The Fall of Germany’s Car Giants?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-fall-of-germanys-car-giants",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "If you’ve been following us for a while, you know we’re obsessed  with China. So when, a few days ago, the American economics blogger Noah Smith wrote about how China was “ trying to kneecap Indian manufacturing ”, we figured we just had to bring this discussion to you.\n\nThe basic argument is that most countries invest abroad as they climb up the economic ladder. As countries become rich, costs rise, and their enterprises look abroad to other countries where they can diversify. Those countries, in turn, see their own periods of growth and foreign investment. This almost resembles flying geese:\n\nOnly, there’s an explicitly geopolitical facet to their investments — they seem to be pursuing some sort of “industrial diplomacy”. That is bad news for India. China sees us as both a geopolitical rival and a potential economic threat . This is why, the argument goes, China is blocking both investments and technologies from coming into India.\n\nUntil last year, we were in a much better position. We got a lot of support from the United States, which gave us the hope that we could counter-balance a China that was throwing its weight around. But America has now abruptly changed its economic trajectory. Without its support, the stakes for us are suddenly a lot higher.\n\nThat’s why we’re curious about where India-China relations currently stand. Do things still look bad? Are we openly antagonistic? Are we specifically being targeted as rivals to China? Now, we’re no experts on the topic. Geo-economics is a complex, multi-faceted chess game, and we’re not even close to seeing the entire board. But this is our best sense of how things look.\n\nA decade ago, Chinese firms were deeply interested in entering India. Chinese firms were steadily increasing their presence in India. India’s major industrial hubs were seeing ever-increasing Chinese investments. For instance, major Chinese mobile phone manufacturers — like Oppo, Vivo, and Xiaomi — had opened up major operations in India.",
    "title": "Why China Won’t Let India Rise?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-china-wont-let-india-rise",
    "date": ""
  },
  {
    "learning": "The company made two big splashes recently. First, Airtel announced it was partnering with Starlink. A few hours later, just as everyone thought Airtel had pushed ahead of Reliance in this race, Jio made a similar announcement.\n\nSo… what’s happening? Why are we suddenly seeing all this activity out of nowhere? Frankly, we don’t have any real answers. There are very few details out there in the public domain, and we aren’t sure if the few details we’ve seen give us any real clarity. So, instead, we’re just going to lay out everything we know and ask all the questions we have in mind.\n\nSee, right now, you’re reading this on the internet. That tells us a few things about you. For one, you have internet access. That means someone has invested money into putting up a mobile tower or an optical fibre network somewhere around you. And if that’s the case, you probably aren’t the only customer they’ve made this investment for. You probably live in some reasonably well-populated area with hundreds of other internet users.\n\nNow, imagine that wasn’t the case. You lived in some remote, far-flung part of the country — some small village in the middle of nowhere with no power or connectivity. There was nobody around you, and so, no telecom company thought of trying to get any internet to you — no fiber cables, no cell towers, nothing.\n\nIs there a way you could still get online — and perhaps read your favourite daily newsletter on the markets ? Well, there’s one way. You could get a signal straight from space.\n\nThis is what Starlink makes possible. It has thousands of small satellites orbiting the Earth, which send super-fast internet straight down to anyone with a dish about the size of a pizza box. You don’t require cables or really, any major infrastructure — if you have a clear view of the sky, you can get an internet connection.",
    "title": "Jio, Airtel & Starlink – What’s Cooking?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/jio-airtel-and-starlink-whats-cooking",
    "date": ""
  },
  {
    "learning": "See, in banking, or really anything that’s related to finance, trust is everything . It’s the product you sell, in a sense. You don’t deposit money in a bank because they have some superior way of storing money; you do it because you trust that your money will be safe. Investors buy bank stocks for the same reason — they believe the numbers on the balance sheet are accurate. And that’s why, when a bank suddenly says, “Oops, we found an accounting issue,” the market doesn’t take it lightly.\n\nNow, as far as we can see, the bank isn’t in danger of going under. But the problem is simple: if a bank miscounted something as fundamental as its derivatives exposure for years, how do we know it hasn’t miscounted something else? That’s possibly why investors panicked.\n\nMaking matters worse, IndusInd Bank’s CEO, Sumant Kathpalia, was up for reappointment right about now. The board wanted him to stay for three more years. The RBI gave him only one. It’s hard not to see a connection. While the regulator didn’t outright say, “We don’t fully trust you,” with a one-year extension instead of the standard three, it seems like the RBI is hedging its bets.\n\nPut all of this together, and IndusInd suddenly looks like a bank that’s stable on paper but that has just lost the trust of both regulators and the market. So, what exactly happened? What was this accounting mistake? And is IndusInd actually in trouble?\n\nHere’s our best take on what’s going on. Now, before we dive deeper into this, FYI: this story is still unfolding. We’ve already edited it a bunch of times to keep up with the news that’s come in. We’re sharing what we know so far based on what’s publicly available. As more details emerge, things might look very different.\n\nJust like you and us, banks trade, too. They have ‘proprietary trading desks,’ or ‘prop desks,’ where they trade using their own money. Banks have various reasons for trading—some prudent, like hedging risks, and others purely speculative, aiming to profit from market movements.",
    "title": "IndusInd Bank Faces a Crisis!",
    "articleUrl": "https://thedailybrief.zerodha.com/p/indusind-bank-faces-a-crisis",
    "date": ""
  },
  {
    "learning": "See, late in 2023, the RBI was worried about how much credit Indian banks were giving out. Loan growth was hitting levels we’d never seen before — outstripping the speed at which banks were bringing in deposits. So, in November 2023, it pulled the brakes . It increased the ‘risk weights’ on loans to NBFCs and on consumer credit. (Don’t worry, we’ll get to what ‘risk weights’ are in a second.)\n\nThis worked a little too well (which we touched upon a couple of months ago ). Banks became deeply cautious about lending to NBFCs and micro-lenders, who came under a severe funding crunch. A large number of people suddenly found it hard to access finance.\n\nFast forward to February 2025: the RBI is in a much more benign mood. It cut its policy rate earlier this month so that more money would enter the system. And now, it’s rolled back some of the high-risk weights it had put in place in 2023.\n\nMake no mistake: this is a big decision. But you’re possibly wondering what it even means. And so, today, we’re going to break it all down. We’ll try answering three questions. One, we’ll look at what RBI’s risk weights actually do. Two, we’ll see what the decisions of November 2023 did to Indian lending. Finally, we’ll look at what one should expect after this re-think. Let’s dive in.\n\nWhenever we talk about banking on Markets , we often come back to one idea: banks create money when they lend it to someone. To a bank, all credits and debits are just entries in a register. When they give you a loan, they don’t rummage through people’s bank accounts to find that money. They just make it out of thin air — with an entry on a ledger.\n\nSee, while banks can make money out of nowhere, they legally need to meet a ‘capital adequacy ratio’. Basically, for every Rupee they loan out to someone, they need to set aside some of their own capital. That capital is hard to come by. It either belongs to the bank’s shareholders or is borrowed at a cost. This makes sure that banks don’t recklessly keep creating money out of nothing. Every time they do so, they have to put their own skin in the game.",
    "title": "Why RBI Is Making Borrowing Easier Again!",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-rbi-is-making-borrowing-easier",
    "date": ""
  },
  {
    "learning": "The cement sector’s third-quarter results are out. Today, we’ll look at two of India’s largest cement producers — UltraTech Cement and Adani Cement. Together, these giants account for roughly half of the country’s total cement capacity — with UltraTech touching around 170+ million tonnes per annum (MTPA), while Adani Cement approaches 90 MTPA.\n\nCement is an interesting sector. For one, it’s absolutely vital for the broader economy. It is the foundational substance for real estate, infrastructure, roads, and nearly every major construction project in the country. When we examine cement’s performance, we’re effectively taking the pulse of infrastructure spending, housing demand, and economic health.\n\nUltraTech Cement, part of the Aditya Birla Group, is India’s largest cement manufacturer. It’s also among the top five cement players globally (excluding China). The company has a massive footprint across all key markets — North, Central, West, and an expanding presence in the South.\n\nAs of Q3 FY25, UltraTech’s total cement capacity stands at ~171 MTPA, following two major acquisitions that it completed recently — India Cements and Kesoram Cement. The company aims to cross 200 MTPA by FY27.\n\nDespite that volume strength, however, the company’s net profit for the quarter actually declined. At ₹1,470 Cr, it was 17% lower than last year’s figure. That said, compared to the previous quarter, profits rose by 79%.\n\nFor one, the company saw spikes in the cost of raw materials — specifically, fuel and freight costs. The company spent much of 2024 grappling with expensive pet coke, thermal coal, and diesel. This brought its margins down. As per Chief Financial Officer Atul Daga, however, things started to improve toward the end of the quarter, with the average fuel cost dipping from about ₹1.84 per kcal in the previous quarter to ₹1.76.",
    "title": "Cement giants getting even bigger?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/cement-giants-getting-even-bigger",
    "date": ""
  },
  {
    "learning": "The Q3 results for India’s biggest hospital players are out. Today, we’re looking at two of the biggest names in private healthcare — Apollo Hospitals and Fortis Healthcare. Both had great quarters. They both saw huge jumps in profits, increasing EBITDA margins, better occupancy rates, and more revenue per occupied bed.\n\nIf this sounds like Greek and Latin to you, don’t worry. We know we haven’t covered this sector before. So, before we dive into the numbers, we’re going to step back and understand India’s hospital sector. By the end of this, you’ll know how hospitals make money, what drives their profitability, and why some hospitals perform better than others. Let’s dive in.\n\nPrimary care comes at the first point of contact — like your regular doctor, who handles routine illnesses. Secondary care includes local hospitals and nursing homes, which handle more serious medical conditions, but typically don’t perform ultra-complex surgeries.\n\nTertiary care is where big hospital chains like Apollo and Fortis operate. These offer advanced, multi-specialty treatments like organ transplants or cardiac surgeries. This is where the biggest revenue opportunities exist. These hospitals cater to insured patients, corporate tie-ups, cash-paying individuals, and international medical tourists, all of which can bring in substantial chunks of money. This is the space in which most listed players operate.\n\nOPD refers to walk-in consultations, diagnostic tests, and minor treatments — where the patient does not get admitted. IPD patients, on the other hand, are admitted for surgeries, ICU stays, or long-term treatments. They incur bed charges, surgical fees, ICU costs, medical consumables, and pharmacy sales, all of which are high-margin revenue streams. Naturally, the latter generates the most revenue. While OPD accounts for 75-80% of hospital visits, IPD patients contribute 70-80% of hospital revenue.\n\nBecause of how crucial in-patients are to a hospital’s revenue, the most critical metrics, when you’re looking at a hospital, revolve around admitted patients. These directly determine how well a hospital is monetizing its infrastructure. Accordingly, beyond mere revenues, there are specific numbers that people often look at:",
    "title": "Hospitals deliver strong results",
    "articleUrl": "https://thedailybrief.zerodha.com/p/hospitals-deliver-strong-results",
    "date": ""
  },
  {
    "learning": "The consultation paper on algorithmic (algo) trading, which SEBI released in December , laid the groundwork for changes aimed at safeguarding retail investors while enhancing accessibility to algo trading. We had covered this in detail when the consultation paper was first released, highlighting SEBI's concerns about the risks posed by unregulated platforms and the growing interest in algo trading among retail investors. Now, with the release of SEBI's final framework , most aspects remain similar to those outlined in the original consultation paper. Here’s a closer look at what has been finalized.\n\nBefore that, let’s quickly explain what algo trading is. Algo trading uses computer programs to automatically buy and sell stocks based on predefined rules. SEBI's goal is to strike a balance between allowing retail participation in algo trading and ensuring market integrity. Algo trading, which currently accounts for about 70% of market volume (mostly driven by institutional players), is becoming more accessible to retail investors, thanks to broker-provided APIs and algorithm platforms.\n\nOf course, there were always ways for retail traders to automate their trades using things like Excel macros, scripting actions on the web platform, and, more recently, broker APIs. However, none of these modes of automation were recognized as legitimate means for order placement by the regulators until now. With this circular, SEBI has officially recognized the use of APIs for retail algo trading. APIs (Application Programming Interfaces) allow tech-savvy traders to create custom programs for placing trades. However, this access now comes with stricter security and monitoring. Brokers are required to:\n\nAlgo providers—platforms offering ready-made trading strategies to retail investors—are also being formally recognized. While SEBI won’t regulate them directly, exchanges will empanel and supervise these providers. Brokers, meanwhile, are tasked with performing due diligence before partnering with them.\n\nGiven that most retail algorithms operate at low frequencies (placing a limited number of trades per second), they don’t pose significant risks to the market. Therefore, SEBI has exempted these strategies from mandatory exchange registration unless they exceed a threshold number of orders per second. This allows many tech-savvy traders to automate their strategies without burdensome compliance procedures.\n\nWhite Box (Execution) Algos These are transparent algorithms where users can fully see and understand how trades are executed. Since their logic is disclosed and easily replicable, they require less regulatory scrutiny. SEBI has instructed exchanges to establish a fast-tracked registration process for these algos to avoid delays in approval.",
    "title": "SEBI's latest algo trading rules",
    "articleUrl": "https://thedailybrief.zerodha.com/p/sebis-latest-algo-trading-rules",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "How many super-powers does the world have? There’s definitely one: the United States. There’s also an obvious superpower-in-waiting: China. Chinese people may not have the same standard of living as their Western peers, but when it comes to national power, the country punches well above its weight.\n\nOn paper, Europe should have everything going for it. With a population of 440 million, it represents 17% of global GDP. It boasts a variety of heavily industrialized economies, and governments that can provide stellar outcomes in health, education, and climate policy. In the early 2000s, it was bigger than both, the United States and China, at least on a purchasing-power-parity basis.\n\nYet, today, it lags both as a distant third. It has a muted international presence, and declining clout. So, today we ask: why has a continent-sized economic bloc with so much potential fallen so far behind?\n\nWhile ‘neoliberalism’ has come to become a catch-all term for whatever people hate about capitalism, at its core, it believes in four freedoms : the free movement of people , goods , capital and information . This comes from a fundamentally cosmopolitan outlook, where “societies” and “nations” mean little, and all the world’s people are the same — they’re just competing to buy and sell things from each other. Everything else is a distraction. In this view, the world’s governments would slowly stop trying to fight each other, or push for any national priorities. They’d recede from people’s lives and eventually become mere providers of key infrastructure.\n\nIn this new regime. Europe was conceptualised as a ‘common market’. While countries still had autonomy over ‘provincial’ matters like education or defence, they ceded a great deal of control over economic aspects of policymaking. Everything from trade, to competition, to monetary policy was now to be run by a continent-wide bureaucracy, based on neutral principles.\n\nThis structure had its limitations. The Eurozone debt crisis was a product of these limitations. European countries no longer controlled their own currencies, and had strict limits on what their governments could spend. And so, when a crisis came about, they didn’t have the tools to respond. Many countries on the continent’s periphery — like Portugal, Italy, Greece and Spain — were hurt terribly by this lack of control.",
    "title": "Is Europe a lost cause?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/is-europe-a-lost-cause",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "I’m new to the markets. Most of the things that experts, commentators, or even my boss say tend to go over my head. This show is partly my selfish attempt to learn the nitty-gritty of markets while sharing whatever I pick up along the way. And one term I keep hearing is this: “Markets are overvalued.”\n\nSanjeev Prasad, MD of Kotak Institutional Securities wrote in a research report about markets being overvalued and it was a digestible read. When I say digestible, I mean it didn’t feel like Greek or Latin. He bluntly titled one section: Comedy—absurd valuations for so many sectors and stocks even now.\n\nPrasad used charts to illustrate how “narrative” stocks are trading at ludicrous price-to-earnings (P/E) ratios. For the uninitiated, P/E is a quick and dirty metric to gauge how much investors are willing to pay for a company relative to its earnings. It’s a handy tool, but it has its limits.\n\nHe says this: In our view, many ‘narrative’ stocks have a long way to fall, based on the true value of such companies. Many of them have corrected sharply in the past 3-6 months, but most are trading at absolutely ludicrous valuations\n\nBy \"narrative,\" he refers to situations where valuations and growth expectations are driven more by compelling stories about future potential rather than by current financial performance. For example, this is often seen in sectors like EMS and capital goods.\n\nIn our view, the extreme euphoria among non-institutional investors has resulted in (1) steep increase in stock prices of mid-cap. and small-cap. stocks over the past 15 months….(2) distended valuations across sectors",
    "title": "Who said what about overvalued markets, smuggling cigarettes, achieving AGI and the world ending",
    "articleUrl": "https://thedailybrief.zerodha.com/p/who-said-what-about-overvalued-markets",
    "date": ""
  },
  {
    "learning": "DMart, as we all know, is one of the largest value retail chains in India. Their quarterly numbers just came out, and there’s been a lot of buzz about it—and rightly so, considering how big they are. With a market cap of over ₹2 lakh crore and a price-to-earnings (PE) ratio of more than 80, they’re a major player. But instead of diving straight into the results, we thought it’d be better to first look at DMart’s business model and what makes it tick.\n\nDMart follows the “Everyday Low Cost - Everyday Low Price” (EDLC-EDLP) model. This means they focus on procuring goods at the most competitive prices, achieving efficiency in operations and distribution, and passing those savings on to customers by offering consistently low prices. In short, they deliver value for money in a way that keeps customers coming back.\n\nAnother part of their strategy is selling their own products, known as private labels. These private labels offer better margins because DMart controls the manufacturing process and cuts out the middlemen.\n\nThe cost savings from all this are passed directly to customers. It’s not about flashy discounts during sales—it’s about keeping everyday prices so low that people know DMart is the best place to shop.\n\nBut that’s not the only way they save money. DMart owns most of its stores instead of renting them. Renting retail space, especially in metro cities, can be very expensive. By owning their properties, DMart protects itself from rising rental costs. Their stores are also designed to maximize space, packing in as many products as possible while keeping costs low. This allows them to sell more while spending less.\n\nAnother key part of DMart’s strategy is its cluster-based expansion. Instead of opening stores randomly across the country, they focus on growing in specific regions, one cluster at a time. This approach helps them streamline operations, improve supply chain efficiency, and build brand loyalty in each area. It’s a deliberate, slow-and-steady strategy that ensures they grow sustainably without overstretching.",
    "title": "Here's how DMart works",
    "articleUrl": "https://thedailybrief.zerodha.com/p/heres-how-dmart-works",
    "date": ""
  },
  {
    "learning": "We all know how confusing finance and economics can sound. Sometimes, it feels like experts are just tossing around big words. That’s why we’re starting “Stupid Questions” : a safe space to ask your simplest questions—no matter how basic they might seem.\n\nIf you’ve ever wondered what a very commonly-used word really means, or why something matters, share your questions here . We’ll do our best to explain everything in a way that actually makes sense. Remember: There are no stupid questions - only honest ones!\n\nFirst, let’s talk about who would feel the biggest impact. According to the analysis, electronics and machinery would take the hardest hit. Why? Right now, about 27% of all electronics imported to the US, and 18% of the machinery comes from China. Here’s the interesting part—despite past trade tensions, many consumer electronics like phones and laptops were mostly spared from tariffs. The reason? There just weren’t enough alternative manufacturers that could match China’s ability to produce on such a large scale.\n\nThe numbers are even more eye-opening in other sectors. China currently supplies 75%—yes, three-quarters—of America’s toys and sports equipment imports, 40% of the footwear, and about 25% of the textiles. According to the Peterson Institute, a 60% tariff on these goods would almost certainly mean higher prices for American consumers.\n\nBut there’s another layer to this that’s even more concerning. The report points out that many of these imports aren’t just things we buy at the store—they’re also critical parts used by American manufacturers. So when we’re talking about tariffs on machinery and electronics, we’re really talking about making it more expensive for US companies to compete on a global scale.\n\nAnd what about our neighbors? The Peterson Institute also looked at what might happen if the US imposed 25% tariffs on goods from Mexico and Canada. This could cause major disruptions because our manufacturing systems are so closely connected. Take the auto industry, for example—parts often cross the border several times during production. Adding tariffs at each step would make the whole process a lot more expensive.",
    "title": "The Silent Threat of Tariffs: Are We Ready?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/the-silent-threat-of-tariffs-are",
    "date": ""
  },
  {
    "learning": "Happy New Year, everyone! It’s been two weeks since our last episode. And we know by now you might have even forgotten the existence of this show but Krishna, the host, has to show that he did some work during the appraisals so he’s back with another edition of Who said what.\n\nFor those of you reading it for the first time, welcome! This is the show where he takes the most interesting quotes from leaders, policymakers, and industry giants, and peel back the layers to uncover what’s really being said—and, more importantly, what’s not.\n\nIt shows 22 years of zero returns for diamonds. Let that sink in—22 years. Over two decades, diamonds as an investment have basically gone nowhere. And yet, for most of that time, we’ve been told by marketing campaigns, hello, De Beers, that diamonds are the ultimate luxury, the pinnacle of value, something that’s “forever.”\n\nLet’s rewind. De Beers practically built the modern diamond industry with its genius marketing. “A Diamond Is Forever” wasn’t just a tagline—it was a way to convince people that diamonds were rare, precious, and a must-have for every engagement ring. And for a while, it worked. But here’s the thing about diamonds: unlike gold, which has universal liquidity, diamonds don’t have a reliable resale market.\n\nThese diamonds are identical to natural ones in every way—chemical structure, physical appearance, everything. But they cost a fraction of the price. For buyers, it’s a no-brainer. Why spend ₹3–4 lakh on a natural diamond when you can get a lab-grown one for ₹50,000? Add to that the fact that lab-grown diamonds are marketed as “sustainable” and “conflict-free,” and you start to see why they’re becoming so popular, especially with younger buyers​.\n\nThis shift to LGDs is hitting traditional players hard. Le us take the example of DeBeers again because they had to do something they had never done before— CUT PRICES . They’ve been forced to cut diamond prices by up to 15% this year—a huge deal for a company that usually tries to keep prices steady at all costs. They’re also stockpiling rough diamonds—$2 billion worth, their largest inventory since 2008—hoping demand will bounce back",
    "title": "Who said What About diamond prices, Indian startups, SBI deposits, and India's steel imports | #4",
    "articleUrl": "https://thedailybrief.zerodha.com/p/who-said-what-about-diamond-prices",
    "date": ""
  },
  {
    "learning": "We’ve been writing a lot about the banking sector over the past few days, and honestly, We were getting bored. So, we decided to switch gears and dive into something more exciting. Today, let’s talk about a sector in India that’s creating quite a buzz: the office real estate market—specifically, co-working spaces.\n\nThere’s a flurry of DRHPs (Draft Red Herring Prospectuses) popping up, with some highly anticipated listings from co-working companies. There’s even talk about WeWork India considering an IPO again . On top of that, major investors are pouring money into the flexible office space market, betting big on its potential.\n\nLet’s start with the big picture. India’s commercial real estate market—known as CRE—has been on a roll. In the top seven or eight cities—like Bengaluru, Mumbai, the National Capital Region, Chennai, and Hyderabad—there are about 650 to 700 million square feet of Grade A and Grade B office space available.\n\nTo give some context, “Grade A” offices are top-tier buildings with premium facilities and modern designs. “Grade B” offices, while decent, usually offer slightly lower-quality construction, fewer amenities, or less desirable locations.\n\nSo, why all the excitement? India is a global hub for IT services, banking and finance, and a fast-growing startup scene. Companies are expanding, and foreign investors like Blackstone and Brookfield are pumping in a lot of money into commercial properties.\n\nHow big is this sector? Estimates suggest the total commercial real estate market is worth around $45–50 billion, growing at a steady 8–10% annually. That’s solid growth, especially given the ups and downs we’ve seen in recent years.",
    "title": "Why Co-Working Spaces are Taking Over India’s Office Market",
    "articleUrl": "https://thedailybrief.zerodha.com/p/why-co-working-spaces-are-taking",
    "date": "October 26, 2025"
  },
  {
    "learning": "But before I get to that, let me set some context. One of the reasons we started Zerodha Markets was the lack of quality financial content about Indian markets, which bothered us a lot. So, we all got together and said, “Let’s do something about it.”\n\nThe response has been phenomenal, to say the least. Every week, tens of thousands of people watch and read The Daily Brief , Beyond The Charts , Who Said What , It’s the Economy, Stupid , and The Big Perspective . Honestly, I still can’t wrap my head around the response. If someone had told me this initiative would be so successful when we launched, I would’ve asked if they were smoking some really good “desi maal” imported from the cold, hilly regions of North India.\n\nGiven how much this initiative has grown, we’ve been brainstorming about how we can be even more useful to all of you. I mean that sincerely. We love spending time learning about weird and fascinating things and then geeking out by explaining them to you. We’d really like to do more of that.\n\nBy community, I mean a clean, safe space where people can interact with finance geeks, nerds, newbies, and experts. Think about it—if you have an embarrassing finance question, want quality advice on finance careers, or just want to bounce some insane ideas off someone, do you have a good circle of people you can turn to? (ChatGPT doesn’t count.) We think some of the other people reading this post could be that circle for you.\n\nWe’ve decided not to do anything until we’re clear about what we want to accomplish. This only makes sense if we identify a genuine, well-defined problem that such a group could solve. Without that, “building community” is just a hacky corporate trick to lure more customers—and that’s not what we’re here to do.\n\nIt’s a new year, and that means most of us will be making resolutions. One common resolution is to read more. Maybe we can help with that.",
    "title": "Let's build a reading habit together!",
    "articleUrl": "https://thedailybrief.zerodha.com/p/lets-build-a-reading-habit-together",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "SEBI has proposed a new framework to make algo trading more accessible for retail investors while keeping the market safe and fair. This move comes as more retail investors are starting to use algo trading, and several unregulated algo platforms have popped up, often promising unrealistic returns.\n\nTo give you a quick idea, Algo Trading uses computer programs to automatically buy and sell stocks based on set rules. For example, an algorithm might be set to buy a stock if its price goes above ₹100 and sell it if it drops below ₹95. This removes the need to watch the markets constantly and ensures trades happen quickly. In reality, though, these algorithms can get very complex.\n\nThe big advantages of algorithmic trading are speed and discipline. Algorithms can process huge amounts of data and place trades in milliseconds—much faster than any human could. Plus, they follow the rules without letting emotions get in the way.\n\nIn India, algo trading makes up about 70% of the total market volume. That sounds like a lot, right? But most of this comes from big players, like high-frequency traders, not retail investors.\n\nBlack Box Algos : These are proprietary and opaque, mostly used by institutions. These will face stricter rules. Algo providers will need to register as research analysts and keep detailed records of their operations.\n\nRetail investors who create their own trading algorithms and use broker APIs must register these algorithms with the exchange through their broker. These APIs follow the same risk management rules and rate limits as broker's trading platforms, ensuring that a large number of orders won’t compromise market integrity. One of the biggest hurdles in the past was the need to register every strategy and change in strategy to be able to automate trades. With this gone, automated trading becomes more accessible to the public.",
    "title": "SEBI has something to say about algo trading",
    "articleUrl": "https://thedailybrief.zerodha.com/p/sebi-has-something-to-say-about-algo",
    "date": ""
  },
  {
    "learning": "At first glance, not much—hospitality, cricket, stock markets, and beer seem like a mixed bag. But here’s the twist: they’re all public companies whose shares are hot commodities in the unlisted securities market.\n\nCompanies looking to raise large sums of capital often consider going public through an Initial Public Offering—an IPO. This lets them tap into a broader pool of investors but also means stricter regulatory oversight and reporting requirements—not every company’s cup of tea.\n\nBut there’s a middle ground. Some companies convert to public limited status. This allows them to raise funds from a wider base of investors without immediately listing on a stock exchange. Once these shares are issued, early shareholders—like employees, venture capitalists, or other investors—can sell their holdings privately to interested parties.\n\nInterest in this market has surged recently. The stock market boom and the buzz around startup IPOs have drawn attention, but here’s what’s really driven the uptick: the rise of electronic platforms enabling such transactions. These platforms have made it easier for buyers and sellers to connect, leading to a significant increase in activity in the unlisted space.\n\nEarlier this week, on Monday, SEBI issued a press release warning that these platforms violate the Securities Contract Regulation Act of 1956. Why? Because according to SEBI, only recognized stock exchanges can facilitate fundraising and trading for listed or “to-be-listed” entities. SEBI has cautioned investors against dealing or sharing any sensitive personal details with these platforms.\n\nLook, India boasts one of the best investor redressal mechanisms in the world, thanks largely to SEBI's robust regulatory framework. However, transactions on these platforms happen outside SEBI’s purview, which means that you’ll have no legal recourse if something goes wrong. These platforms act as matchmakers, taking orders from buyers and sellers and handling the transaction themselves. But, there’s a lack of transparency in how prices are determined.",
    "title": "Before you invest in unlisted shares, read this!",
    "articleUrl": "https://thedailybrief.zerodha.com/p/before-you-invest-in-unlisted-shares",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "It’s December—the time of year when global research firms start sharing their predictions and outlooks for the upcoming year. Let’s be honest, predicting the future is tricky, and things rarely go exactly as planned. Like the famous baseball player Yogi Berra once said, “It’s tough to make predictions, especially about the future.”\n\nThat said, these reports often have valuable data and insights worth exploring. So, we took a deep dive into the outlooks from major investment banks, asset managers, and brokers to pick out the most interesting highlights.\n\nAs we’ve discussed = about in a recent episode of Beyond the Charts , high-frequency indicators are pointing to a slowdown in India’s economic growth. This was evident in the September quarter’s corporate earnings, where several companies reported results that fell short of expectations. So, it’s not surprising that India’s GDP growth for the second quarter of FY 2024-25 came in below estimates.\n\nThat doesn’t mean everything will be smooth sailing. Inflation has been on the rise over the past few months, driven mainly by higher food prices caused by weather-related disruptions. It’s expected to stay above the RBI’s target of 4% in 2025 as well.\n\nOn the upside, there’s some positive news about interest rates. DBS expects the RBI to start cutting rates as early as February next year, with a potential total reduction of up to 0.75% by the end of 2025. This could bring the repo rate down from the current 6.5% to 5.75%.\n\nThere are other concerns as well—such as potential tariffs from U.S. President-elect Donald Trump. If such tariffs are imposed on Indian exports, it could put additional pressure on the Indian Rupee, which has already been on a downward trend.",
    "title": "What’s in store for the global economy in 2025?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/whats-in-store-for-the-global-economy",
    "date": "October 26, 2025"
  },
  {
    "learning": "Every year, countries from around the world come together for a big climate summit under the United Nations Framework Convention on Climate Change (UNFCCC). This year, the 29th Conference of Parties, or COP29, took place in Baku, Azerbaijan. These meetings aim to tackle climate change by setting goals, discussing funding, and finding ways to cut greenhouse gas emissions worldwide. But COP29 wasn’t just about ambitious goals—it quickly turned into a clash of interests, unkept promises, and growing frustration, especially for India.\n\nIn 2009, during COP15 in Copenhagen, developed countries promised to mobilize $100 billion every year by 2020. The idea was to help developing nations adapt to climate change and reduce their emissions.\n\nBut here’s the catch: the $100 billion wasn’t based on any detailed analysis of actual needs. Experts later criticized it as a convenient number, more about politics than addressing real problems. It was meant to satisfy developing countries without committing to something too ambitious.\n\nThe $100 billion target wasn’t met on time. According to the OECD , $83.3 billion was mobilized in 2020 and $89.6 billion in 2021. Early estimates suggest the goal was only finally reached in 2022.\n\nTo make matters worse, the definition of climate finance is fuzzy. Many countries include spending that isn’t directly related to climate action or count guarantees that don’t translate into real funds for mitigation or adaptation projects.\n\nIndia’s response? Outrage. Indian officials slammed the proposal as \"a joke\" and accused Azerbaijan’s presidency of \"stage-managing\" the talks to favor developed countries. In a sharply worded statement, India said: \"This has been stage-managed, and we are extremely disappointed.\"",
    "title": "India rejects $300 Billion climate deal",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-rejects-300-billion-climate",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "In October 2024, the Indian stock market saw one of the largest sell-offs by foreign institutional investors (FIIs) in recent history. FIIs sold a massive ₹82,000 crore (about $10 billion) in just a single month. This outflow of foreign money has even surpassed the previous record of around ₹62,000 crore that FIIs withdrew during the COVID-19 pandemic in March 2020.\n\nBut before diving into the details, let’s first clarify who FIIs are, for those who may not be familiar. Simply put, FIIs, or Foreign Institutional Investors, are large financial institutions from other countries. These include hedge funds, pension funds, or asset management companies that invest significant amounts of money in countries like India. They move their money across global markets, looking for the best returns. When FIIs buy stocks in a country, they can have a big impact on the market. There's also a sentiment aspect to this. When FIIs buy or sell in large quantities, other investors often see it as a signal, influencing their own decisions. We believe this is what happened in October 2024.\n\nThe reason this sell-off is such a hot topic is that it comes as a bit of a surprise. Earlier this year, FIIs were buying Indian stocks, helping drive a market rally, but now they seem to be doing the opposite.\n\nShift to China: China has introduced significant stimulus measures to boost its economy, making it an appealing option for global investors. This has led to a \"Sell India, Buy China\" trend as investors move their funds where they see more opportunities.\n\nGlobal Economic Factors : Despite the recent 0.5% rate cut by the Federal Reserve and expectations of more cuts, the yield on the 10-year US Treasury bond has increased from about 3.6% to 4.2%. Why? One reason could be that traders were too optimistic about aggressive future rate cuts by the Fed and are now adjusting their expectations. Or it could be that the market believes we’re unlikely to return to the pre-pandemic world of zero interest rates, making this a shallow rate cut cycle.\n\nBonds and stocks often compete for investment dollars. As bond yields rise, the appeal of investing in equities decreases, as investors can achieve better returns with lower risk by choosing bonds. This shift might be causing FIIs to move their money out of Indian markets and reallocate it to the US. A stronger dollar is also a factor. After a period of decline, the US dollar has been rising alongside US bond yields.",
    "title": "₹82,000 Crore Gone! Why Foreign Investors Are Ditching Indian Markets",
    "articleUrl": "https://thedailybrief.zerodha.com/p/82000-crore-gone-why-foreign-investors",
    "date": ""
  },
  {
    "learning": "Reliance Industries, one of India's largest industrial conglomerates, boasts a market capitalization exceeding ₹20 lakh crore and holds a substantial 9% weightage in the Nifty 50. The company's diverse portfolio spans from oil and gas to retail, telecommunications, and new energy.\n\nAcross its various business segments, Reliance reported ₹9.3 lakh crore in sales and ₹77,000 crore in profits over the past year. Given its size and extensive presence, any change in Reliance's operations has a ripple effect across the Indian economy. During their recent Annual General Meeting (AGM), several key insights were revealed.\n\nReliance's O2C business remains its largest revenue generator, but it’s adapting to a changing world. The global pressure on oil producers and refiners to reduce emissions is pushing companies to move away from fossil fuel-based activities. Government-owned refiners like Indian Oil, Bharat Petroleum, and Hindustan Petroleum are making significant investments in petrochemicals to shift from the low-margin oil refining business. Reliance seems to be following a similar path.\n\nLast year, the company processed 60 variants of crude oil, despite volatile crude prices. Reliance is also expanding into speciality chemicals like PVC, which are essential for India's growing construction sector. This move aligns with the government's focus on self-sustainability and infrastructure development.\n\nSustainability is becoming a focus for Reliance, albeit within the constraints of the industry. The company now recycles 2 billion plastic bottles annually and aims to increase this number to 5 billion next year. Despite the global pressure to reduce fossil fuel use, Reliance is finding ways to make its O2C business relevant for the future. This includes investing in advanced technologies and exploring more efficient production methods.\n\nReliance Retail operates in an increasingly dynamic environment. On one hand, there is a rising class of mass affluent Indians with growing spending power, along with trends like premiumization and the rapid penetration of digital payments. On the other hand, there's the rise of quick commerce, offering instant convenience—a sector where Reliance Retail is also making strides. In this environment, Reliance Retail operates 18,000 stores across India.",
    "title": "Reliance Industries is trying to transform itself",
    "articleUrl": "https://thedailybrief.zerodha.com/p/reliance-industries-is-trying-to",
    "date": "2025-10-26T06:18:40.589Z"
  },
  {
    "learning": "The catalyst for this discussion was an edition we published on Thursday , focusing on the recent developments in the oil markets. China, a key player in global economics, has been causing a significant decline in oil demand. In short, oil demand is falling globally because the Chinese economy is in bad shape.\n\nEven if you've only been following the news from a distance, you might already know that China’s economy has been struggling for a while. But what’s less understood is why it’s in such a state, how China became the powerhouse we know, and what’s causing its current domestic problems.\n\nTo grasp what’s happening in China today, we need to step back in time to the 1980s, when China’s economic reform journey began. Back then, China and India were roughly at the same economic level. For context, India's per capita GDP was about $380, and China’s was around $430—a negligible difference. However, what followed in China was nothing short of spectacular.\n\nFrom the 1980s onwards, China’s economy grew at an average rate of 10%. This unprecedented growth, often termed the “Chinese Miracle,” has no close comparison in modern economic history. Sustaining a 10% growth rate for 20 to 30 years transformed China into the world’s second-largest economy by GDP, all within a brief period from the 1980s to around 2010.\n\nChina’s economic rise was driven by what is known as an investment-led growth model. This model isn’t unique to China; it has roots in the Soviet Union, pre-World War I Germany, and was later adopted by countries like South Korea, Japan, and the Asian Tigers. The model involves two key components: massive investment and the suppression of household consumption.\n\nChina poured immense amounts of money into building an industrial base, a real estate sector, and infrastructure that didn’t previously exist. It created entire cities, schools, healthcare facilities, and commercial complexes from scratch. But where did the money come from? The answer lies in a deliberate policy to suppress household consumption, which kept wages low and interest rates artificially depressed, effectively transferring wealth from households to industry.",
    "title": "Weekly Brief: China's economic history, the early August panic, and are Indian markets overvalued?",
    "articleUrl": "https://thedailybrief.zerodha.com/p/weekly-brief-chinas-economic-history",
    "date": "October 26, 2025"
  },
  {
    "learning": "In yesterday's episode, we discussed how Bajaj Finance saw a rise in bad loans. While this quarter seemed manageable for them, their Non-Performing Assets (NPAs) tell a different story. Bajaj’s bad loans increased from 0.31% last year to 0.38% this quarter, and their loan collections have declined across the board.\n\nOverall, Bajaj Finance’s rising bad loans are a concern for now, but we can't predict the future based on one quarter. The increase in bad loans could be due to elections, heatwaves, or seasonal effects. We'll have to wait and see if this is a one-off situation or the beginning of a troubling credit cycle.\n\nHowever, it seems like this issue isn't isolated to Bajaj Finance. Axis Bank, India’s 3rd largest private bank, also released its quarterly earnings, and things aren't looking great there either. Their number of bad loans has risen slightly, which is worrying.\n\n“The gross slippage of our wholesale business increased year on year due to small value accounts, all less than 100 crores in individual size. This resulted in the bank's gross slippage ratio being 1.97%, a 10 basis point increase. We continue to monitor our retail unsecured portfolio closely and have proactively taken risk actions on growth and underwriting filters as needed.”\n\nThe retail segment was hit the hardest, contributing to over 80% of the bad loans this quarter. Their bad loan ratio for this quarter stood at ~2.0%, a significant increase from 1.4% in the previous quarter. Although this is just for one quarter, it is still concerning.\n\nThis means borrowers are taking on too much debt from multiple lenders, which is a big problem. It indicates that consumers are in bad shape, and historically, when people borrow too much, it rarely ends well.",
    "title": "India China, bhai bhai…again!",
    "articleUrl": "https://thedailybrief.zerodha.com/p/india-china-bhai-bhaiagain",
    "date": "October 26, 2025"
  }
]